[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55091722, "type": "ic", "edited": "2019-03-09T06:14:51.871953", "format": "raw", "posted": "2019-03-09T06:14:51.871920", "text": "Delinquent Time"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55091727, "type": "ooc", "edited": "2019-03-09T06:15:08.977308", "format": "raw", "posted": "2019-03-09T06:15:08.977308", "text": "(( it's time to knock this boy down a few pegs"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55106810, "type": "ic", "edited": "2019-03-10T04:36:05.920169", "format": "raw", "posted": "2019-03-10T04:36:05.920169", "text": "There were a few factions of delinquents spread throughout the high schools in Tokyo, and within each school there was typically a delinquent that was considered the leader. Jyushi was the head of his high school, ensuring that the delinquents left his brothers alone and if he had acquired a taste for violence along the way, then so be it - it helped that he found that he was pretty good at holding his own in a fight.\r\n\r\nIt also brought a lot of attention to himself, so he often walked home on his own in case he got challenged to a fight. It took longer but he didn’t have to worry about protecting his brothers.\r\n\r\n“Can we hurry this along, I have better places to be.” He asked, keeping his hands in his pockets."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55563746, "type": "ic", "edited": "2019-04-06T04:56:29.396517", "format": "raw", "posted": "2019-04-06T04:56:29.396517", "text": "High school delinquents weren't usually much of a problem to a regular student. As long as one stayed on their good side and ignored them, they wouldn't get violent. It's a different world altogether for the delinquents themselves, with fights often breaking out and groups establishing rivalries.\r\n\r\nWith Jyushi being the delinquent leader of his high school, it made sense for other school groups to target him. One group in particular had been planning to kidnap Jyushi, and today was the day they'd put that in motion.\r\n\r\nThe squad of five stop walking for a moment behind him, snickering among themselves before preparing to fight.\r\n\r\n\"Alright, since you asked sooo nicely,\" the leader grins as he takes off his jacket, handing it to one of his cronies. Strapped to that member's back is a thick bag, which he planned to force Jyushi into after he was overpowered and tied up.\r\n\r\nThe leader, along with two others, get into position before charging at Jyushi."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55563928, "type": "ic", "edited": "2019-04-06T05:07:59.446319", "format": "raw", "posted": "2019-04-06T05:07:59.446319", "text": "“You’re polite, I’ll keep that in mind.” He states, shrugging off his own jacket.\r\n\r\nThree against one wasn’t fair and he’d likely end up with a couple scratches that would need to be patched up when he got home. All he needed to do was teach the group a lesson and then he could continue home. \r\n\r\n“But it seems like you’re a little more bark than bite.” He charges into the fray as well, ready to fight and without a single clue what this group of delinquents had in mind for him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55564061, "type": "ic", "edited": "2019-04-06T05:16:20.917652", "format": "raw", "posted": "2019-04-06T05:16:20.917652", "text": "The delinquents sidestep out of the way, shuffling behind Jyushi and kicking his back to shove him towards another member. He acts quickly, pinning him down to the ground as the other members pile on top of Jyushi's back to hold him still.\r\n\r\n\"Too bad for you that we aren't looking for a fight,\" the leader chuckles as the member with the bag approaches Jyushi. \"No, we want something else from you... your dignity and pride.\"\r\n\r\nThe bag delinquent digs through his pockets before pulling out a thick cloth, bending down to shove it in Jyushi's mouth. He moves his hand towards him, ready to plug his nose to force him to cooperate."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55564153, "type": "ic", "edited": "2019-04-06T05:23:12.831127", "format": "raw", "posted": "2019-04-06T05:23:12.831127", "text": "Jyushi grunts as he’s kicked to the ground, pushing his hands out in front of him to catch himself and scuffing up his palms seconds before he’s pinned against the concrete. He tries twisting and getting out from under the small group but to no avail.\r\n\r\n“Tough chance you’re getting that from me,” he sneers, holding his head as high as he’s able from his position on the ground. \r\n\r\nHe raises an eyebrow in confusion when he sees the delinquent with the bag pull out the cloth gag. What exactly was this group thinking? \r\n\r\n“Why don’t you all just fu-umphhh!” Jyushi’s snide comment quickly turns into muffled shouting as he’s gagged. And he jerks more when his nose is plugged up, eyes wide as his vision starts to go black."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55564285, "type": "ic", "edited": "2019-04-06T05:34:02.931777", "format": "raw", "posted": "2019-04-06T05:34:02.931777", "text": "\"That's it, struggle for us,\" the leader laughs, a boner forming in his pants as he feels Jyushi squirm underneath him. \"Turns us on more than anything else. At least until you go limp...\"\r\n\r\n\"You're gonna regret getting on our bad side,\" the guy holding his nose sneers. \"You're scared aren't you? Pathetic.\"\r\n\r\n\"Just relax... you'll be in your new home when you wake up.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55564381, "type": "ic", "edited": "2019-04-06T05:41:55.345858", "format": "raw", "posted": "2019-04-06T05:41:55.345858", "text": "Jyushi can barely focus on their words, but he catches enough to be completely confused. New home? Were they trying to kidnap him?\r\n\r\nIt was a little too late for him to put the pieces together, body going slack as he finally ran out of air and passed out."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55564498, "type": "ic", "edited": "2019-04-06T05:50:50.705498", "format": "raw", "posted": "2019-04-06T05:50:50.705498", "text": "The group works quickly to stuff Jyushi in the sack, focusing on walking back to the leader's house to confine him in his final layers of bindings.\r\n\r\nWhen they get to his apartment, they waste no time in stripping him and shoving his limbs into a rubbery bitchsuit, forcing them to fold so he'd have no choice but to crawl on his elbows and knees. The suit seals up his cock, leaving him with no way to cum.\r\n\r\nA spiked collar is then strapped around his neck - the tag reading \"Feisty Bitch.\"\r\n\r\nThey place him on his back on the floor, deciding to play video games in the other room until he woke up."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55564602, "type": "ic", "edited": "2019-04-06T05:58:35.711883", "format": "raw", "posted": "2019-04-06T05:58:35.711883", "text": "It takes a little while for Jyushi to regain consciousness, and even then he does so slowly. He doesn’t recognize the room he’s in and only remembers the start of the fight with the group of delinquents. He half expects to see that someone found him unconscious in the street they brought him back home and called his brothers who would likely be on their way to pick him up.\r\n\r\nNo such luck when he discovers that he’s alone, staring up at the ceiling of a mostly empty room. He sees a pile of dog toys and a large dog bed but no dog in sight. Where the hell was he? \r\n\r\nHis only real clue is the sounds coming from the next room over. But when he tries to get up to investigate he discovers his real predicament of being trapped in the bitchsuit. It’s mostly black with a brown chest - likely resembling a doberman. Jyushi snarls in frustration, rocking on his back until he’s able to turn himself over.\r\n\r\nThat was one problem solved. His next mission is to pad to the room with all the noise on all fours, seeing that the voices belong to the same group of delinquents from before."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55597326, "type": "ic", "edited": "2019-04-08T04:41:08.238456", "format": "raw", "posted": "2019-04-08T04:41:08.238456", "text": "It takes a moment for the group to notice Jyushi on all fours in the doorway. They pause the game, snickering and giving him cocky grins.\r\n\r\n\"Did you enjoy your nap, pup?\" The leader asks, he and his friends approaching him. \"Did you get lonely and want to play with us? Is that it?\"\r\n\r\nHe ruffles his hair while his friends surround him, one poking at Jyushi's exposed asshole with his index finger. Another rubs at his trapped cock underneath the bitchsuit. The leader then takes out the cloth gag to replace it with a new one - a fairly big ring gag.\r\n\r\n\"Open up, puppy,\" he commands, dangling it in front of his face. \"Open wide for your treat.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55597504, "type": "ic", "edited": "2019-04-08T04:50:49.576785", "format": "raw", "posted": "2019-04-08T04:50:49.576785", "text": "Jyushi scowls. So they had kidnapped him. Jerks. And whatever they’d put him in, it was impossible for him to get out of on his own. He stands his ground as the group approaches, eyes narrowing hatefully as he’s spoken down to like an actual dog.\r\n\r\nHe turns his head away from the one ruffling his hair, biting hard into the gag and resisting the urge to growl. That’d only prove their point. He can’t help the help that comes out of him when one pokes his asshole, clenching up and startling. \r\n\r\nHe tries to squirm when they touch his trapped cock, the movement translating to his leg thumping against the floor like he was happy about the touching. \r\n\r\nJyushi grits his teeth, snarling under his breath. “Fuck yo-!”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55597632, "type": "ic", "edited": "2019-04-08T04:59:04.421160", "format": "raw", "posted": "2019-04-08T04:59:04.421160", "text": "The group leader frowns, nodding to one friend who takes a clothespin and clips it to Jyushi's nose. He yanks his hair back to hold him still, letting go once the leader finally gets it inside his mouth.\r\n\r\n\"Wow, that's quite a big gag,\" he chuckles, sticking two fingers in his mouth. \"Wonder what else can fit in that mouth of yours?\"\r\n\r\nHe unzips his pants, taking out his half-hard cock and shoving it in Jyushi's face.\r\n\r\n\"Take my cock, you dumb bitch,\" he groans, gripping onto the sides of his head before shoving it down his throat. He doesn't even bother to take the clothespin off of his nose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55597733, "type": "ic", "edited": "2019-04-08T05:06:22.463074", "format": "raw", "posted": "2019-04-08T05:06:22.463074", "text": "Jyushi sputters when the clothespin is add, forced to breath through his open mouth. He sneers as best he can when someone puts their fingers inside. They were just lucky that the ring gag prevented him from closing his mouth and biting their fingers.\r\n\r\nLuckier still when the same delinquent shoved his cock in his mouth. He wheezes when he first realizes that he can’t breath at all with the clothespin still on his nose.\r\n\r\nIt doesn’t take long before his vision starts to blur as the delinquent fucks his throat."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55639459, "type": "ic", "edited": "2019-04-10T17:52:54.256352", "format": "raw", "posted": "2019-04-10T17:52:54.256352", "text": "The delinquent is so lost in the pleasure of fucking Jyushi's throat that he doesn't realize he can't breathe. It isn't until one of his friends takes the clothespin off that he realizes it, too focused on humiliating and abusing Jyushi.\r\n\r\n\"Your throat is so tight,\" he groans as he tugs his hair back. \"I wonder how many cocks you've sucked behind your school building, Matsuno? I mean, how the fuck else would someone like you get so high up on the food chain?\"\r\n\r\nThe delinquent gasps as he cums seconds later, getting off on his own words. When he pulls out, he ruffles his hair, chuckling as cum dribbles from his open mouth.\r\n\r\n\"You're nothing, Matsuno,\" he sneers, giving him a slap to the cheek. \"Nothing but a pathetic cum slut puppy.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55639859, "type": "ic", "edited": "2019-04-10T18:23:05.297716", "format": "raw", "posted": "2019-04-10T18:23:05.297716", "text": "Jyushi’s nostrils flare as he takes a deep breath, incidentally inhaling more of the delinquent’s cock at the same time. He’s pissed, but more relieved than anything that he’s able to breath at least somewhat properly again. \r\n\r\nHis scowl comes back at the harsh words but he’s not able to argue that he can hold his own in a fight when it isn’t a whole group just against him. He won his position at his school the way any delinquent would.\r\n\r\nA good portion of the cum shoots directly down his throat forcing Jyushi to swallow, but the rest he leaves to drip out of the open gag. Sure he’s being laughed at but it’s better than swallowing."}]