[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313600, "type": "ic", "edited": "2018-09-30T06:21:26.112809", "format": "raw", "posted": "2018-09-30T06:21:26.112809", "text": "Shin's grip only grows tighter, his eyes reflecting a sadistic glint as he pulls the cuffs out. Before he can control himself, he pins Ichi down to the ground, towering over him as he roughly cuffs his hands behind his back.\r\n\r\n\"We can go to a shrine together!\" He says in Ichi's ear, voice edging on both gleeful and crazed. \"I have so many places I want to go, especially with my new living sex doll!\"\r\n\r\nHe takes out the cloth from his pocket, shoving it in Ichi's face.\r\n\r\n\"I picked out a nice thick cloth to shove in your mouth! Come on, take it like a good boy!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313643, "type": "ic", "edited": "2018-09-30T06:27:11.605842", "format": "raw", "posted": "2018-09-30T06:27:11.605842", "text": "Ichi yelps in surprise at the sudden movement, groaning in pain as he’s pushed and pinned to the ground by Shin - gangly limbs sprawled out like an innocent fawn. His head is starting to ache from the force that he was slammed into the ground, and he’s certain that the area will bruise in the next few days. \r\n\r\nThe click of the handcuffs locking into place around his wrists has a ring of finality to it as he struggles beneath Shin and tries his damnedest to wiggle out from beneath him. \r\n\r\n“Your what?”\r\n\r\nIt’s the perfect opportunity for Ichi to be gagged with the cloth, cheeks bulging and part of it still sticking out while he tries to spit the whole thing out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313707, "type": "ic", "edited": "2018-09-30T06:37:05.365324", "format": "raw", "posted": "2018-09-30T06:37:05.365324", "text": "After shoving the cloth in his mouth, Shin gets off of Ichi's body, examining him as he fruitlessly attempts to spit the cloth out.\r\n\r\n\"Don't even bother, my dear doll,\" Shin laughs as he pulls out a pair of scissors from his other pocket. \"That cloth is going to stay in your dirty mouth unless I have a use for it.\"\r\n\r\nShin begins to snip away at Ichi's clothes, revealing his pale skin underneath until he's completely naked.\r\n\r\n\"I'm going to have a lot of fun showing you off,\" he says cheerfully as he turns him over on his back. \"And when it's all over, I'll add you to my personal collection at home. You're my first living sex doll, so I'll take good care of you.\"\r\n\r\nHe gives his nipple a pinch before leaving him on the ground, opening the passenger door to make preparations for the long drive ahead."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313762, "type": "ic", "edited": "2018-09-30T06:45:36.947421", "format": "raw", "posted": "2018-09-30T06:45:36.947421", "text": "The loss of his clothing has to be lamented. Ichi always wore his favorite outfit when he took these trips - comfortable clothes that made him feel more at home whenever he was in a new place. The fact that Shin cuts them off rather than undressing him is completely humiliating and, worse still, gives him a clearer picture of what’s happening to him.\r\n\r\nHe isn’t going to need his clothes because Shin considers him his now. Meaning he would would control if and when he wore clothes, and if he was allowed to wear them...what he would wear. \r\n\r\nLike a doll.\r\n\r\nIchi grunts, curling in on himself by drawing up his knees when the man pinches his nipple. Ichi’s body isn’t anything particularly impressive, but he’s reasonably attractive in his own way. Smooth, pale skin and a lithe, flexible frame. \r\n\r\nIt’s what gives him an edge in struggling to his feet while Shin is distracted by the car, working himself into a kneeling position and trying to rise without his arms for balance."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313828, "type": "ic", "edited": "2018-09-30T06:55:51.179560", "format": "raw", "posted": "2018-09-30T06:55:51.179560", "text": "Ichi doesn't get too far before Shin comes back around, picking his new doll up and carrying him to the passenger seat.\r\n\r\nWaiting for him is a large, thick dildo on the seat, lubed up with the fluid shining in the sunlight. Ichi is forced on the dildo without much fanfare, stretching his anal walls and filling him up.\r\n\r\nBelts are wound around Ichi's body soon after, tied to the seat behind him to keep him locked in place. Finally, a blindfold is placed around his eyes, leaving him completely helpless as he takes on his new role.\r\n\r\n\"If we run into a few bumps on the way, that toy in you might thrust up further. Be prepared for that, okay?\"\r\n\r\nHe gives him a pat to the cheek before moving to the driver's seat, locking the doors before taking off."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313909, "type": "ic", "edited": "2018-09-30T07:07:40.977053", "format": "raw", "posted": "2018-09-30T07:07:40.977053", "text": "The look of disappointment on Ichi’s face is more than obvious when Shin is so easily able to catch up to him and sweep him off his feet like a sack of flour. His chances for escape have been far and few between and he doubts he’ll get an easy one once he’s inside the man’s car.\r\n\r\nMade all the more evident when he’s made to sit on the largest dildo that he’s ever seen in his life. \r\n\r\nKnowing what’s about to happen doesn’t make the process any easier. His eyes go wide, nose scrunched up with pain as he slides down the length of the fake cock. It sits uncomfortably in his ass at the halfway point before he can take it the rest of the way down and actually sit on the passenger seat. The feeling of being stuffed so full is a foreign one to Ichi who squirms and moans around his cloth gag, effectively fucking himself on the dildo.\r\n\r\nThe modified seatbelts do even more to hamper any idea of escape that he might have. Two straps wrapping around his body on either side and forming a harness of sorts over his chest, nipples perfectly framed. Then there’s the blindfold. Being thrust into darkness is extremely unsettling and Ichi turns his head from side to side to follow the differed sounds that he hears.\r\n\r\nIchi flinches at the touch to his cheek without missing a beat, lurching forward and moaning when the dildo jolts inside him too with the movement of the car."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 52322968, "type": "ic", "edited": "2018-09-30T23:28:10.163669", "format": "raw", "posted": "2018-09-30T23:21:40.321762", "text": "During the entirety of the car ride, Shin goes out of his way to hit every bump he can to make Ichi suffer. Sharp stops and quick swerves are also on the agenda as he does everything in his power to torture his newly captured doll.\r\n\r\nAfter hours of erratic driving, Shin stops in front of a strip club. The sun has already set, replaced by the moon casting its gentle light. But the world Ichi is about to experience is far from gentle.\r\n\r\n\"I'm about to show you off, dollie,\" Shin whispers in Ichi's ear. \"I even picked out some pretty stripper heels for you to wear, and a collar and leash to boot. How does that sound?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52328322, "type": "ic", "edited": "2018-10-01T04:11:56.882509", "format": "raw", "posted": "2018-10-01T04:11:56.882509", "text": "Every bump in the road has Ichi riding the dildo in his ass, brushing against his prostate and sending jolts of unwelcome pleasure straight up his spine. And every sudden stop and erratic turn do much the same, eliciting muffled moans and whimpers from the thick cloth. It’s essentially every passenger’s worst nightmare and then some as he’s jostled on the seat.\r\n\r\nWorse yet is that he can’t help his reaction, cock twitching to life as his ass is stimulated against his will. Ichi’s saving grace is that it doesn’t make him cum until the last moments of the drive just before Shin pulls into a parking space.\r\n\r\nIchi’s pale skin is flushed red with embarrassment as it shoots onto the glovebox in time with a final grunt before he hangs his head onto his chest.\r\n\r\nHe can’t bear to look Shin in the eye as he speaks but he does seem to shrink into the seat as much as he’s able."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52328573, "type": "ic", "edited": "2018-10-01T04:28:29.007538", "format": "raw", "posted": "2018-10-01T04:28:29.007538", "text": "Shin eyes the cum dripping down the glovebox, deciding that he'll make Ichi clean it up after their little club outing. For the time being, he's more focused on getting him in those heels.\r\n\r\nShin exits the driver's side, hurrying to the back of the car where the heels and leash are waiting. Having retrieved them, he's quick to open Ichi's door and force them on his feet. The black heels are several inches high, looking like a challenge to balance in. But Shin doesn't care, leaning back to admire his work.\r\n\r\nHe undoes the belt straps winding around Ichi's body, red marks on his body from the tightness of their binds. Then he attaches the collar around his neck, followed by the leash.\r\n\r\n\"Follow me, my precious doll,\" he says after he's removed him from the dildo. With a sharp tug, he leads him towards the entrance to the club."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52328796, "type": "ic", "edited": "2018-10-01T04:45:56.464369", "format": "raw", "posted": "2018-10-01T04:45:56.464369", "text": "Unable to read Shin’s intentions for the future, Ichi finds himself releasing a breath he didn’t know he was holding when nothing is said or done about the cum. He might not have been experienced sexually speaking but he’s more than aware of the precarious situation he’s in - at Shin’s mercy.\r\n\r\nIt’s one of the main reasons that he doesn’t struggle when Shin opens the door and starts to ready him for the club. That and there isn’t much he’d be capable of either.\r\n\r\nWhen he’s removed from the dildo with a fair bit of moaning and more squirming, Ichi’s eyes briefly close as he tries to recollect himself. The embarrassment doesn’t lessen as he’s led through the parking lot by the leash. \r\n\r\nHe nearly stumbles when Shin jerks on it at first, unaccustomed to balancing without his arms at the ready to catch him. Still, he somehow manages to stay on his feet - taller than usual and walking with an awkward gait."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52328905, "type": "ic", "edited": "2018-10-01T04:55:33.197526", "format": "raw", "posted": "2018-10-01T04:55:33.197526", "text": "Music streams outside once the doors to the club are open, many people catching an eyeful of Ichi as his new master leads him inside. It was common for people to be naked at these kinds of clubs, of course, but being handcuffed and paraded around like a pet was another story.\r\n\r\nIt's not an unwelcome deviation in the slightest, though. Smoky gazes and satisfied smiles light up many of the club-goers faces as Ichi is led around the club.\r\n\r\n\"Don't be surprised if someone grabs your ass,\" Shin whispers to Ichi. \"There's lots of people around here that are like me.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52329636, "type": "ic", "edited": "2018-10-01T05:50:36.258092", "format": "raw", "posted": "2018-10-01T05:50:36.258092", "text": "Ichi counts himself lucky that he’s adept at avoiding eye contact. It does nothing for the amount of attention on him but he can at least pretend like this is happening to anyone in the world except for him. Out of his brothers he was likely the most uncomfortable and anxious around other people and that gave him more than his fair share of experience when it came to ways of coping. \r\n\r\nIt’s probably for the best that he keeps his eyes on the ground anyway, focused solely on putting one foot in front of the other. It might look uncoordinated and awkward but he’s still standing and he takes some comfort in the fact. \r\n\r\nAnd Ichi might be capable of hiding how terrified and anxious he is but that does absolutely nothing for the red flush traveling down his chest at Shin’s comment. Layers of clothing usually did the job of hiding just how visceral his reactions to embarrassment and shame were but he doesn’t have that at the moment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52345189, "type": "ic", "edited": "2018-10-02T05:01:22.335692", "format": "raw", "posted": "2018-10-02T05:01:22.335692", "text": "Shin takes note of Ichi's flushed form as he leads him to the men's restroom, pride swelling in his chest from how helpless he's made him. His intentions with Ichi are clear as he tugs him inside a stall and presses him face-first against the wall.\r\n\r\n\"You ass is practically begging to be stuffed again, isn't it?\" Shin whispers in his ear. \"Don't worry, I can arrange that for you.\"\r\n\r\nPulling out a bottle of lube from his pocket, Shin wastes no time tugging his pants down and applying it to his own cock. Cock fully lubricated, he prepares himself, sliding inside Ichi's ass with a smack to his cheeks.\r\n\r\nHe doesn't even bother to shut the door. But he doesn't seem to care that other men are watching him and Ichi get it on."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52359611, "type": "ooc", "edited": "2018-10-03T06:07:59.004281", "format": "raw", "posted": "2018-10-03T06:07:59.004281", "text": "Hey sorry, need to work on some projects then I’ll start replying again"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52359680, "type": "ooc", "edited": "2018-10-03T06:16:06.867801", "format": "raw", "posted": "2018-10-03T06:16:06.867801", "text": "(( alright, thanks for letting me know!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52369608, "type": "ic", "edited": "2018-10-04T00:47:41.378374", "format": "raw", "posted": "2018-10-04T00:47:41.378374", "text": "He couldn’t have been fortunate enough to have been brought into an empty restroom. Ichi tries to shrink in on himself, ashamed of the eyes that turn to linger on his nude form. It’s not his fault, he wants to say, he isn’t supposed to be here and he doesn’t want to stick around long enough to discover exactly what Shin has in store for him. What comes out is a strangled series of moans from behind the gag as his heels click on the bathroom tile.\r\n\r\nIchi yelps as he’s corralled into the stall, head pressed almost painfully against the wall. He’s still trying to catch his balance, halfway bent as he attempts to struggle and pull away, ass sticking out. \r\n\r\nHe’s still squirming when Shin first forces himself inside and starts thrusting. It’s completely different than being in the car and riding the dildo. Shin’s cock doesn’t stretch him nearly as much but the man is far more active and Ichi doesn’t have a moment of rest as he’s being fucked against the wall."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52372973, "type": "ic", "edited": "2018-10-04T03:59:03.923329", "format": "raw", "posted": "2018-10-04T03:59:03.923329", "text": "Thrust after thrust assaults Ichi's ass as Shin refuses to let up for a second. Groaning and panting in his doll's ear, he's merciless as he toys with him and smacks his ass. His struggles don't deter him in the slightest, if anything his wriggling urges him on.\r\n\r\n\"Shake your ass properly, my little doll,\" he moans as the rest of the bathroom has their eyes on Ichi. \"Show these men how much of a slut you are for my cock.\"\r\n\r\nHe gives him another smack before he begins stroking Ichi off, desperate to see him make a fool out of himself.\r\n\r\n\"I might even let some of these gentlemen have a turn with you. What do you think about that?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52373202, "type": "ic", "edited": "2018-10-04T04:12:18.181827", "format": "raw", "posted": "2018-10-04T04:12:18.181827", "text": "Tears begin to build in the corners of Ichi’s eyes. It’s a bit of a surprise to him that he hasn’t before this moment since they’ve been a long time coming. The shock of being kidnapped must have delayed them - subdued solely by just how vulnerable he was to be taken so easily. The severity hits Ichi full force now, futilely trying to escape being fucked and teased by Shin. His brothers wouldn’t bother looking for him for some time and by the time that they got around to it, he and Shin would likely be long gone.\r\n\r\nIchi often finds himself to be pragmatic in nature - with little care for how events will turn out either way, but the implication that he’ll remain with Shin for an extended period of time has him sniffling loudly as he cries.\r\n\r\nHe tries taking deep breaths to soothe himself during the entire process, compose himself as much as he can before the situation can get inevitably worse. And it does when Shin puts his hands around his own limp cock and starts stroking. Ichi’s back arches as his eyes go wide with shock, impaling himself further on Shin’s cock as well.\r\n\r\nThings go just as poorly for Ichi as they did in the car after a few minutes pass. Eventually his cock responds to the treatment and sends a flush of pleasure that he can’t help into the pit of his stomach, followed shortly after by his cumming onto the toilet seat. \r\n\r\nIchi blushes again - and at this point the change in color might as well be permanent. He rubs his head against the tiled wall in an effort to ground himself, all the while trying to verbally respond that he doesn’t want what Shin is suggesting at all."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52373613, "type": "ic", "edited": "2018-10-04T04:35:24.369698", "format": "raw", "posted": "2018-10-04T04:35:24.369698", "text": "As Ichi's muffled sobs fill the room, Shin's cock twitches further, soon cumming in his ass. Cum leaks out of his hole when he finally pulls away, the sticky substance running down onto the floor.\r\n\r\nThe newly made doll's protests do little to stop him as he motions an interested man forward, who takes his position behind Ichi as he lubes up his cock.\r\n\r\n\"Don't worry, dollie,\" Shin says with a chuckle as the new man thrusts inside him. \"I'll be sure to let you rest after this.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52373733, "type": "ic", "edited": "2018-10-04T04:43:32.405516", "format": "raw", "posted": "2018-10-04T04:43:32.405516", "text": "Ichi’s chest heaves as Shin cums inside him, a chill running up his spine as it leaks from his hole and drips down his legs. And he starts trembling as soon as the second man, the stranger, takes a similar position behind him. \r\n\r\nHe whines as the man starts to fuck him and Ichi hates himself for the idea that starts to form in his mind. The other man isn’t nearly as controlling of his movements, having neglected to shove his face into the wall from the start, so Ichi turns to look behind him as much as he can in an attempt to see Shin. \r\n\r\nUnable to verbally communicate he tries what he can to make himself look as miserable as possible while still being thrust into. Given the situation it isn’t that hard, but he does try to convey that it isn’t the fucking he has a problem with, it’s the man himself. Ichi whines as loudly as he can through the gag, twisting and squirming and nearly losing his balance in the heels. He’d resisted when Shin used him but not nearly as much.\r\n\r\nAnd he’d much rather be fucked by one man than passed around a men’s bathroom."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52374000, "type": "ic", "edited": "2018-10-04T04:59:33.286340", "format": "raw", "posted": "2018-10-04T04:59:33.286340", "text": "Ichi's struggling and whining only edges his assiliant further, cumming even faster inside of him before he's shoved back towards Shin. Even more cum leaks from his hole as the onlookers examine him, but his master makes it clear that he only intended for Ichi to get fucked by one passerby before calling it a night. But he does promise to bring him back to the club sometime soon.\r\n\r\nLeading Ichi out of the bathroom by the leash, Shin doesn't say anything to him as several people pinch and smack his ass. Each one is rough, as if they don't see Ichi as an actual human being.\r\n\r\nAt this point, he's nothing but a plaything. Or a living sex doll, as Shin loved to call him.\r\n\r\nBy the time he's lead back to the car, it's late enough at night that the sky is pitch black and only the moon and club lights illuminate the street below. The cum on the dashboard is still waiting for Ichi to clean up abd Shin wastes no time in taking the thick cloth out of his mouth and dampening it in his cum. He soon shoves the cloth back inside, his own cum pressing against his tongue as the taste fills his mouth.\r\n\r\n\"We're going to a hotel next,\" Shin explains as he inches him back on the dildo and rebinds him with belts. \"Hope you don't mind me cuddling you like a pillow all night.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52374172, "type": "ic", "edited": "2018-10-04T05:08:29.759939", "format": "raw", "posted": "2018-10-04T05:08:29.759939", "text": "Ichi’s heart nearly skips a beat when the man finishes up and shoves him towards Shin. Still cuffed and learning to balance on his new heels makes the idea of falling an extremely painful one, and he’d like to avoid it at all costs. Thankfully, Shin catches him before he can and he can feel his gratitude rising when the man makes it clear that only one stranger would get to fuck him - at least on this visit.\r\n\r\nHis gait out of the club is quick and awkward, cum still sliding down his legs as he jolts with every pinch and slap to his ass. A living sex doll.\r\n\r\nThe change in lighting takes Ichi by surprise. He hadn’t realized how much time had actually passed in the club, too focused on his anxiety about being seen in such a state in public.\r\n\r\n“No, wait, plea-“ He starts to say as Shin wipes up his own cum with the cloth gag, abruptly cut off by the reinsertion - now damp with his own cum and saliva. It’s an unpleasant taste that Ichi imagines he’ll have to get used to in time. \r\n\r\nThe same goes for the dildo that slides back into his ass while he’s buckled in by the crossing straps that hold him in place."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52374429, "type": "ic", "edited": "2018-10-04T05:24:36.110866", "format": "raw", "posted": "2018-10-04T05:24:36.110866", "text": "Shin finishes Ichi's ensemble with the blindfold before shutting the passenger door. Ichi is only alone for a few seconds before his master opens the driver's door, the car soon starting up and driving away.\r\n\r\nShin intentionally hits several bumps on the way to the hotel, all in an effort to make Ichi whine. When they arrive at the hotel, he grabs for a big roll of tape under his seat and shows it to Ichi after taking off the blindfold.\r\n\r\n\"I'm going to wrap you up in so many layers that you'll barely be able to budge,\" Shin says as he opens the door. \"But that cute cock is still going to be on display for me to play with. Living sex dolls live to please their masters, after all.\"\r\n\r\nWhen he reaches the other side of the vehicle and opens Ichi's door, he wastes no time in untying him - only to wrap him up with several layers of tape. He's wrapped from his neck down to his toes, leaving very little room to wiggle before he's blindfolded again.\r\n\r\nShin takes his bound form from the seat, shoving him into a suitcase with his limbs bent to fit inside. With his doll now trapped in the suitcase, Shin shoves him onto a hotel cart and pushes it towards the front desk to make arrangements."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52374530, "type": "ic", "edited": "2018-10-04T05:32:07.706384", "format": "raw", "posted": "2018-10-04T05:32:07.706384", "text": "The blindfold is a new edition to his restraints that Ichi is quick to discover he doesn’t like. At least before on the road he was able to anticipate the upcoming bumps and pass the time by looking out the window. Being left in darkness means that every movement of the dildo is a complete surprise that has Ichi moaning and twitching in his seat. \r\n\r\nThe young man blinks owlishly when the blindfold is removed in the hotel parking lot, if only to be shown the roll of duct tape about to be used to restrain him. The methodical way in which Shin tapes him up makes it nearly impossible to use his temporarily earned freedom. \r\n\r\nTesting his new bonds, Ichi tries to move and is disappointed but not surprised to find that it’s not worth the time and effort it would take to do much more than wriggle on the floor. At least that’s what he’s noticed before Shin bends him at the waist like a doll and forces him inside a suitcase."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52402348, "type": "ic", "edited": "2018-10-06T04:47:34.364435", "format": "raw", "posted": "2018-10-06T04:47:34.364435", "text": "After making arrangements for the night, Shin takes the key and carries the suitcase Ichi's trapped in up to his hotel room. When he enters, he's quick to throw the suitcase on top of the bed and starts to unpack.\r\n\r\n\"You look delightfully helpless, dollie,\" Shin says as he removes Ichi from the suitcase and lays him out on the bed. \"I hope the bed is nice and cozy for the both of us.\"\r\n\r\nHe gives him a quick kiss to the cheek before patting it roughly, then begins to undress in front of him.\r\n\r\n\"Don't worry, I'm not going to fuck you for the rest of the night,\" he assures, sliding next to Ichi's mummified form. \"But I am going to be clinging to you like a pillow. You may be a sex doll, but you're also my cuddle buddy.\"\r\n\r\nShin wraps his arms around Ichi and pulls him into an embrace, pulling back with a quick smack to the ass.\r\n\r\n\"Tomorrow, we're going to go to a few more places. I'm sure the people there will be excited to play with you.\""}]