[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52402883, "type": "ic", "edited": "2018-10-06T05:25:42.389641", "format": "raw", "posted": "2018-10-06T05:25:42.389641", "text": "Ichi is painfully aware of how the environment is so familiar to him. He didn’t travel with a lot of money but every so often he would splurge and spend the night in a hotel room.\r\n\r\nSo the kitschy paintings and cheap desk aren’t new sights to him, nor is the single bed with its new white bedspread. It used to feel like a home away from home, now it just feels wrong. Like he’s one of the objects in the room and not a living, breathing person.\r\n\r\nThe unfortunate Matsu yelps through his cloth gag at the smack but tries to settle into some semblance of normality. Shin has said himself that he isn’t going to use Ichi tonight, which means he’ll be able to get some rest in preparation for whatever horrible things he’ll have to confront in the morning. \r\n\r\nAt the last statement, Ichi squirms and bucks until he’s in an uncomfortable position on his side. A sacrifice that he’s able to make alongside nuzzling his head into Shin’s shoulder in an effort to convey the same idea that he’d tried at the strip club.\r\n\r\nHe’d much rather be Shin’s alone."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53397977, "type": "ic", "edited": "2018-12-09T03:24:40.037986", "format": "raw", "posted": "2018-12-09T03:24:40.037986", "text": "Shin's hand traces along Ichi's cheek, an oddly gentle gesture given his rough treatment throughout his capture. His eyes scan over his doll's mummified form, taking in the moment as Ichi's face buries his head into his shoulder.\r\n\r\n\"I see you're warming up to me,\" he sighs as he runs his hand through Ichi's hair. \"In such a short amount of time, too... I wonder how close we'll be by the time we get home?\"\r\n\r\nShin gives Ichi a kiss to his bulging cheek as he holds him close, voice rumbling in his ear.\r\n\r\n\"You're going to love your new home, dollie,\" he assures before reaching to turn off the light.\r\n\r\nIn the darkness of the hotel room, Shin runs his hands over Ichi's taped body, resting on his exposed nipples to give them a light pinch. His hands are gentle as he molests him, running along his chest and back, before finally clinging around his form as he drifts to sleep."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53403845, "type": "ic", "edited": "2018-12-09T11:46:22.875528", "format": "raw", "posted": "2018-12-09T11:46:22.875528", "text": "Shin’s far gentler treatment is such a complete one-eighty that Ichi nearly forgets what he’d set out to do to begin with. Though that could likely be traced back to his exhausting day - being kidnapped and paraded around a club like some kind of prize. If his heart weren’t about to beat out of his chest, Ichi might just be the first of the two men to fall asleep. \r\n\r\nAs is, he forces himself not to squirm with discomfort as Shin touches his cheek and ruffles his hair. They’re feather light and Ichi finds himself only half listening to Shin as he struggles to fight his growing exhaustion. \r\n\r\nHe jumps, just barely, when Shin pinches his nipples but not hard enough to illicit any loud response. Only a shiver and quiet moan as Ichi watches Shin fall asleep. He does so himself, in short bursts that leave him jerking awake to see the time displayed on the clock and make sure that Shin is still awake.\r\n\r\nFor whatever reason the thought of being asleep when his captor wakes up terrifies Ichi."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53407235, "type": "ic", "edited": "2018-12-09T19:34:30.515104", "format": "raw", "posted": "2018-12-09T19:34:30.515104", "text": "Shin doesn't consider himself a morning person, but he's more than welcoming of the sunlight filtering in through the curtains and the birds chirping outside. Stretching and yawning, he's slept fairly well. He attributes his good night's sleep with his new sex doll, having clung to him throughout the night like a body pillow.\r\n\r\nShin takes a moment to look over Ichi's sleeping form, smiling to himself before giving his nipples a sharp pinch.\r\n\r\n\"Good morning, my doll,\" he whispers, giving him a kiss to the cheek. \"Did you sleep well? Today is going to be a busy day...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53407302, "type": "ic", "edited": "2018-12-09T19:40:43.996080", "format": "raw", "posted": "2018-12-09T19:40:43.996080", "text": "Ichimatsu is immediately roused from his fitful sleep when Shin pinches his nipples. They aren’t sore but the sudden and sharp pain is more than enough to wake Ichi and give him a reminder of the previous day’s events. The confusion clears from his eyes the longer he has to look around the room and observe his bondage and captor.\r\n\r\nHe flinches when the man kisses his bulging cheek, mouth still stuffed with the cum-stained cloth but almost completely dry with how long he’s been gagged for. \r\n\r\nTears of frustration prick the corners of his eyes when something else catches his attention. His cock, the only thing free of his tape bindings aside from his nipples, is sporting an early morning erection that brings another flush of red to Ichi’s face."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53407489, "type": "ic", "edited": "2018-12-09T19:59:32.262368", "format": "raw", "posted": "2018-12-09T19:59:32.262368", "text": "Shin notices the erection almost right away, humming to himself as his hands slowly travel down his taped body before wrapping around his cock. He gives Ichi a smile before pumping his erection, his strokes slow and gentle as he talks about how the day will go down.\r\n\r\n\"Today is going to be very fun,\" Shin explains. \"First we're going to visit some shrines, where I'll show you off like the pretty doll you are. I'll be sure to throw in a prayer for the gods that you'll stay by my side forever.\"\r\n\r\nHe gives the head of Ichi's cock a kiss before continuing, strokes speeding up along the shaft.\r\n\r\n\"Then we can go back to that strip club at night... the people there are going to enjoy playing with you. I might even have to make you the star of an event. How do you feel about strutting onstage like a pretty little slut?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53407680, "type": "ic", "edited": "2018-12-09T20:15:44.606665", "format": "raw", "posted": "2018-12-09T20:15:44.606665", "text": "Beneath the tape, Ichi can feel his fingers twitching with the urge to clench his fists. Not out of malice, but to ground himself as Shin begins to take care of his erection. The man’s being gentle still, throwing Ichi off kilter for the second time in as many days. It doesn’t line up with everything else Shin has done, but Ichi can’t deny that he prefers being treated like this as opposed to anything worse.\r\n\r\nHe’d have to become accustomed to the man if he couldn’t escape him - get used to life as Shin’s sex doll and cuddle buddy. Would it be easier on him if he just pretended that this was normal? That Shin hadn’t kidnapped him from the side of the road? Probably not. He was only two days in anyhow, it probably wasn’t good that he was already considering the possibility of life with Shin until the man grew bored of him.\r\n\r\nIchi moans as Shin picks up speed, wiggling the best he can to provide more friction to his cock. Humiliating, yes, but the quicker it was over the quicker Ichi would be able to get past the embarrassment.\r\n\r\nHe’s so entranced with the movement that he nearly misses Shin’s mention of the strip club. If it was the same one that meant that they were going to be in the area for at least another night before moving on. Ichi has no idea what Shin’s travel plans include but he can’t imagine anything truly pleasant. \r\n\r\nHe tries shaking his head and grunts when the movement doesn’t fully come through as he cums in Shin’s hand and over his tape bondage. He could handle the shrines he thinks but the strip club was too much."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53412866, "type": "ic", "edited": "2018-12-10T02:17:46.046877", "format": "raw", "posted": "2018-12-10T02:17:46.046877", "text": "Shin smiles as Ichi wriggles and moans behind the cloth gag, taking great pleasure in seeing him struggle to move in his bondage. Once it's all done and he cums into his hand, Shin cleans up the mess with a tissue before throwing it in the trash bin.\r\n\r\n\"You're going to look so wonderful surrounded by a crowd of people at the strip club. How does a tight latex suit sound for the event? I might even put a mask on you, so you won't be able to see the customers when they grope you.\"\r\n\r\nHe leans up to give him another kiss to the cheek, whispering in his ear.\r\n\r\n\"Just a faceless little sex doll for my pleasure... I might even make the mask a permanent addition when I put you on display at home.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53413356, "type": "ic", "edited": "2018-12-10T02:47:42.876202", "format": "raw", "posted": "2018-12-10T02:47:42.876202", "text": "The quiet that he’s forced into makes Ichi antsy. He has no way of protesting being brought to the club again. Though...as much as he would be loathe to admit it, he’s actually thankful for the idea of having a mask through the ordeal. It’d be uncomfortable but it was almost better to think that he wouldn’t be able to see the men violating him.\r\n\r\nIchi sighs through the gag, closing his eyes when Shin kisses his cheek. He just had to bide his time and go through with the man said until the chance to get away came up.\r\n\r\nLaying on the bed, he has no choice but to wait for the man to ready him for the day."}]