[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852096, "type": "ic", "edited": "2018-07-08T06:02:43.653901", "format": "raw", "posted": "2018-07-08T06:02:43.653901", "text": "Oso and Ichi had been the only two Matsus to stay behind while the rest of their brothers went out for various reasons. Usually not such a big deal but of course this would be the night that their house would be broken into. Though the most surprising thing is that they’re the ones that end up getting stolen, each only wearing their boxers as they’d been about to go to sleep. \r\n\r\nNow sitting in the forced back to back position they’d been taped in, the gagged brothers observe the apartment hideout and look to the robbers quizzically."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50852282, "type": "ic", "edited": "2018-07-08T06:13:27.556555", "format": "raw", "posted": "2018-07-08T06:13:27.556555", "text": "The robbers snicker as one pulls out a pair of scissors, approaching the two bound brothers and aiming for their boxers.\r\n\r\n\"Hold still,\" he says as he snips Oso's away. \"You don't want that cute body of yours to get cut up, do you?\"\r\n\r\nOso's cock is soon revealed to the three, the robber focusing on Ichi's next. Now both brothers are completely naked, bodies bared to their captors.\r\n\r\n\"How would you feel about getting each other off, boys?\" One of them asks, cutting off the tape binding them together. \"You've seen each other naked, I'm sure. This shouldn't be a big deal.\"\r\n\r\nThe brothers are soon forced face to face, their mouths still taped as their bodies are pressed together and tied with more tape.\r\n\r\nIt's not long before two vibrators are lubed up and pressed into their asses, buzzing to life inside them as the robbers watch on."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852409, "type": "ic", "edited": "2018-07-08T06:21:28.863202", "format": "raw", "posted": "2018-07-08T06:21:28.863202", "text": "The curiosity soon turns into mild panic as they’re approached with the pair of scissors. They don’t really have the maneuverability to inch away from the sharp tool, so it only takes a matter of seconds before the gagged brothers are stripped of what little clothing they had on.\r\n\r\nThey’d like to take the opportunity being free of the tape to escape but it isn’t long before they’re secured again - this time with their naked bodies pressing up against one another.\r\n\r\nIchi moans through the gag as the vibrator shudders to life inside of his ass at the very same time that Oso starts to twist and squirm.\r\n\r\nIt really doesn’t help either of them. With help from the vibrators and all their rolling around it isn’t long before both brothers are cumming on the other, taped mouths pressed together in the mockery of a kiss."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50860459, "type": "ic", "edited": "2018-07-08T21:26:34.663821", "format": "raw", "posted": "2018-07-08T21:26:34.663821", "text": "The robbers watch as the two squirm on the floor, growing more aroused with each moan and twitch. However, they still want more, even after the brothers have cum.\r\n\r\nOne of them unwraps the tape around their mouths, but any freedom is lost once another robber brings out a pair of ring gags. With help from his buddies, the gags are shoved into both boys' mouths, forcing them wide open.\r\n\r\nThe torture hasn't ended yet, evident by the blindfold that's tied around both their faces, pressing their heads closer together into a kiss. Then the vibrator is turned up by several notches, the robbers watching their captives eagerly."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50861022, "type": "ic", "edited": "2018-07-08T21:59:06.826213", "format": "raw", "posted": "2018-07-08T21:59:06.826213", "text": "The two brothers groan through their new gags, drooling into one another’s mouths as their torment continues. Neither Oso or Ichi truly want to take part in this but bound together they don’t have much of a choice as they cum again, beginning to coat one another in their own loads. \r\n\r\nWorse still is that they’re both blinded now and unable to see anything else coming their way."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887176, "type": "ic", "edited": "2018-07-10T04:17:58.288835", "format": "raw", "posted": "2018-07-10T04:17:58.288835", "text": "Several minutes pass, the robbers simply watching them as the Matsus are forced to cum again and again. It's easy for them to forget the time passing when they're so enamored with the squirming and drooling pair of brothers on the floor. But it's getting harder for them to ignore their erections as their arousal builds. One of the robbers even yanks down his pants and starts to stroke himself off, the others soon following suite.\r\n\r\nIt doesn't take long for them to cum, edged on by the brothers' pathetic noises. The three go out of their way to aim for the Matsus' faces, the cum joining the drool spilling down their forced-open mouths."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50887321, "type": "ic", "edited": "2018-07-10T04:24:31.640951", "format": "raw", "posted": "2018-07-10T04:24:31.640951", "text": "Ichi and Oso have lost track of themselves and how much time has passed at this point - exhausted by how much the vibrator is able to make them cum now that it’s on such a high setting. They’re sticky and becoming sticker still as the three men add to the mess, even if they’re mostly in a position to swallow down their come. The whines coming from the gag are downright pitiful, high and keening in their nature as they struggle to free themselves while their cocks are forced to cum over and over again."}]