[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55639673, "type": "ic", "edited": "2019-04-10T18:08:59.182011", "format": "raw", "posted": "2019-04-10T18:08:59.182011", "text": "The secretary hums, leaning forward to give Kara a deep kiss. Her hand grips onto the back of his head to push him deeper, tongue lightly pressing against his. When she pulls away, she's very pleased. Kara's willingness would make things a lot easier, at least until the real fun began.\r\n\r\n\"You know,\" she whispers in his ear. \"You're a lot more handsome than your brother... you're much more masculine, and filled with sexy confidence... can you be a good boy and strip down for me?\"\r\n\r\nAfter he got naked, she'd put him in the full-body latex suit and reveal her true colors. The anticipation for when he'd panic and plead already makes her wet."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 55639785, "type": "ic", "edited": "2019-04-10T18:18:44.335417", "format": "raw", "posted": "2019-04-10T18:18:44.335417", "text": "Once the kiss is broken, Kara is wearing a lopsided grin. It evens out as he gains confidence. None of his brothers could boast that they hit it off so well with such a beautiful woman. \r\n\r\n“I’d love to.” He practically trips over himself to undress, piling up his discarded clothes and grinning. “So...where’s this go next? I don’t see a bed around.”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55639966, "type": "ic", "edited": "2019-04-10T18:33:02.388149", "format": "raw", "posted": "2019-04-10T18:33:02.388149", "text": "The secretary smiles as Kara eagerly undresses, already imagining how he'd look in the skin-tight latex outfit. She walks towards the sex toys and tape on the dresser table, delicate fingers reaching for the latex uniform and lifting it in front of him.\r\n\r\n\"I want you to put this on for me,\" she says, approaching him. \"Well, actually, I'd prefer it if I could put it on you myself.\"\r\n\r\nThe latex was specially made to make it difficult for the wearer to move, fitting tightly to their frame and making them helpless. The secretary doesn't even wait for Kara to respond before she forces it on him, shoving his limbs inside the rubbery material. Only his cock, ass, and face are free, the rest of him sealed tight with no way out.\r\n\r\n\"I think it's clear by now that your brother isn't working here,\" she says with a smirk, hand gripping onto his chin. \"We sold him off three months ago to be someone's sex toy... and now we'll do the same to you.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 55640027, "type": "ic", "edited": "2019-04-10T18:38:59.029868", "format": "raw", "posted": "2019-04-10T18:38:59.029868", "text": "Kara is giddy with excitement. Things were starting to ramp up and quickly. He wasn’t particularly experienced when it came to sex so there was no way for him to realize what exactly was about to happen - and just how poorly it would turn out for him in the long run. \r\n\r\n“Go for it! You know this is pretty exciting, doing this while you’re at work,” he flirts.\r\n\r\nOnce inside the suit he stands a little awkwardly. The suit fits like a second skin, albeit one where his hands are balled into fists with no way to extend his fingers. \r\n\r\n“W-wait, what?” His eyes go wide at the realization."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55640166, "type": "ic", "edited": "2019-04-10T18:48:20.856864", "format": "raw", "posted": "2019-04-10T18:48:20.856864", "text": "The secretary laughs as Kara's eyes go wide, giving him another deep kiss. The kiss this time is hungrier and rougher, and when she pulls away her eyes are filled with lust and dominance.\r\n\r\n\"Mm, I'm sorry I had to lie to you, but that's our business. We tie up useless NEETs like you and your brother and turn them into furniture, selling them off to be permanent sex objects. Your brother was a chair, and I'm going to make you a lamp.\"\r\n\r\nShe takes the dildo from the table and shoves it in Kara's mouth, the tube connected to the base strapped to his cock. Next is the vibrator, which she lubricates before inching it inside Kara's ass.\r\n\r\n\"Hope you like the taste of your own cum, because that's the only thing you'll be eating for the rest of your life.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 55640376, "type": "ic", "edited": "2019-04-10T19:02:41.967671", "format": "raw", "posted": "2019-04-10T19:02:41.967671", "text": "Kara’s muffled protests go unanswered. And he can’t help the worry that rushes through him either. This is what had happened to Oso? He’d been missing for months! \r\n\r\nBut he can’t focus on his older brother for long, attention shifting to his own predicament quickly when he feels the vibrator slide into his ass. He’s confused as to how this is going to turn him into a lamp, but so far it doesn’t bode well for him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55651184, "type": "ic", "edited": "2019-04-11T05:31:18.276415", "format": "raw", "posted": "2019-04-11T05:31:18.276415", "text": "The secretary hums cheerfully as she gathers a chain with a clamp on the end, pinching Kara's nipple with her fingers before attaching the clamp to it. The chain is fairly heavy, pulling down his nipple a tad.\r\n\r\n\"Stay put, little doll. I'll be right back.\" She gives him a pat to the cheek before leaving the room, growing wet at the possibility of him panicking all alone.\r\n\r\nShe comes back around five minutes later with a nightstand, the top part of it missing. It was clear that it was waiting for a person to be trapped inside before the final segment would be added. The secretary eyes Kara, picking him up and shoving him inside on his knees.\r\n\r\n\"I'll go get someone to seal you away for good, but in the meantime...\" she giggles as she yanks on the chain, a motion sensor connected to the vibrator and tube as they start to vibrate and suck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 55651367, "type": "ic", "edited": "2019-04-11T05:45:04.741949", "format": "raw", "posted": "2019-04-11T05:45:04.741949", "text": "Kara jolts as much as he’s able when the chain is added, letting out a muffled yelp. It’s an uncomfortable sensation, made even more so by the fact that it’s only in one nipple.\r\n\r\nHe’s very much confused when she reappears with the nightstand - at least until he’s forced to kneel inside. Now his arms are stretched out flat along the top on either side while the chain on his nipple hangs down.\r\n\r\nThen the vibrations start in his ass and around his cock and Kara squeals as an orgasm is almost immediate, sending cum down the tube and straight into his mouth to swallow."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56003079, "type": "ic", "edited": "2019-05-01T03:51:51.126706", "format": "raw", "posted": "2019-05-01T03:51:51.126706", "text": "The secretary's eyes are filled with lust as she watches Kara swallow his own cum. He's completely helpless and unable to escape and this only serves to make her even wetter at his predicament.\r\n\r\n\"Mm, such a pretty little lamp...\" she coos as she strokes his hair. \"Those vibrations are merciless, aren't they? But we aren't quite done yet...\"\r\n\r\nShe takes out a leather blindfold from the drawer, fastening it tightly around Kara's eyes. The sadistic secretary gives his neck a few nibbles before leaning in his ear, blowing air inside it.\r\n\r\n\"That blindfold is never coming off, cutie,\" she says, fumbling in her pockets before pulling out two earplugs. \"Not only will you never see again, but your hearing will disappear too.\"\r\n\r\nWith only that as a warning, she shoves the earplugs inside, muffling any sounds from the outside world."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 56042380, "type": "ic", "edited": "2019-05-03T08:55:36.438753", "format": "raw", "posted": "2019-05-03T08:55:36.438753", "text": "Kara’s brows furrow incredulously as he looks at the woman in his extremely vulnerable state. How could he have done something so stupid? He hadn’t even told the other four where he’d found his lead when they’d decided to search for the eldest Matsu - so he can only pray that they don’t fall into the same trap. \r\n\r\nHe groans as he’s forced to swallow another load, eyes narrow with pleasure and only widening when she slips the leather strap around his eyes. Following it up with the earplugs, Kara is left to his own little world to suffer and swallow his own cum.\r\n\r\nHe could still hear a little bit and even those noises were drowned out by the buzzing of the vibrator in his ass."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56303281, "type": "ic", "edited": "2019-05-19T06:17:16.036233", "format": "raw", "posted": "2019-05-19T06:17:16.036233", "text": "The secretary hums as Kara is trapped in his new role, forced to endure it for as long as his new owner wanted. Snapping a few pictures with her phone, she sets up the page on the company's official website to inform buyers of a new piece of furniture for sale: a lamp, ready to serve it's new purpose as furniture.\r\n\r\nWith help from company employees, the secretary carries Kara to a display room, where he'll stay until he's purchased. He's left there for a few hours, forced to suck on the dildo shooting his own cum into his mouth. When he's bought, employees turn off the milker, the vibrator still buzzing in his ass as he's packed up for shipment.\r\n\r\nIt takes a few more hours, but his owner eventually comes home to find a package waiting for him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 56303345, "type": "ic", "edited": "2019-05-19T06:22:18.388150", "format": "raw", "posted": "2019-05-19T06:22:18.388150", "text": "Kara is oblivious to all of this. Without his sight and hearing, he’s basically reduced to what he can feel. And maybe he would have been able to notice the nightstand being moved if he weren’t so completely distracted by the vibrations in his ass and having to swallow his own cum for hours on end.\r\n\r\nSo he has no idea that he’s been bought and moved to an entirely different location, only that he’s no longer swallowing down cum like his life depends on it."}]