[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45795063, "type": "ic", "edited": "2017-10-15T16:30:34.713455", "format": null, "posted": "2017-10-15T16:30:34.713431", "text": "((18+ ONLY))\r\n \r\nHey, it's the person who's been posting all those ososan noncon prompts, and I'm back again with a masterpost of ideas that I've had! You will be playing the Matsu(s), while I'll be playing their captor(s).\r\n\r\n1. Osomatsu gets told by a stranger at a horse race that he lost a bet to that there's a secret to always winning at the horse races, but he has to sign a contract to learn in. Oso accepts without reading it, but soon finds out that may have not been the best choice. The secret to always winning at horse races? Become the horse! Oso becomes a slave to a group of strangers and is forced to race against other slaves, all while in pony bondage gear. Lots of \"training\" would be very fun!\r\n \r\n2. One or more of the brothers gets kidnapped by a group of men and is forced to be publically used and humiliated.\r\n \r\n3. One or more of the brothers gets kidnapped and kept as a group of men (or women's) personal sex slave(s).\r\n \r\n4. Choromatsu goes to a Nyaa-chan concert and gets jumped in the bathroom, forced to be used publically by a bunch of horny fanboys who want to humiliate other fans to prove they love Nyaa-chan more.\r\n\r\n5. A monster girl kidnaps one or more of the Matsus and keeps them as her pet(s). Would /love/ tentacle or slime stuff.\r\n\r\nMore ideas will likely be added! My kinks include heavy bondage, shibari, struggling/thrashing, gags (!!!), bitchsuits (!!), suspension bondage, nipple clamps, begging, toys, double/triple penetration, humiliation, degradation, crying, recording, blindfolds, latex, public use, spanking, mummification bondage, orgasm denial, fucking machines, overstimulation, drool/saliva, forced exercise (like being forced to walk on a treadmill), and maybe more! Hard no's are anything unsanitary, gore, vore, pregnancy, bestiality, or death. If you would rather not include a specific kink or have other ideas, let me know!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45795069, "type": "ooc", "edited": "2017-10-15T16:31:08.773581", "format": null, "posted": "2017-10-15T16:31:08.773581", "text": "I absolutely love the first idea"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45795269, "type": "ooc", "edited": "2017-10-15T16:42:18.804513", "format": null, "posted": "2017-10-15T16:42:18.804513", "text": "(( thanks! would you like to discuss any kinks?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45795350, "type": "ooc", "edited": "2017-10-15T16:46:26.672516", "format": null, "posted": "2017-10-15T16:46:26.672516", "text": "Well I think gags and bitchsuits should be a given in the nature of becoming a horse and I'm honestly open to everything you have listed and you've covered quite a bit of ground. The idea of him being a mummified horse is rather appealing and it being a permanent change."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45795507, "type": "ooc", "edited": "2017-10-15T16:54:36.231672", "format": null, "posted": "2017-10-15T16:54:36.231672", "text": "(( I like the way you think! I'm excited to start this!\r\n\r\nA mummified Oso horse would be very cute after some bitchsuit training... I love that idea.\r\n\r\nI could write the starter if you would like."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45795531, "type": "ooc", "edited": "2017-10-15T16:55:45.977851", "format": null, "posted": "2017-10-15T16:55:45.977851", "text": "Thanks.\r\n\r\nAnd go for it! I'm really looking forward to this"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 45795843, "type": "ic", "edited": "2017-10-15T17:30:33.393674", "format": null, "posted": "2017-10-15T17:10:03.236291", "text": "Watching men go nuts over their bets at the horse races was always a fun way to pass the time, but Shin hadn't come here for that reason. Boss had a special mission for him and his partner Daichi, to scope out a man that he'd been stalking for some time.\r\n\r\nOsomatsu Matsuno was their target. A man in his twenties, he had no job, no girlfriend, and no real future. He was also a frequent visitor at the horse races, so scoping him out would be easy.\r\n\r\nThe races themselves were coming to a close, shouts of both excitement and disappointment filling the vicinity. And with the end of the races arriving, both Daichi and Shin found Osomatsu, alone and away from any large crowd.\r\n\r\nDaichi had carefully practiced lines to use on Osomatsu, certain that he would fall for the offer. They approached him quietly, Daichi giving the NEET a soft tap on the shoulder."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45796202, "type": "ooc", "edited": "2017-10-15T17:32:03.368853", "format": null, "posted": "2017-10-15T17:32:03.368853", "text": "(( hope that's alright!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45796213, "type": "ooc", "edited": "2017-10-15T17:32:41.328219", "format": null, "posted": "2017-10-15T17:32:41.328219", "text": "It's great!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45796224, "type": "ooc", "edited": "2017-10-15T17:33:11.757276", "format": null, "posted": "2017-10-15T17:33:11.757276", "text": "(( glad to hear it!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45796532, "type": "ic", "edited": "2017-10-15T17:52:59.054803", "format": null, "posted": "2017-10-15T17:52:59.054803", "text": "There was always some form of luck involved in gambling no matter how much logic you applied to the situation. Though there was something to be said about spending all day at the track and not even winning a few dollars to take back home. Oso had come to lighten his spirits, but it was becoming rather apparent that he was going to be leaving with lighter pockets. Again.\r\n\r\nWith a sigh, the NEET leans over the railing and laments the results of the race. He'd had such high hopes for this one, but even when he picked the winner of past races he couldn't catch a break. \r\n\r\nThe tap on his shoulder interrupts his brief mourning period and Oso straightens himself back out. \"Sorry. Can I help you with something?\"\r\n\r\nIt's no one that he knows, at least not personally. But they don't look particularly threatening either so Oso is going to guess that the man isn't with security."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45797196, "type": "ic", "edited": "2017-10-15T18:28:29.827628", "format": null, "posted": "2017-10-15T18:28:29.827628", "text": "Straightening his tie to look more \"official\", Daichi offers a look of pity to Osomatsu, as if he understands his plight.\r\n\r\n\"You alright?\" He asks casually. He had good practice when it came to appearing friendly, thanks to his early days with his partners. \"You seem a little down, y'know? Lost at the races, I'm guessing?\"\r\n\r\nHe sighs in sympathy, not waiting for an answer. \"Such a shame... you looked like you were having the time of your life earlier.\r\n\r\n\"Speaking of which... I swear I've seen your face around here before. You must really love the thrill of horse racing, huh?\"\r\n\r\nGlancing around him to make sure no one was around, Daichi leans in closer, mumbling the line he'd been practicing all week.\r\n\r\n\"Losing really sucks... but I happen to know a way to always win.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45805210, "type": "ic", "edited": "2017-10-16T00:28:19.571789", "format": null, "posted": "2017-10-16T00:28:19.571789", "text": "Oso nods in agreement, drawing himself up and giving the other man a 'what can you do about it' look. It wasn't as if he could change his luck around, and that's really all gambling was when it got right down to it.\r\n\r\n\"If that was true, I'd have to ask why you were offering to share but...I'd rather not look a gift horse in the mouth. But yeah, I spend more than my fair share of time here at the track.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45805520, "type": "ic", "edited": "2017-10-16T00:40:52.871961", "format": null, "posted": "2017-10-16T00:40:52.871961", "text": "Daichi smiles, hoping he's caught his interest.\r\n\r\n\"Well, since I've seen you around a lot, I thought I'd share my secret. I know a trustworthy guy when I see one, and you seem to fit the bill.\"\r\n\r\nHe places a hand on Osomatsu's shoulder, a serious expression crossing his face.\r\n\r\n\"Tell you what... I don't offer this to a lot of people for free, but since you've lost today's races, I thought I'd help you out. All you gotta do is sign a contract, and we'll be good to go. What do you say?\"\r\n\r\nDaichi was hoping that Osomatsu would be so swept away by his offer and formality that he wouldn't question it too much."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45812634, "type": "ic", "edited": "2017-10-16T05:05:43.578202", "format": null, "posted": "2017-10-16T05:05:43.578202", "text": "If Osomatsu were anyone else, he might very well be skeptical of such an offer. But...he's himself and the prospect of being able to win all of the races is one that he can hardly pass up. Especially when it was being offered so freely.\r\n\r\n\"I think you have yourself a new friend,\" he grins cheerfully, turning to give the man a firm handshake to seal the deal.\r\n\r\nAll the horse races he could win and all he had to do was give his signature? Oso would've laughed if someone had told him he would be ending his day at the tracks by getting the best deal of all. \r\n\r\n\"Osumatsu by the way, but you're more than welcome to call me Oso.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45821208, "type": "ic", "edited": "2017-10-16T19:25:16.840283", "format": null, "posted": "2017-10-16T19:24:45.825417", "text": "\"Right, Oso-kun...\" Daichi lets the nickname roll off his tongue, liking the sound of it. \"If you'll follow me, I'll lead you over to an area where we can sign it in peace. We wouldn't want anyone else getting in on this once in a lifetime opportunity, would we?\"\r\n\r\nIn just under an hour, Osomatsu would be his unwilling pet, stripped of all clothes and dignity and forced on all fours. Daichi's doing a good job of not showing his excitement, even as perverted thoughts fill his mind.\r\n\r\n\"Come on, I'll show you the way,\" he says, motioning him over to a secluded area."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45822576, "type": "ic", "edited": "2017-10-16T20:55:58.404626", "format": null, "posted": "2017-10-16T20:55:58.404626", "text": "None the wiser, Oso grins and begins to trail alongside Daichi. It wasn't very often that he met such a friendly guy willing to help out.\r\n\r\nIf his brothers were witnesses they'd no doubt be impressed with his rising to the occasion.\r\n\r\n\"Not at all,\" he agrees, glancing around and making sure that no one else was being offered the very same deal. \"Now where do I sign? I'd like to get started as soon as possible.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45822778, "type": "ic", "edited": "2017-10-16T21:08:53.353618", "format": null, "posted": "2017-10-16T21:05:38.940320", "text": "Daichi fishes around his pockets, pulling out a miniature contract and presenting it to Osomatsu. Presented is an official-looking document, along with a line for him to sign his name.\r\n\r\n\"Right here,\" Daichi points, \"is where you sign your name. After that, I'll tell you the way to always win.\"\r\n\r\nIf one were to read the document, they would find a lot of... worrying promises. One paragraph vaguely states something about \"rigorous training\", while another paragraph talks about \"the contractor's rights as property\". But it's well-hidden among words of useless, official-sounding information, so Daichi doesn't think Oso will read any of it."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45823629, "type": "ic", "edited": "2017-10-16T21:49:07.790526", "format": null, "posted": "2017-10-16T21:49:07.790526", "text": "The NEET skims the first few lines of the contract - giving the impression that he's not a complete idiot. If only because he doesn't want his new companion to think him a fool. As it is, the wording is about what he'd expect of a contract. Legal jargon that he doesn't quite understand.\r\n\r\nA few more seconds dedicated to pretending to read before Oso officially gives up and produces a pen from his own pockets. Scrawling out his name, he hands the contract back over and crosses his arms over his chest.\r\n\r\n\"So,\" he begins, head cocking to the side and observing Daichi curiously. \"How do I always win the races?\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45824230, "type": "ic", "edited": "2017-10-16T22:23:54.802671", "format": null, "posted": "2017-10-16T22:23:54.802671", "text": "Daichi takes the contract, putting it back in his pocket before turning back to Osomatsu. He places two firm hands on the other man's shoulders, his friendly persona dissipating.\r\n\r\n\"Well, Oso-kun,\" he chuckles darkly, Shin tip-toeing behind Osomatsu with a roll of tape, a cloth, and a large sack slung over his shoulder. \"The first step to winning at the horse races... is to become the horse.\"\r\n\r\nShin goes to work as if on cue, immediately stuffing the cloth into Oso's mouth. He throws the smaller man to Daichi, who grips tightly onto his arms as Shin prepares the tape. He quickly slaps the tape across his mouth, keeping the cloth trapped inside.\r\n\r\n\"Did you really think that there would be a surefire way to always win?\" Daichi snarls, shoving Osomatsu's arms behind his back as Shin tapes them together. \"You really are a dumbass, aren't you?\"\r\n\r\nDaichi's rough hands force Osomatsu's legs together, which are also given the same tape treatment.\r\n\r\n\"We'll tell you more once we get back to the base,\" Daichi says before Shin throws the sack over Osomatsu's body and slings it over his shoulder.\r\n\r\nWith that, the two depart to their car, locking Osomatsu in the trunk before driving away."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45824823, "type": "ic", "edited": "2017-10-16T22:53:53.906696", "format": null, "posted": "2017-10-16T22:53:53.906696", "text": "The confusion on Oso's face is evident. Become the horse? That was absolutely absurd. The grip on his shoulders is uncomfortably tight and the young man opens his mouth to question the man when the cloth is forced inside his mouth and taped shut. Arms forced behind his back before he can even attempt to ungag himself. His kicks are even weaker before they're also taped together and he's left a writhing mass over the second man's shoulder. \r\n\r\nThe inside of the bag is unbearably hot and it only gets worse as he hears the rumble of a car engine. Without the sound of anyone else, Oso can only assume that he's been put in the trunk. Something made even more abundantly clear once he starts rolling every which way.\r\n\r\nHis muffled protests are silenced by the cloth filling his mouth, but that doesn't stop Oso from trying to call out for help. He has no idea where he's being taken, and that can't mean anything good."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45825060, "type": "ic", "edited": "2017-10-16T23:04:05.975505", "format": null, "posted": "2017-10-16T23:04:05.975505", "text": "The two eventually reach their base, Daichi turning off the ignition and both exiting the vehicle. Opening the trunk, both grin at the writhing form of Oso trapped in the bag, pleased to see him so helpless before the real fun begins.\r\n\r\nDaichi lifts the bag over his shoulder, he and Shin walking up to the door. The latter unlocks it, kicking it open with a loud thud.\r\n\r\nIn the middle of the room is a chair and a big table filled with all sorts of toys: vibrators, dildos, nipple clamps, gags, whips, and two huge rolls of tape.\r\n\r\nDaichi dumps Osomatsu out of the bag and onto the floor before lifting him back up onto the chair, tearing off his tape gag and removing the cloth from his mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45825627, "type": "ic", "edited": "2017-10-16T23:24:34.243077", "format": null, "posted": "2017-10-16T23:24:34.243077", "text": "The click of the trunk opening sets Oso to struggling again, though it doesn't do much good at all when he can't even move his arms and legs properly.\r\n\r\nSpilling out onto the floor elicits a muffled cry as his eyes squeeze shut before he's placed into the chair. Catching sight of the various toys, Oso's eyes widen.\r\n\r\n\"What d-do you think you're doing?\" He stammers once the makeshift gag has been removed. \"You can't do this!\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45825857, "type": "ic", "edited": "2017-10-16T23:33:42.771163", "format": null, "posted": "2017-10-16T23:33:42.771163", "text": "\"Can't do this?\" Daichi chuckles. \"What do you mean? You signed that contract selling your body to us, so we own you now.\"\r\n\r\n\"We can do anything we want to you,\" Shin chimes in, walking over to the table of toys. \"You're our little pet... Oso-kun is such a cute name for a horse, don't you think?\"\r\n\r\nShin picks up a sharp pair of scissors from the table, approaching Osomatsu's shirt.\r\n\r\n\"Hold still, slut. We gotta tear off those clothes in the way, then our training can begin.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45826156, "type": "ic", "edited": "2017-10-16T23:45:49.971724", "format": null, "posted": "2017-10-16T23:45:49.971724", "text": "\"I'm not a pet!\" Oso protests readily. \"I didn't sign a contract that said that! It was about...about the races.\"\r\n\r\nBut he hadn't read that carefully. He very well could have signed over his body - not that he was in any position to contest the statement even if he hadn't \r\n\r\nHe's too overwhelmed with panic to do much of anything except cry, tears streaming down his face as the man approaches him with scissors. \"Please, please, don't do this.\""}]