[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45832841, "type": "ic", "edited": "2017-10-17T04:02:10.099400", "format": null, "posted": "2017-10-17T04:02:10.099400", "text": "Shin only laughs cruelly as tears stream down Oso's face, arousal growing from watching him suffer.\r\n\r\n\"You don't really have much of a choice, you know,\" he sneers, snipping away at his shirt. \"You're our little slave now, and you're gonna be for as long as we want you to.\"\r\n\r\nAs Shin snips away at both his shirt and pants, Daichi kisses the tears off of Osomatsu's face, sighing as his lips trail down to his neck. He leaves wet, open-mouthed kisses all over, hands reaching to pinch and twist his nipples.\r\n\r\nEventually, the shirt and pants are completely cut away, leaving him in his underwear. Shin cuts those off as well, revealing his cock to the two kidnappers.\r\n\r\n\"So cute...\" Daichi chuckles, pulling away from his kisses briefly. \"We're gonna cut the tape away to try a different position. If you try to escape, you're not gonna like what Shin's gonna do to you.\"\r\n\r\nShin cuts the tape off and yanks Osomatsu onto his back, holding the scissors to his neck to keep him still while Daichi reaches for a big roll of tape and a bit gag."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45833947, "type": "ooc", "edited": "2017-10-17T04:49:02.861525", "format": null, "posted": "2017-10-17T04:49:02.861525", "text": "(( quick question for kinks: what do you feel about cock milking by machine?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45834703, "type": "ooc", "edited": "2017-10-17T05:14:08.004533", "format": null, "posted": "2017-10-17T05:14:08.004533", "text": "I'm comepletly fine with it no worries!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45834737, "type": "ooc", "edited": "2017-10-17T05:15:39.923435", "format": null, "posted": "2017-10-17T05:15:39.923435", "text": "(( nice!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45834770, "type": "ooc", "edited": "2017-10-17T05:17:34.089786", "format": null, "posted": "2017-10-17T05:17:34.089786", "text": "(( I can't wait to see him as a mummified horse~"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45834795, "type": "ooc", "edited": "2017-10-17T05:19:01.023411", "format": null, "posted": "2017-10-17T05:19:01.023411", "text": "Same here! Sorry for the clipped replies but there are occasionally times when I don't really know what to do or say."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45834813, "type": "ooc", "edited": "2017-10-17T05:19:44.091502", "format": null, "posted": "2017-10-17T05:19:44.091502", "text": "(( nah it's cool!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45834863, "type": "ooc", "edited": "2017-10-17T05:23:26.658444", "format": null, "posted": "2017-10-17T05:23:02.220156", "text": "(( just his thoughts and feelings on being treated so roughly and maybe some dialogue would work? no rush, just throwing out some ideas. I love where this is headed!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45835189, "type": "ic", "edited": "2017-10-17T05:43:04.627409", "format": null, "posted": "2017-10-17T05:43:04.627409", "text": "The smaller man's eyes widen in panic. This...this couldn't possibly be happening. Stuff like this didn't happen in real life. Especially to nobodies like himself. His worst vice had been used against him and without the use of his arms or legs, he really didn't have much choice in the matter.\r\n\r\nWet lips pressing against his face, Oso tries to shrink away from the contact as the rest of his body is bared to the two men. A continuous expanse of smooth skin left completely unmarred. Describing him in one word...soft. And his nipples perk right up at the attention, leaving Oso a whimpering mess at the two pinpricks of pain.\r\n\r\n\"N-no, stop! You don't...don't do this!\" He pleads, cock hanging limply between his legs once his underwear is cut away. There's another bout of thrashing cut short by the sharp object pressed against his neck.\r\n\r\nBeing dead might be better than whatever it was that was going to be done to him, but that didn't mean that Oso wanted to test that theory out anytime soon. Swallowing thickly, the NEET stills himself completely despite being freed - tears freely falling down his cheeks."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45835398, "type": "ic", "edited": "2017-10-17T05:55:03.054553", "format": null, "posted": "2017-10-17T05:55:03.054553", "text": "Shin gives the NEET an evil smirk. \"That's a good little slut.\"\r\n\r\nHe gives him a few rough pats to the cheek, running his thumb over his bottom lip in mock comfort. The scissors are still pressed close to his soft neck as Daichi approaches him, rolling out the tape as Shin forcibly folds one of his arms.\r\n\r\nDaichi wraps up the folded arm in an overwhelming amount of tape, elbow jutting out through the silver cocoon. He works quickly to wrap the next one, followed by his folded legs.\r\n\r\nOsomatsu is lifted upwards, placed onto his knees and elbows as Daichi continues to wrap his whole body in tape, excluding his ass, nipples, cock, and face.\r\n\r\nSatisfied with his work, he finishes by grabbing onto the bit gag, jamming it into his new pet's mouth before tightening it.\r\n\r\n\"You look like a proper horse,\" he chuckles. \"Let's see if you can crawl for us. You're gonna be stuck like that for a very long time, so get used to it.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45835569, "type": "ic", "edited": "2017-10-17T06:04:18.543935", "format": null, "posted": "2017-10-17T06:04:18.543935", "text": "Oso's whimpering picks up in volume as he's wrapped up like a particularly interesting Christmas present. Though by the sound of things he isn't going to be unwrapped any time soon.\r\n\r\nThe tape is an uncomfortable addition, keeping him in place and making it hard for him to move as it constricts his frame. Though it isn't the worst that could be done to him by any means. He almost feels as though he's gotten off easy.\r\n\r\nHe whines around the gag, familiar with the piece as the bit used on the horses at the track. Already a thin stream of drool is pooling down his chin as he tries to protest, wiggling on the ground at the two men's feet and managing to scoot himself forward a couple of inches."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45838397, "type": "ic", "edited": "2017-10-17T13:18:08.197252", "format": null, "posted": "2017-10-17T13:18:08.197252", "text": "The sadistic men watch on as Oso wiggles forward, a twisted sense of accomplishment washing over them at how utterly helpless they've made him.\r\n\r\n\"Good boy, Oso-kun,\" Daichi praises, Shin giving him a smack on the ass. \"Now hold still... Shin wants to have a little fun with you.\"\r\n\r\nDaichi throws his partner a bottle of lube before grabbing the pair of weighted nipple clamps on the table, crouching down to meet Osomatsu's face. With a kiss to his drool-wet bottom lip, Daichi attaches both clamps to him, the cold metal looking like hell on his soft buds.\r\n\r\nWhile Shin lubes up behind Osomatsu, Daichi leans into the slave's ear, whispering.\r\n\r\n\"In a few days, you'll be a part of a little race of your own... we'll need to train you properly until then, because the penalties for losing aren't very fun on your part.\"\r\n\r\nAs Daichi ends his cryptic explanation, Shin finishes lubing up, placing two firm hands on Osomatsu's ass before inching his way inside."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45838667, "type": "ic", "edited": "2017-10-17T13:49:11.486845", "format": null, "posted": "2017-10-17T13:49:11.486845", "text": "Oso startles at the brief jolt of pain in his ass. Like the rest of his brothers, his tolerance for pain was extremely low given the fact that they'd spent the last few years not doing very much of anything. This was going to be Hell.\r\n\r\nThe idea of the men having a little fun with him sets the young man right back to squirming around on the floor like a worm. At least until the clamps bite into his nipples, eyes widening with pain and fear as the weights begin to stretch them towards the floor. \r\n\r\nOnce again the tears are back, joining the saliva running down his chin. He wants nothing more than for this to just be a dream...a nightmare - one that would end soon if he were lucky. \r\n\r\nBut not before Shin's cock works it's way inside of him and elicits a sharp cry as his ass squeezes around the unwelcome intruder in an attempt to force him out. Wiggling only succeeds in impaling himself further on the cock as well as setting the clamps to swinging about and tugging on his burning nipples. And his cock still hangs between his legs, a clear testament to the fact that Oso isn't having a good time."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45839062, "type": "ic", "edited": "2017-10-17T14:33:50.933600", "format": null, "posted": "2017-10-17T14:33:50.933600", "text": "Shin groans as he fully pushes himself inside Osomatsu, one hand wrapping around his limp cock and pumping it to a quick rhythm.\r\n\r\n\"So tight...\" he moans as he jacks him off, other hand digging into his ass's flesh. \"Oso-kun's ass feels so nice... you've never done anything like this before, have you?\"\r\n\r\nDaichi gives him a few kisses and nibbles to his drooling lip, fingers playing with his nipple clamps and letting them swing about.\r\n\r\n\"You're making such a mess, Oso-kun,\" he taunts, thumb lightly stroking his cheek. \"We'll have to punish you further for that.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45839720, "type": "ic", "edited": "2017-10-17T15:34:41.587602", "format": null, "posted": "2017-10-17T15:34:41.587602", "text": "Punished!? He hadn't done anything wrong! He tries to tell them as such but he only manages to add more drool to the slick patch already forming below him. The bit is slowly becoming the worst part of his restraints. Anyone could buy a roll of tape, but this was a tool meant to used on an animal.\r\n\r\nAnd instead it was forced into his own mouth, digging into the corners and forcing his tongue to lie flat. Not to mention the metallic taste it left behind. \r\n\r\nWith the attention being paid to it, it isn't long before Oso's dick is betraying him. No longer limp, it would be flush against his taped abdomen if not for the firm hand stroking it."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45840120, "type": "ic", "edited": "2017-10-17T16:16:53.975525", "format": null, "posted": "2017-10-17T16:16:53.975525", "text": "\"What's that? Sorry, Oso-kun. I can't hear you over that bit in your mouth. Feel free to keep embarrassing yourself though, it's fun to watch.\" Daichi snickers as Oso drools all over the floor, enjoying his humiliation to a sickening degree.\r\n\r\nShin continues stroking, pounding inside Osomatsu's ass with a furious desire to see his cum leaking out of his ass.\r\n\r\n\"We've got some more plans today after Shin's done with you, so try to stay strong.\"\r\n\r\nA few more minutes is all it takes for Shin to finish, cumming deep inside Osomatsu before pulling out. He follows up the assault with a swift smack on the ass, pulling his hand away from the slave's cock.\r\n\r\n\"Do you think we should put him on the milker, Daichi?\" Shin asks, hands groping at the nipple clamps. \"He hasn't cum yet, it's only fair...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45840536, "type": "ic", "edited": "2017-10-17T16:51:58.838066", "format": null, "posted": "2017-10-17T16:51:58.838066", "text": "Oso whines brokenly around the bit, squirming uselessly on the floor and going into a full panic when he feels cum flood his ass seconds before Shin leaves his hole empty. With the tape locking him in place, it's difficult to even move his head from side to side. And his taped hands are slowly becoming numb in their position so close to touching his shoulders.\r\n\r\nPre-cum leaks from his cock as the clamps are toyed with, and he can't deny that he wants to cum. Not when he jerks his hips in a vain attempt to get some kind of traction."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45843319, "type": "ic", "edited": "2017-10-17T20:21:00.961206", "format": null, "posted": "2017-10-17T20:21:00.961206", "text": "The two men laugh as Osomatsu jerks his hips, taking the opportunity to taunt him further.\r\n\r\n\"I think he wants to cum, Daichi.\" Shin pokes the head of his cock as it leaks precum. \"We should put him on the milker so he can cum as many times as he wants.\"\r\n\r\n\"Of course,\" Daichi says, gripping onto Osomatsu's chin and forcing it up towards him. \"It would be a nice punishment... and after that we can begin training for the races.\"\r\n\r\nDaichi removes the clamps from Osomatsu's nipples, ducking down to meet him face-to-face.\r\n\r\n\"You're gonna be taped up in that position for a long time, so you'll have to get used to moving on all fours.\" He reaches for a collar and leash on the table, showing the collar marked with \"cock slut\" to Osomatsu before strapping it around his neck and attaching the leash.\r\n\r\n\"Come on, Oso-kun. The machine is this way.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45851244, "type": "ooc", "edited": "2017-10-18T02:27:06.331594", "format": null, "posted": "2017-10-18T02:27:06.331594", "text": "(( holy moly I love this rp so far! I don't get to rp bitchsuits and other rarer kinks of mine very often so this is a dream come true for me"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45854846, "type": "ooc", "edited": "2017-10-18T04:57:54.769938", "format": null, "posted": "2017-10-18T04:57:54.769938", "text": "Thanks! Sorry that I haven't replied yet but I had to go to the ER"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45856406, "type": "ooc", "edited": "2017-10-18T06:50:15.666307", "format": null, "posted": "2017-10-18T06:50:15.666307", "text": "Also before I respond, how do you feel about adding a couple more layers to the whole ensemble?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45857966, "type": "ooc", "edited": "2017-10-18T12:32:09.222201", "format": null, "posted": "2017-10-18T12:29:41.968896", "text": "(( oh no! I hope you're alright!\r\n\r\nby more layers, do you mean more tape? or did you have other fun ideas? I'm good with that!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45858894, "type": "ooc", "edited": "2017-10-18T14:12:13.992563", "format": null, "posted": "2017-10-18T14:12:13.992563", "text": "I could work with more tape no problem, though I was thinking that over that we could put Oso in rubber suit that keeps him in the same position."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45859014, "type": "ooc", "edited": "2017-10-18T14:25:19.064961", "format": null, "posted": "2017-10-18T14:25:19.064961", "text": "(( oh! like a classic bitchsuit? that definitely works for me!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45862920, "type": "ooc", "edited": "2017-10-18T19:38:56.070119", "format": null, "posted": "2017-10-18T19:38:56.070119", "text": "I'm always a sucker for the classics"}]