[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45862948, "type": "ooc", "edited": "2017-10-18T19:43:09.967975", "format": null, "posted": "2017-10-18T19:41:34.516233", "text": "(( heck yeah! I love rubber/latex bitchsuits. With the tape underneath it'll be even tighter for Oso~"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45864790, "type": "ooc", "edited": "2017-10-18T21:39:29.977261", "format": null, "posted": "2017-10-18T21:39:29.977261", "text": "They can also leave the suit on and not have to worry about replacing the tape"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45864904, "type": "ic", "edited": "2017-10-18T21:45:36.211277", "format": null, "posted": "2017-10-18T21:45:36.211277", "text": "More pain as the blood rushes back into his poor nipples. Oso whines as he looks up to the men before the collar is strapped around his neck. Just another tool being used to humiliate him. \r\n\r\nHis protests are little more than garbled pleading as he's dragged along the floor, making an attempt to scoot along so he doesn't end up getting choked by the leash.\r\n\r\nWhatever this milking machine is, he wants nothing to do with it nor does he want to be known as a cock slut."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 45865141, "type": "ic", "edited": "2017-10-18T22:04:54.094443", "format": null, "posted": "2017-10-18T21:58:24.617869", "text": "The three eventually arrive to the room with the milking machine, which sits in the corner along with a latex bitchsuit. Daichi makes note of it; using it over the tape restraints would be very effective in humiliating Oso, not to mention the fact that they wouldn't have to replace the tape every week or so.\r\n\r\nThe machine in question is somewhat small and cylindrical, in the middle of it lying a transparent container. Connected to it is a small tube which could fit an average-sized cock. Eyeing Oso's dick, Daichi figures it should fit.\r\n\r\nHe continues to pull the slave along the floor, despite him clearly struggling to crawl in the vast amounts of tape. When they reach the machine, Shin lifts up the rubber suit and places it on the floor, while Daichi picks up the bound NEET and forces his legs and arms inside the suit.\r\n\r\nThe two fasten him in, his body covered in yet another layer of restraints. Of course, holes in the suit still expose his dick, along with his chest and most of his ass.\r\n\r\n\"How does that feel, Oso-kun?\" Shin mocks, lying his heavily constricted body on its back. \"You look even sluttier now.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45867520, "type": "ic", "edited": "2017-10-19T00:06:33.011941", "format": null, "posted": "2017-10-19T00:06:33.011941", "text": "Vulnerable. This is the most vulnerable that Oso has been in his entire life. The suit keeps his already confined arms and legs pressed tightly together. Any hopes of waiting for the tape to lose its stickiness and trying to escape are quickly fading from the young man's mind. \r\n\r\nThe only cool air he's able to receive is on his cock, chest, and ass, but it doesn't make Oso feel any better now that the latex has taken away his ability to see and muffled the outside world. If not for the two holes on the face allowing him to breath, he'd be in even more of a panic. \r\n\r\nHe jerks his head, shortened limbs wiggling in the air - a dog practically begging for a tummy rub. He's unable to get any traction to flip himself over and his folded limbs are able to provide no cover for his cock or nipples."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45867935, "type": "ic", "edited": "2017-10-19T00:27:29.625431", "format": null, "posted": "2017-10-19T00:27:12.998565", "text": "Both men chuckle as they watch Osomatsu flail around, body completely covered except for the parts the two deemed the most important. He's nothing but a faceless body to be used now, reduced to a rubber sex toy who can only jerk and squirm.\r\n\r\n\"How cute... look at those cute little twitches, Shin,\" Daichi teases, grabbing the machine's tube and attaching it to Osomatsu's cock. \"I wonder how long he can last like this?\"\r\n\r\n\"Is that suit tight enough for you, Oso-kun?\" Shin laughs, giving both of his nipples a quick pinch. \"Fuck, I'm getting hard just looking at him...\"\r\n\r\nFor a quick moment, he uses his fingers to plug up the nose holes, just to scare him for a second before pulling away.\r\n\r\n\"We'll leave him like this for about an hour. What do you think, Oso-kun?\" Daichi doesn't expect any sort of compliance from his toy, already adjusting the settings on the machine and turning it on.\r\n\r\nThe tube begins to squeeze and suck at Oso's dick, whirring and buzzing as it starts up. The tube isn't even at the highest setting yet, but it's automatically set to gradually increase speed every ten minutes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45868206, "type": "ooc", "edited": "2017-10-19T00:39:27.220250", "format": null, "posted": "2017-10-19T00:39:27.220250", "text": "(( if you ever get a craving to do some more kinky matsu RPs, hit me up! I love this!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45869013, "type": "ooc", "edited": "2017-10-19T01:09:36.472720", "format": null, "posted": "2017-10-19T01:09:36.472720", "text": "You know what, I might just take you up on that offer. It's not often that I find someone whose kinks line up"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45869025, "type": "ooc", "edited": "2017-10-19T01:10:12.777739", "format": null, "posted": "2017-10-19T01:10:12.777739", "text": "(( Awesome! I have a few ideas for potential RPs"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45869037, "type": "ooc", "edited": "2017-10-19T01:10:33.062811", "format": null, "posted": "2017-10-19T01:10:33.062811", "text": "Go ahead and shoot them my way!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45869270, "type": "ooc", "edited": "2017-10-19T01:22:10.396171", "format": null, "posted": "2017-10-19T01:19:52.669268", "text": "(( ok! I have a few ideas, all involving matsus:\r\n\r\n1. one of the matsus gets caught cheating at a casino, and is made into the casino's property as punishment for his misdeeds. One of the casino's favorite things to do to him is sell him off for men to rent him for the night...\r\n\r\n2. A prompt based on the Hesokuri Wars \"That's Gakuen Musical\" AU. One or more of the brothers gets kidnapped by a group of bullies over summer vacation before college and pretty much get humiliated/fucked on a daily basis\r\n\r\n3. Based on the Hesokuri Wars Superhero AU, a villain overpowers and captures at least one Matsu. He has a lot of toys and pet monsters he'd like to use on them..."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45869373, "type": "ooc", "edited": "2017-10-19T01:23:28.099145", "format": null, "posted": "2017-10-19T01:23:28.099145", "text": "Ooohh I do think that the third idea offers a lot of possibilities."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45869432, "type": "ooc", "edited": "2017-10-19T01:26:08.120373", "format": null, "posted": "2017-10-19T01:25:41.008608", "text": "(( yes! If you would like, you or I could put a prompt in the directory for the other to answer. we could have as many RPs going on at the same time as you would like"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45872267, "type": "ooc", "edited": "2017-10-19T03:17:33.201162", "format": null, "posted": "2017-10-19T03:17:33.201162", "text": "Would you mind posting in the directory?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45872275, "type": "ooc", "edited": "2017-10-19T03:17:53.422898", "format": null, "posted": "2017-10-19T03:17:53.422898", "text": "((Sure!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45872291, "type": "ooc", "edited": "2017-10-19T03:18:59.905903", "format": null, "posted": "2017-10-19T03:18:59.905903", "text": "(( just posted it. Says, \"for my kinky rp partner!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": true, "id": 45873277, "type": "ic", "edited": "2017-10-19T04:19:10.691004", "format": null, "posted": "2017-10-19T04:01:00.805719", "text": "Oso's arms flap uselessly in an effort to push the two men away. His panic mounts the moment his only airway is blocked, eyes wide beneath the thick rubber as he begins to thrash wildly until he's able to breath again. \r\n\r\nCock already hard, Oso cums before the ten minute mark is even up - going completely still as his back arches as he releases his load. It's a relief that only lasts for a few seconds before the machine continues to work at his dick.\r\n\r\nTwenty minutes and the NEET has cum two more times. The faster the machine works at his cock, the more he starts to writhe on the floor - until eventually there's no more cum capable of coming out. His breath comes in shallow bursts through his nose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45876923, "type": "ic", "edited": "2017-10-19T11:14:33.565727", "format": null, "posted": "2017-10-19T11:14:33.565727", "text": "As Oso writhes and squirms around on the floor, Shin takes the opportunity to pull out his phone and record him. Every once in a while, he'll go back to pinching the holes on his face for brief moments to see him panic.\r\n\r\n\"Hmm... even though you're just a toy, you still feel pain?\" Daichi muses, eyeing the container filled with Oso's cum. \"We'll have to see what else you can handle these next few days.\"\r\n\r\n\"I wonder what his face looks like underneath that mask?\" Shin asks. \"I don't want to take it off just yet, though. Oso-kun is so cute when he's trying so hard to breathe underneath it.\"\r\n\r\n\"Maybe we should just leave him like this? I'm getting a little hungry, let's go get a snack.\" Daichi stands up, his partner following shortly after.\r\n\r\n\"We'll be back to turn off the machine. In the meantime, enjoy yourself.\" Shin gives Oso's nipples a pinch, turning to Daichi.\r\n\r\n\"We shouldn't be gone too long, but if we get distracted, feel free to give us a call,\" Daichi snickers. \"See you soon, Oso-kun.\"\r\n\r\nThe two men exit the room, locking the door behind them and leaving their toy to squirm on the floor."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45878824, "type": "ic", "edited": "2017-10-19T15:01:46.647811", "format": null, "posted": "2017-10-19T15:01:34.704923", "text": "Much of the conversation is lost on Osomatsu, brought back to the world when his ragged breathing is interrupted and when his sore nipples are pinched. All the moving around does nothing for the cum still in his ass, creating a wet patch on the floor beneath him as it slowly leaks out of his hole. \r\n\r\nBut the sound of footsteps and absence of muffled speech does eventually clue him in to the fact that he's alone. The click of the door had gone unnoticed by the young man, so the hope that it'd been possibly left open begins to fill his head.\r\n\r\nIn all honesty he didn't want to be found in such a state, but it was better than simply excepting his fate.\r\n\r\nMoving in the suit is extremely difficult, though he imagines it would be at least a little easier if every movement didn't stir his cock as the cum was milked out of him in shorter bursts of time. But eventually he's able to rock himself onto his belly, raising up as far as he can and beginning to scoot along the floor at a snail's pace.\r\n\r\nFor a moment he's afraid that the leash is attached to something to prevent him from getting very far - still able to feel the tightness of the collar around his neck, but after a few seconds devoted to turning in circles he realizes that he'd trapped the strap underneath one of his knees.\r\n\r\nAfter that it's a matter of finding the door in the first place. It's an exhausting task, and one that Oso has to take many breaks from due to the machine pumping away at his cock - but he's able to find the entrance only to bump his head into the closed door.\r\n\r\nTrapped. \r\n\r\nThe frustration builds up and Oso releases a frustrated sob, lifting off of his elbows and leaning against the door - shuddering as the milker forces him to cum again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45879425, "type": "ic", "edited": "2017-10-19T15:54:38.225484", "format": null, "posted": "2017-10-19T15:54:38.225484", "text": "After eating, Shin and Daichi both arrive back in the room Oso was locked in, only for the door to bump against his body as it leans against it.\r\n\r\nShin smirks down at him, yanking onto the leash and forcing his masked head to face towards him.\r\n\r\n\"Did you really think we'd be stupid enough to leave the door open?\" He snarls, tugging on the leash again. \"Since you were trying to escape, you'll need a more intense punishment...\"\r\n\r\nHe has no plans to kill him, but the idea of sending him into a frenzy of fear by holding his nose longer than usual crosses his mind. And he plans just that, pushing him onto his back and trailing his hand up his latex-covered body.\r\n\r\n\"What if you stopped breathing, right here?\" Shin says, trying to sound as threatening as possible. \"Your little arms and legs would flail around, and you'd try so hard to get away...\"\r\n\r\nHe pinches his nipples again, trailing his hand over to the holes in his face before pinching down.\r\n\r\n\"How long can you hold your breath, Oso-kun? Let's find out...\"\r\n\r\nOf course, he'd pull away once he was on the brink of passing out. He doesn't want a dead body, he just wants to scare him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45880367, "type": "ic", "edited": "2017-10-19T17:08:34.570578", "format": null, "posted": "2017-10-19T17:08:34.570578", "text": "Oso tries to remain calm. The last time hadn't lasted nearly that long. But then more time passes and he still can't breath properly.\r\n\r\nThe suit is too tight to hold any pockets of air and trying to breath through his mouth with the bit locked in place is near impossible.\r\n\r\nHe struggles and begins to twist in place, eventually tiring himself out as his head starts to feel lighter."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45882304, "type": "ic", "edited": "2017-10-19T19:26:32.952147", "format": null, "posted": "2017-10-19T19:26:32.952147", "text": "Shin laughs at Oso's struggling before letting go, allowing him to breathe once again.\r\n\r\n\"Relax, I'm not gonna kill you.\" Shin pats him on his masked cheek. \"That would be such a waste.\"\r\n\r\nDaichi goes to turn off the machine, examining the amount of cum stored inside. There's quite a bit, and he thinks he knows just the thing to do with it.\r\n\r\n\"Take off his mask and gag for a second, Shin,\" he says, which Shin obeys. Daichi walks back over to Osomatsu, crouching down to softly touch his cheek.\r\n\r\n\"How do you feel, Oso-kun?\" He asks. \"Look at how much you came into the machine...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 45883190, "type": "ic", "edited": "2017-10-19T20:32:42.068959", "format": null, "posted": "2017-10-19T20:32:42.068959", "text": "Oso flinches at the touch. Being able to see doesn't help him at all when he can't do anything to not be touched. But...having the gag out is a victory of sorts.\r\n\r\n\"P-please,\" he stammers, looking up to Daichi. \"You had your fun, please just let me go.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 45883502, "type": "ic", "edited": "2017-10-19T20:51:16.247662", "format": null, "posted": "2017-10-19T20:51:16.247662", "text": "Daichi shakes his head, giving Oso a sadistic grin as he ruffles his hair.\r\n\r\n\"I don't think so. Why on Earth would we let you go now that we have you like this?\" It's a question that a sadist like Daichi doesn't understand.\r\n\r\n\"The fun isn't even close to over, Oso-kun,\" Shin says as he walks over to the machine, taking off the bottle attached to the side and dispensing the collected cum into it. \"Are you thirsty? We have a drink for you...\"\r\n\r\nDaichi picks Oso up and places him back on his elbows and knees, Shin pressing the bottle against his lips and placing a hand on the back of his head.\r\n\r\n\"Drink up, cock slut.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 45883531, "type": "ooc", "edited": "2017-10-20T01:17:58.314841", "format": null, "posted": "2017-10-19T20:53:17.047626", "text": "((just making sure: you're cool with cum drinking, right? Although you are into a lot of kinky stuff, I just want to make sure\r\n\r\nalso, I'm commissioning someone to draw Oso in the rubber bitchsuit/mask! I'll send you a link whenever they finish it"}]