[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46040157, "type": "ic", "edited": "2017-10-27T05:17:20.074175", "format": null, "posted": "2017-10-27T05:17:20.074175", "text": "Oso looks around the room quickly, trying to commit the layout to memory in case he was blinded by the mask again. He doubts he'd be left to his own devices to wander about, but there's still a part of him that's hoping for an escape.\r\n\r\nHe can already hazard a guess that the treadmill is going to be the name of his existence for the rest of his captivity given how difficult it is to move.\r\n\r\nAnd in a rare moment of bravery, Oso actually manages to spit in Shin's vicinity out of anger."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46040179, "type": "ooc", "edited": "2017-10-27T05:19:00.850625", "format": null, "posted": "2017-10-27T05:19:00.850625", "text": "What do you think too of the suit Oso being in now being a sort of training suit that's used on all the brothers? Then he could be put in one that almost elevates him like he's on stilts and they end in hooves"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46040193, "type": "ooc", "edited": "2017-10-27T05:19:45.885164", "format": null, "posted": "2017-10-27T05:19:45.885164", "text": "(( good idea! that'd be fun!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46040212, "type": "ooc", "edited": "2017-10-27T05:21:06.119776", "format": null, "posted": "2017-10-27T05:21:06.119776", "text": "I like the idea of Ichi being allowed to get away with the most things being a cat and all. Just being pampered after being broken"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46040279, "type": "ic", "edited": "2017-10-27T05:25:25.031790", "format": null, "posted": "2017-10-27T05:25:25.031790", "text": "Shin sneers down at Oso before shoving the gag in his mouth, tightening it as tight as he can before forcing the mask over his head.\r\n\r\n\"Wrong answer, cock slut,\" he growls, plugging up the nose holes for a few seconds before pulling away.\r\n\r\nDaichi starts the treadmill at a slow speed, watching Oso to see how he'll react and how quickly he'll move forward.\r\n\r\nJust for that bout of defiance, Shin decides he'll put him on the milker again before the end of the day."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46040285, "type": "ooc", "edited": "2017-10-27T05:25:42.460281", "format": null, "posted": "2017-10-27T05:25:42.460281", "text": "(( yess, I like the Ichi idea"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46040370, "type": "ic", "edited": "2017-10-27T05:30:27.233362", "format": null, "posted": "2017-10-27T05:30:27.233362", "text": "Oso can't help it. Before he's blinded by the mask and gagged to the point of only being able to produce gargled protests, he manages a short laugh at the expense of his captor's face. Small victories were important to keeping his spirits high. \r\n\r\nNot wanting to be pitched off the tread mill, Oso has to focus solely on moving his bound limbs in perfect tandem. There are a few slip ups, but for the most part he's a quick learner and able to keep pace in slow, steady strides."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46040458, "type": "ic", "edited": "2017-10-27T05:35:30.961916", "format": null, "posted": "2017-10-27T05:35:30.961916", "text": "\"Such a fast learner, Oso-kun,\" Daichi praises, turning up the treadmill to a faster speed. \"I wonder how long he can keep up?\"\r\n\r\nShin, having been pissed off by the spit and the laugh, already has his mind racing. There's a riding crop leaning against the cage, which he picks up before letting it smack against his ass repeatedly.\r\n\r\n\"Know your place, cock slut,\" he taunts, even if he can't hear him through the mask."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46040630, "type": "ic", "edited": "2017-10-27T05:47:26.906226", "format": null, "posted": "2017-10-27T05:47:26.906226", "text": "Much like a real horse, Oso spooks at the sharp stinging centered on his bare ass. The contact practically spurs him into picking up speed on the slow treadmill in an effort to distance himself no matter how futile. \r\n\r\nIn all likely hood it's probably what keeps him from sliding off the treadmill once it picks up speed."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46044141, "type": "ic", "edited": "2017-10-27T15:20:18.332172", "format": null, "posted": "2017-10-27T15:20:18.332172", "text": "It starts to dawn on Daichi that Shin, as pissed as he is, wants to see Oso get punished. The frequent swats to his ass from the riding crop attests to that. Shin's temper was hard to control, especially with defiant slaves, so Daichi decides to indulge him a bit.\r\n\r\nTurning on the treadmill to an even higher speed, Daichi watches as Shin smacks at Oso's cock and ass with the riding crop, clearly trying to throw him off-guard with the smacks to his dick. There's no escape from the harsh strikes against his exposed skin, and both masters know that too well."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46044350, "type": "ic", "edited": "2017-10-27T15:42:46.947040", "format": null, "posted": "2017-10-27T15:42:46.947040", "text": "By the time Oso's body finally gives out on him, his ass and cock are red and throbbing from every swat they were treated to. The smaller man yelps around the bit in his mouth as he finally slips from the tread mill and tumbles over himself.\r\n\r\nHe cries under the mask, tears wetting his cheeks as they slide beneath the latex. He...he doesn't deserve this kind of treatment - not by a long shot.\r\n\r\nHopefully his brothers would notice when he didn't come home for the evening and call the police. Surely it wouldn't be too difficult to find these men that had captured him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46044434, "type": "ic", "edited": "2017-10-27T15:53:12.291875", "format": null, "posted": "2017-10-27T15:53:12.291875", "text": "The two masters laugh as Oso sobs on the floor, their hands trailing up to molest his chest and sore cock.\r\n\r\n\"Aw, look at that,\" Daichi snickers as he spots the tears sliding out from the latex. \"I guess sex toys have feelings, too.\"\r\n\r\n\"I want to see Oso-kun's crying face,\" Shin announces before taking off the mask. \"Ah, so cute... I wonder if he has anything to say?\"\r\n\r\nHe takes off the gag momentarily, allowing him to speak once more.\r\n\r\n\"I wonder what sort of punishment would be suited for Oso-kun for failing to keep up?\" Shin asks."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46044498, "type": "ic", "edited": "2017-10-27T16:00:30.412329", "format": null, "posted": "2017-10-27T16:00:30.412329", "text": "\"J-just leave me alone,\" he whimpers, all the fight from before having left him in the short time since he spat at the man.\r\n\r\nOso sniffles pitifully, unable to bring himself to writhe on the floor in an attempt to get away from their touch."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46044565, "type": "ic", "edited": "2017-10-27T16:09:58.048305", "format": null, "posted": "2017-10-27T16:09:58.048305", "text": "Osomatsu's little plea falls on deaf ears as the men continue to grope him, feeling no remorse as he sniffles and cries.\r\n\r\n\"Where's that feisty attitude from earlier?\" Shin teases, hand running along his red ass. \"Have you accepted your fate as our pet, Oso-kun?\"\r\n\r\nHe gives his ass a quick smack as Daichi turns off the treadmill, afterwards crouching down to meet his face.\r\n\r\n\"You know you need to be milked now for falling off of the treadmill.\" He smirks, wiping away a few tears with his thumb. \"But you were doing well, so we'll only milk you for about twenty or thirty minutes.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46044700, "type": "ic", "edited": "2017-10-27T16:20:22.790028", "format": null, "posted": "2017-10-27T16:20:22.790028", "text": "The idea of being milked again makes Oso flinch. So soon after the first time? He hadn't even been producing cum near the end of the hour. The NEET paws his arms in the air in a clear plea for mercy.\r\n\r\n\"No, no, I can go back on. I can do better. I promise.\" He says hurriedly, eyes darting around the room in a panic."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46044796, "type": "ic", "edited": "2017-10-27T16:28:01.599532", "format": null, "posted": "2017-10-27T16:28:01.599532", "text": "Daichi smiles as he runs a hand through his hair. \"So eager to please, I see. What do you think, Shin? Should we give Oso-kun anouther chance?\"\r\n\r\nShin's sadistic streak and his earlier temper point at him saying no. And that's what he does, shaking his head.\r\n\r\n\"He can handle it for another twenty minutes, I think. Although...\" He eyes Oso. \"We might be able to make an offer with him if he's that opposed to being milked.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46044830, "type": "ic", "edited": "2017-10-27T16:32:05.718397", "format": null, "posted": "2017-10-27T16:32:05.718397", "text": "Oso's eyes dart between the men fearfully. A deal? He'd make a deal. Anything to not have that constant pressure working away at his cock - and it meant not having to drink his own cum immediately after as well.\r\n\r\nHe nods excitedly, looking at the men with a hopeful expression. \"Yes! I'll make a deal, please. Please, let's work something out.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46044923, "type": "ic", "edited": "2017-10-27T16:40:14.519174", "format": null, "posted": "2017-10-27T16:40:14.519174", "text": "The two men grin at each other, knowing that this little deal would be something Oso would be very reluctant to agree to.\r\n\r\n\"Okay, here's the deal,\" Shin starts before launching into his explanation. \"We want you to lure your brothers into a trap, so we can capture them too. One at a time, you'll lure them in with your voice, and that's when we nab them.\r\n\r\n\"If you refuse, we'll put you on the milker for another hour or two. It's your choice, Oso-kun. Your safety, or your brothers' safety?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46045006, "type": "ic", "edited": "2017-10-27T16:46:23.216528", "format": null, "posted": "2017-10-27T16:46:23.216528", "text": "Oso freezes. \r\n\r\nHe shouldn't even consider taking the deal. Involving his brothers in this when it was his fault to begin with would be unspeakably cruel.\r\n\r\nBut...no one said the Matsunos were particularly strong willed individuals either. He was barely a day into his training and his spirit was teetering on the breaking point.\r\n\r\n\"O-okay,\" he concedes after a brief moment, gaze firmly rooted to the floor. It doesn't even dawn on him that the men could go back on their word or the fact that it would only be a temporary relief. \"I'll do it.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46045190, "type": "ic", "edited": "2017-10-27T16:58:27.450073", "format": null, "posted": "2017-10-27T16:58:27.450073", "text": "Daichi ruffles Oso's hair affectionately, giving him an oddly gentle smile. \"That's a good boy, Oso-kun. For our next capture, we're going to go with Karamatsu. If he disappears, the others probably won't give a shit, so he's a perfect target.\"\r\n\r\n\"We should have Oso-kun record some audio tapes for each brother, since letting him out of the suit is too risky. Do you know what kind of things Karamatsu likes, Oso-kun? It would help us a lot.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46045250, "type": "ic", "edited": "2017-10-27T17:03:46.234934", "format": null, "posted": "2017-10-27T17:03:46.234934", "text": "\"He's a flirt...and oblivious. If someone showed him attention he'd trip over himself trying to please them,\" he answered, hiccuping slightly. God he hates how he pushes into the kind touch."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 46045352, "type": "ic", "edited": "2017-10-28T18:52:49.212063", "format": null, "posted": "2017-10-27T17:14:09.863266", "text": "Daichi gives him gentle pats on his head. \"Such a good pet, Oso-kun. We'll give you a little rest so we can play with Karamatsu once we capture him.\"\r\n\r\nHe gives him a kiss to the cheek, standing up to face Shin.\r\n\r\n\"I don't think we need a tape recording this time,\" Daichi says. \"We'll just offer him a little kindness and that'll go a long way.\"\r\n\r\n\"How about a job offer?\" Shin suggests. \"Get him to a secluded area and then we'll tie him up.\"\r\n\r\nDaichi nods, pleased with the idea. Before he leaves, he places Oso gently in the cage, locking the door.\r\n\r\n\"We'll be back in half an hour or so. Thank you so much, Oso-kun.\" With that, the two leave the room, locking the door before exiting the house and driving off towards the city."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46045575, "type": "ic", "edited": "2017-10-27T17:33:25.190988", "format": null, "posted": "2017-10-27T17:33:25.190988", "text": "The cage is barely more than a glorified dig kennel, with hardly enough room for him to turn around. He's more than willing to ignore the container of cum attached to the cage like a hamster's water bottle, but after a few hours pass he can't help but suckle from the tip to parch his dry throat. \r\n\r\nThough he gets a good portion of cum on his face as he tries to drink around the bit. In the end his face is a mess of cum and drool when Oso settles into what constitutes as laying down and dozed off."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46045613, "type": "ooc", "edited": "2017-10-27T17:36:01.778127", "format": null, "posted": "2017-10-27T17:36:01.778127", "text": "(( do you want my next response to be the men having already kidnapped Kara and bringing him back to the house? Or do you want to play out his kidnapping?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46045746, "type": "ooc", "edited": "2017-10-27T17:46:33.065491", "format": null, "posted": "2017-10-27T17:46:33.065491", "text": "I think we can roll with after the kidnapping? I don't really see much variety in playing them all out"}]