[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46045785, "type": "ooc", "edited": "2017-10-27T17:49:17.183414", "format": null, "posted": "2017-10-27T17:49:17.183414", "text": "(( I agree"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46045808, "type": "ooc", "edited": "2017-10-27T17:51:15.846490", "format": null, "posted": "2017-10-27T17:51:15.846490", "text": "Cool cool!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46045901, "type": "ic", "edited": "2017-10-27T17:58:12.832514", "format": null, "posted": "2017-10-27T17:58:12.832514", "text": "It doesn't take much convincing for the two to kidnap Karamatsu. Oso was right, he really /was/ oblivious, going right into their trap so easily. The NEET is currently tied up and gagged with tape in the back of the trunk, in a sack that must be painfully hot like it was for Oso. But it won't be the most unbearable heat he would experience these coming days.\r\n\r\nThe two stop the car in front of their base before lifting up the sack, shoving it through the front door and allowing Kara to spill out of it.\r\n\r\nShin ungags him, gripping tightly onto his shoulders as he gives him a wicked grin.\r\n\r\n\"Hello, Kara-kun. Thank you for signing up for the job offer...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46061111, "type": "ooc", "edited": "2017-10-28T17:44:21.424605", "format": null, "posted": "2017-10-28T17:44:21.424605", "text": "Are they in the room with Oso or is this the original room?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46061703, "type": "ooc", "edited": "2017-10-28T18:33:58.124080", "format": null, "posted": "2017-10-28T18:32:49.868163", "text": "(( original room, they'll play with kara a bit before putting him in that heated tank and then they'll probably wake up oso to show him"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46061736, "type": "ooc", "edited": "2017-10-28T18:36:39.354691", "format": null, "posted": "2017-10-28T18:36:39.354691", "text": "(( also, could we possibly use something like this for choro's pig suit? https://www.dropbox.com/s/rl3dh4ui08peauf/0024.jpg?dl=0"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46061905, "type": "ooc", "edited": "2017-10-28T18:48:58.007157", "format": null, "posted": "2017-10-28T18:48:58.007157", "text": "Oh yeah! I was going to suggest something along those lines!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46061910, "type": "ooc", "edited": "2017-10-28T18:49:38.701302", "format": null, "posted": "2017-10-28T18:49:38.701302", "text": "(( nice! it'd definitely be humiliating for him"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46071080, "type": "ooc", "edited": "2017-10-29T03:21:20.928084", "format": null, "posted": "2017-10-29T03:21:20.928084", "text": "(( commission is finished~\r\n\r\nhttps://www.dropbox.com/s/1bma3w5o9d3naj9/latexoso.png?dl=0"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46076894, "type": "ooc", "edited": "2017-10-29T09:11:46.036394", "format": null, "posted": "2017-10-29T09:11:46.036394", "text": "That's killer!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46076919, "type": "ic", "edited": "2017-10-29T09:15:42.527689", "format": null, "posted": "2017-10-29T09:15:42.527689", "text": "He should've known that the offer for his dream job was too good to be true. At least in hindsight. If Kara had had any idea of what was really going on, he probably wouldn't be in the mess he's in now.\r\n\r\nStill...one could always hope for the best.\r\n\r\nGiven the fact that he'd never actually held down a steady job, Kara couldn't be completely sure that this wasn't par the course. \r\n\r\n\"You're...welcome?\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 46077103, "type": "ic", "edited": "2017-10-29T09:54:58.788969", "format": null, "posted": "2017-10-29T09:38:20.859011", "text": "Shin's grip around Kara's shoulders tightens, truly surprised at how oblivious he is to the current situation. Maybe it'd be a bit easier to get him all bound up this way, but Shin also craves any kind of fear from the new captive.\r\n\r\n\"Oh?\" He tilts his head, hands trailing up underneath his hoodie. \"You seem relaxed, Kara-kun. Much more relaxed than our last client...\"\r\n\r\nDaichi grabs a pair of scissors and approaches Kara, snipping away at his hoodie to reveal his soft skin.\r\n\r\n\"Just listen to our orders, and this initiation will be over before you know it,\" Daichi says as he starts to cut his jeans."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46077308, "type": "ic", "edited": "2017-10-29T10:15:50.507432", "format": null, "posted": "2017-10-29T10:15:50.507432", "text": "...Looking on the bright side might not be as viable an option as Kara hoped by this point.\r\n\r\nThe loss of his clothes is more than enough of a dead giveaway for the other to finally realize that the job offer was a fake. Also was the guy insinuating that they'd kidnapped someone else? \r\n\r\nLaughing nervously in a haze of what he should do, Kara attempts to gently push them away with his taped hands to no avail."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46077376, "type": "ic", "edited": "2017-10-29T10:29:15.288129", "format": null, "posted": "2017-10-29T10:29:15.288129", "text": "The weak pushes from his bound hands do nothing to stop the two men. Daichi continues to cut his jeans, revealing the boxers underneath as Shin grabs a roll of tape.\r\n\r\n\"I wonder if Kara-kun has a bigger dick than his brother...\" Daichi says. \"Do sextuplets have the same dick size?\"\r\n\r\nHe snips away at his boxers, revealing the cock underneath. That was sure to make him lose any composure he had left."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46087414, "type": "ic", "edited": "2017-10-29T22:37:24.883425", "format": null, "posted": "2017-10-29T22:37:24.883425", "text": "Kara flushes at the sight of his own cock. He curls in on himself, trying to cover up his dick with his hands. With his arms and legs taped together, there isn't much he can do in way of moving away from the two men."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46087721, "type": "ic", "edited": "2017-10-29T22:47:37.228157", "format": null, "posted": "2017-10-29T22:47:37.228157", "text": "Daichi chuckles at Karamatsu's movements, giving his cock a few kisses and licks as Shin starts to wrap the tape around his torso, barring his nipples to both of them.\r\n\r\n\"You're not really saying much, Kara-kun,\" Daichi muses, pulling away from his dick. \"Oso-kun's reactions were a lot more intense.\"\r\n\r\nShin's tape wraps around his form, hands taped against his body to prevent him from moving them. Daichi forces him to stand up as Shin starts to wrap his legs together. His cock and ass are uncovered, the same with Osomatsu. But the position is different, his body mummified in tape as the two lay him out on his back.\r\n\r\nDaichi leans down to stroke his dick, Shin playing with his nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46100512, "type": "ic", "edited": "2017-10-30T07:43:02.918000", "format": null, "posted": "2017-10-30T07:43:02.918000", "text": "Wait. Oso-kun was here too? Had he been offered the same job and lured into captivity? Kara's eyes widen at the mention of his brother, but it's already too late for him to try and escape when he's been reduced to squirming and rolling on the floor.\r\n\r\n\"W-where's my brother?\" He asks fearfully, thankful that he hasn't been gagged again - eyes darting around the room in search of his brother."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46101935, "type": "ic", "edited": "2017-10-30T12:43:08.334323", "format": null, "posted": "2017-10-30T12:43:08.334323", "text": "\"Relax, Kara-kun,\" Shin says as he tugs on his nipples. \"You'll see him soon enough, we promise.\"\r\n\r\nDaichi gives his cock a few kisses before walking over to Kara's discarded boxers, picking them up and approaching him once more.\r\n\r\n\"We have a lot of plans for you, little pet,\" he says as he holds Kara's nose, pressing the boxers against his lips. \"Now open wide.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46177052, "type": "ic", "edited": "2017-11-03T05:00:51.881926", "format": null, "posted": "2017-11-03T05:00:51.881926", "text": "It doesn't take long before Kara's lungs are screaming for air, bound legs moving in harmony as he struggles feebly. He's not doing much more than making a nuisance of himself with how unused to moving in this position he is. Eventually, as tears begin to form in the corners of his eyes, Kara's mouth opens up for a brief gasp of air before the boxers are shoved in.\r\n\r\nThe cottony material isn't entirely unpleasant, but the NEET is still upset as the cloth absorbs the moisture in his mouth and fills up his cheeks to the point where he can't even attempt to push it out with his tongue.\r\n\r\nEyes narrowed, Kara wiggles around to show his displeasure, staring up at the two men angrily."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46178626, "type": "ic", "edited": "2017-11-03T06:22:33.544304", "format": null, "posted": "2017-11-03T06:22:33.544304", "text": "The two men find themselves aroused as Kara squirms helplessly, his angry expression downright adorable to them.\r\n\r\n\"How cute...\" Daichi coos, giving him a kiss on the cheek as it bulges from the cotton. \"That's gonna be in your mouth for at least a few hours, so you better get used to it.\"\r\n\r\nShin grabs a roll of tape, using it to seal Kara's mouth shut as he wraps it around a few times. Even if he couldn't push it out to begin with, extra layers were always fun.\r\n\r\n\"What do you think we should do next, Daichi?\" Shin asks, pinching Kara's nipples. \"Should we put the latex on?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46178717, "type": "ic", "edited": "2017-11-03T06:29:16.713657", "format": null, "posted": "2017-11-03T06:29:16.713657", "text": "Kara's muffled protests are little more than unintelligible grunts, picking up an octave when his nipples are played with. This kind of abuse really shouldn't turn him on, but his cock twitches a few times anyway at the attention and Kara can feel his face flushing with embarrassment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46178810, "type": "ic", "edited": "2017-11-03T06:35:31.609299", "format": null, "posted": "2017-11-03T06:35:31.609299", "text": "\"I think he'd look cute in the latex... just like Oso-kun.\" Daichi says as he retrieves the latex suit from a corner of the room. \"Instead of a horse slave, he can be a snake slave.\"\r\n\r\nShin lifts up Kara's legs as Daichi inches his whole body into the suit, bit by bit, before his whole upper and lower body is encased by the black rubber.\r\n\r\nOf course, Daichi adds the mask moments later, completing his look as a mummified rubber doll.\r\n\r\nThe two, satisfied with the way the latex looks, begin toying with Kara's body once more, awaiting any wiggling and squirming from their pet."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46178905, "type": "ic", "edited": "2017-11-03T06:44:04.245828", "format": null, "posted": "2017-11-03T06:44:04.245828", "text": "The smaller man does everything in his power to struggle, but forcing himself out of Shin's grasp is easier said than done when he's been reduced to a practically limbless captive.\r\n\r\nIt only gets worse as he realizes the latex suit is made in the same fashion, a single sleeve designed to keep his arms and legs locked in their current position. Then the mask is blinding him and his entire world goes dark. The inside of the latex is stifling, with no relief to be found except for the cool air on his nipples, cock, and ass.\r\n\r\nWhich isn't much of a relief considering he can guess why they've been left free to the elements. \r\n\r\nWith the hands on his body, Kara tries to squirm away - a laughable experience to anyone outside the suit as he's reduced to rolling around and practically humping the floor to travel a few centimeters."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46178984, "type": "ic", "edited": "2017-11-03T06:54:41.556392", "format": null, "posted": "2017-11-03T06:51:53.886652", "text": "Predictably, the two find their squirming, wiggling toy to be arousing from the sheer helplessness of his situation. He's completely wrapped up with nowhere to go, just a body to be used for their pleasure.\r\n\r\n\"Hold still,\" Shin scolds, giving him a rougher pinch to the nipples. \"If you keep wiggling like that, we'll have to put you in the tank for a few hours.\"\r\n\r\nHe knows very well that he can't hear him under the mask, but Daichi gets the message as they both stand Kara up, leading him towards the door next to Oso's."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179018, "type": "ooc", "edited": "2017-11-03T06:56:15.518971", "format": null, "posted": "2017-11-03T06:56:15.518971", "text": "Sorry I have trouble orienting myself. Different room again?"}]