[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179027, "type": "ooc", "edited": "2017-11-03T06:57:53.791005", "format": null, "posted": "2017-11-03T06:57:53.791005", "text": "(( yep! different room"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179048, "type": "ic", "edited": "2017-11-03T07:01:36.003053", "format": null, "posted": "2017-11-03T07:01:36.003053", "text": "The struggling resumes ten fold as the blind and deaf Karamatsu panics being picked up. Without his vision, there's no way he could ever hope to escape the place since he'd been in a bag when they first arrived and had only actually seen one room."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179102, "type": "ic", "edited": "2017-11-03T07:08:42.518564", "format": null, "posted": "2017-11-03T07:08:42.518564", "text": "They soon reach the room, holding on tightly to the thrashing NEET as he's wrapped in rubber. The two have big plans for him, plans that would be downright miserable torture for him to endure.\r\n\r\nIn the room lays a giant tank, big enough to fit a few fully-grown men. Karamatsu's body would definitely fit given it's small size. Hanging above the tank are heat lamps, dedicated to making Karamatsu's time in the tank unbearable, even more so with the latex casing.\r\n\r\nThe two men place his struggling body into the tank through a door on the side, laying him flat on his back before leaving him alone and flicking the switch to the lamps on."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179115, "type": "ooc", "edited": "2017-11-03T07:10:43.189324", "format": null, "posted": "2017-11-03T07:10:43.189324", "text": "Hey what do you think of Jyushi having his nipples pierced as a dog when he's in the suit and having a short chain attached to his wrists that put him in the begging position?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179119, "type": "ooc", "edited": "2017-11-03T07:11:07.586026", "format": null, "posted": "2017-11-03T07:11:07.586026", "text": "(( that's a very cute idea!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179155, "type": "ooc", "edited": "2017-11-03T07:15:04.225666", "format": null, "posted": "2017-11-03T07:15:04.225666", "text": "Oops maybe once they're all trained up they move out of the warehouse building setup and into a secluded property? Horse, pig, and cow are all nicely locked up in a stable, snake is a permanent resident in the house, dog and cat have free roaming priveledges for the most part."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179177, "type": "ooc", "edited": "2017-11-03T07:17:01.551442", "format": null, "posted": "2017-11-03T07:17:01.551442", "text": "(( oh, I like that idea a lot!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179188, "type": "ooc", "edited": "2017-11-03T07:18:12.681845", "format": null, "posted": "2017-11-03T07:18:12.681845", "text": "Thanks! With Jyushi, he could play fetch in the yard and even have a dog house to be chained to and have to stay outside if he was being punished."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179190, "type": "ooc", "edited": "2017-11-03T07:18:34.809350", "format": null, "posted": "2017-11-03T07:18:34.809350", "text": "(( very cute!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179247, "type": "ic", "edited": "2017-11-03T07:25:42.654429", "format": null, "posted": "2017-11-03T07:25:42.654429", "text": "Kara reaches peak confusion, expecting more torment once he's been laid back on the floor. No hands are groping at his body and he can no longer hear muffled voices discussing his fate. Was he alone? The brother lets out a garbled whine that barely makes it through the latex mask.\r\n\r\nHe at least needed to try and figure out where he was.\r\n\r\nRocking back and forth, he's eventually able to roll onto his front - grunting at the pressure on his cock until he lifts his groin a little. Ass in the air, he begins to squirm and inch his way around the tank.\r\n\r\nThat's when the heat gets to him. He doesn't notice at first but the more he explores his new environment, the hotter he gets. Kara can practically feel the sweat building up underneath the layers of tape and latex. He wants to do nothing more than pant heavily, but the boxers in his mouth prevent everything except quick, shallow breaths through his nose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179295, "type": "ic", "edited": "2017-11-03T07:31:48.827936", "format": null, "posted": "2017-11-03T07:31:48.827936", "text": "The two watch as Kara squirms around in the tank, just like a proper snake. And when the heat hits, they laugh at his shallow breathing through the small holes in his mask, able to see just how awful of a state he's in.\r\n\r\nThey decide to leave Kara alone to retrieve Oso, but not before placing a camera in front of the tank to see him squirm while they're away.\r\n\r\nBoth reach the room Oso's sleeping in, kicking the cage in an attempt to jolt him awake.\r\n\r\n\"We have a surprise for you, Oso-kun,\" Shin says as he continues to rattle it. \"Would you like to see?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179332, "type": "ic", "edited": "2017-11-03T07:37:32.394013", "format": null, "posted": "2017-11-03T07:37:32.394013", "text": "Oso comes to in an instant. Surely he'd just been having some kind of terrible nightmare? But when he wakes up, he's still in the cage with a bit forced between his teeth and stuck on all fours like an animal. Not a dream then. Everything had been real.\r\n\r\nTears pour out of the NEET as he sobs quietly, regarding Shin through the metal bars of the cage before slowly nodding."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179359, "type": "ic", "edited": "2017-11-03T07:42:31.480579", "format": null, "posted": "2017-11-03T07:42:31.480579", "text": "Shin laughs cruelly as the NEET sobs, opening the cage and tugging on his leash.\r\n\r\n\"Come on, cockslut,\" he says as he yanks him out of the cage. \"You're gonna go crazy over this surprise, we promise.\"\r\n\r\nHe's lead outside the room and into the one next door, where Kara's stuck squirming in the tank. Oso's tugged along until he's in front of it, allowing him to see his brother's torture.\r\n\r\n\"It's all thanks to you, Oso-kun,\" Daichi says, patting him on the head. \"Without you, we wouldn't have known how to kidnap our newest pet.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179391, "type": "ic", "edited": "2017-11-03T07:47:01.279923", "format": null, "posted": "2017-11-03T07:47:01.279923", "text": "Oso can only watch his brother's torment for so long before hanging his head in shame. Daichi was right. Karamatsu wouldn't even be involved in this mess if it weren't for him. And for what? Because he didn't want the milker to work at his cock again? \r\n\r\nThe second brother is completely oblivious to their presence, too hot to do anything but squirm and twitch in place once he's run out of energy to move around the tank. Without his sight, the place seems massive and Kara whines softly as he rolls onto his back once more and lays in the uncomfortable heat."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179442, "type": "ic", "edited": "2017-11-03T07:53:33.329720", "format": null, "posted": "2017-11-03T07:53:33.329720", "text": "\"Looks like he gave up,\" Shin laughs as he watches Kara roll onto his back in defeat. \"Those little twitches are cute though. Maybe he'd feel a little better if he had a toy to play with...\"\r\n\r\n\"Would you like to volunteer, Oso-kun?\" Daichi suggests. \"We could get Kara out here for a few minutes so you two can have a little fun with each other.\"\r\n\r\n\"Look at him squirm around, Oso-kun. Don't you think he needs a friend?\" Shin teases him as he yanks on the collar, ungagging him shortly after."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179504, "type": "ic", "edited": "2017-11-03T08:03:11.269143", "format": null, "posted": "2017-11-03T08:03:11.269143", "text": "Oso's gaze flicks about the tank, taking in the multiple lights and heat lamps. No doubt that was the cause of his brother's current misery. And while he doubts that anything good will come with them being in the same room, it would at least relieve his brother for a short while.\r\n\r\nThe eldest brother works his mouth open and closed a few times before speaking, trying to get the taste of bit and cum out of his mouth. \"Please let my brother out of there,\" he asks politely. \"He...he looks like he needs a friend.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179542, "type": "ic", "edited": "2017-11-03T08:08:24.536249", "format": null, "posted": "2017-11-03T08:08:24.536249", "text": "Daichi smiles, ruffling Oso's hair. \"So polite, Oso-kun. We'll let him out for a few minutes and let you two have fun.\"\r\n\r\nShin turns off the heat lamps and lights before retrieving Karamatsu, allowing him to lie on the floor in front of Oso as he takes the mask off to allow him to see once more.\r\n\r\n\"Well, you volunteered to be his friend,\" Shin laughs as he strokes Kara's dick in front of Oso. \"Go ahead and give him some relief.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179574, "type": "ic", "edited": "2017-11-03T08:18:12.609345", "format": null, "posted": "2017-11-03T08:18:12.609345", "text": "Kara blinks as the world comes back to him. The two men from before are back, but there's another hunched figure that he's instantly able to recognize as Oso. Several garbled pleas for his brother to help are muffled by his boxer gag, and his eyes widen as Oso makes his way forward as his cock is stroked to an erection.\r\n\r\nThe eldest of the two can only grimace as he approaches his brother, straddling his mummified form with his elbows and popping his cock into his mouth.\r\n\r\nFrom the way Kara starts jerking and crying out, it's clear that he wasn't expecting his brother to actually listen to their demands."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46179602, "type": "ic", "edited": "2017-11-03T08:25:39.443381", "format": null, "posted": "2017-11-03T08:25:39.443381", "text": "\"Good boy, Oso-kun,\" Daichi says as Oso sucks his brother's cock. \"Keep going until he cums... use that cute tongue of yours to suck him dry...\"\r\n\r\n\"So shameful, Oso-kun,\" Shin teases as he plays with Kara's nipples. \"Sucking your own brother's dick like this... I'll bet you're enjoying this at least a little bit, huh?\"\r\n\r\n\"Come on, go deeper,\" Daichi urges as he forces his head down further. \"Moan like a little slut while you suck, and make sure to swallow all of his cum.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46179614, "type": "ic", "edited": "2017-11-03T08:30:08.896893", "format": null, "posted": "2017-11-03T08:30:08.896893", "text": "Both brothers' faces are red with shame as Oso continues, gagging when Daichi shoves his head down onto Kara's cock. Kara's hips twitch in their bondage, effectively fucking his brother's throat as his nipples are pinched and pulled.\r\n\r\nThey're both moaning, Oso louder than Kara but still muffled by the cock in his mouth. He retreats once his brother cums, swallowing quickly as a strand drips down from his chin. No wonder they called him Cock Slut."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46211991, "type": "ic", "edited": "2017-11-05T03:18:29.291522", "format": null, "posted": "2017-11-05T03:18:29.291522", "text": "Daichi yanks back Oso's hair, chuckling at the cum dribbling down his chin.\r\n\r\n\"That's it, Oso-kun... you're getting so good at being obedient,\" he says as he pats him on the head. \"How did Kara-kun's cock taste?\"\r\n\r\n\"You even made him cum, how shameful...\" Shin taunts as he yanks at Kara's nipples. \"Both of you will soon be wonderful pets, along with the rest of your brothers.\"\r\n\r\n\"Speaking of which, you should tell us about Choromatsu,\" Daichi says as he ruffles Oso's hair. \"Unless you want Kara to go back in the tank, of course.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46235975, "type": "ic", "edited": "2017-11-06T03:16:37.905914", "format": null, "posted": "2017-11-06T03:16:37.905914", "text": "Kara's brows furrow in confusion. Surely his older brother wasn't about to tell these men anything about them? Not that he can interrupt with the boxers shoved into his mouth and bulging out his cheeks, cock covered with his own cum and his brother's saliva.\r\n\r\n\"H-he's the smartest,\" he admits, gaze rooted firmly on the floor and avoiding looking at his brother when his nipples are yanked on by Shin and he hears a muffled yelp. \"But he has a weakness for girls.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46236301, "type": "ic", "edited": "2017-11-06T03:27:09.265102", "format": null, "posted": "2017-11-06T03:27:09.265102", "text": "\"Is that so?\" Daichi laughs as he gives him a few soft pats to the cheek. \"Thank you so much, Oso-kun. Just what I'd expect from our cute little cock slut.\"\r\n\r\n\"Well, since he's not going back in the tank for now, we might as well play with him for a bit,\" Shin says as he pinches Kara's nipples. \"Daichi will kidnap Choro-kun, and I'll go ahead and play with you two pets.\"\r\n\r\n\"I'll just ask him to sign up for one of those idol manager jobs,\" Daichi suggests. \"If he likes girls, he probably likes idols.\r\n\r\n\"Have fun playing with them, Shin,\" he says, leaving them behind."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46236734, "type": "ic", "edited": "2017-11-06T03:39:18.958829", "format": null, "posted": "2017-11-06T03:39:18.958829", "text": "Oso takes advantage of his sight to crawl forward, protectively hovering around his younger brother and avoiding eye contact with Shin.\r\n\r\nIt hadn't taken him long to figure that Shin was the more cruel of the two men. Daichi ruffled his hair and gave out praises while Shin degraded and humiliated to the best of his ability."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46236981, "type": "ic", "edited": "2017-11-06T03:46:11.588608", "format": null, "posted": "2017-11-06T03:46:11.588608", "text": "\"Aw, isn't that cute? Oso-kun cares about his brother... even though he's the one who sold him out.\"\r\n\r\nShin yanks Oso's hair back, forcing him to look up at him. A wicked grin spreads across his face as he examines the two, thinking of what he'd like to do to them.\r\n\r\n\"You love your brother, don't you? I could see it in the way you sucked his cock... would you like Kara-kun to suck yours?\""}]