[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46237170, "type": "ic", "edited": "2017-11-06T03:51:09.234839", "format": null, "posted": "2017-11-06T03:51:09.234839", "text": "Kara grunts unhappily as his fears are confirmed. Oso had sold him out as well as Choro. The mummified brother watches as his older brother shakes his head at the suggestion. He can't help but be secretly thankful. Boxers were definitely preferred to his brother's cock when it came to things being forced into his mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46237203, "type": "ooc", "edited": "2017-11-06T03:52:01.035171", "format": null, "posted": "2017-11-06T03:52:01.035171", "text": "What if Choro and Ichi were together when Daichi shows up? Two for one special"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46237211, "type": "ooc", "edited": "2017-11-06T03:52:11.098592", "format": null, "posted": "2017-11-06T03:52:11.098592", "text": "(( good idea!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46237403, "type": "ic", "edited": "2017-11-06T03:57:31.257387", "format": null, "posted": "2017-11-06T03:57:31.257387", "text": "Shin shakes his head, sighing in disappointment.\r\n\r\n\"You give me no choice, Oso-kun. I have to put you on the treadmill for more training.\"\r\n\r\n\"As for Kara-kun...\" he gives the younger brother a firm grip around the neck. \"Daichi isn't here, so he can't say no to me putting him back in the tank for a bit.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46237638, "type": "ic", "edited": "2017-11-06T04:04:39.839776", "format": null, "posted": "2017-11-06T04:04:39.839776", "text": "Oso panics. Seeing his brother in the tank had been terrible. He'd train on the treadmill for hours if it meant not subjecting his brother to the room. It'd looked like he'd been on the verge of passing out the last time. \r\n\r\nSwallowing thickly, the oldest Matsu whines and clumsily crawls on his elbows and knees to a position that he can drag his cock over his brother's taped mouth and look pleadingly at Shin."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46237807, "type": "ic", "edited": "2017-11-06T04:10:24.538972", "format": null, "posted": "2017-11-06T04:10:24.538972", "text": "\"That's what I thought, cock slut,\" Shin says as he starts to unwrap the tape around Kara's mouth, removing the boxers shortly after.\r\n\r\n\"Open up, Kara-kun,\" he demands. \"Your slutty brother wants to show you how much he loves you.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46238172, "type": "ic", "edited": "2017-11-06T04:22:14.828298", "format": null, "posted": "2017-11-06T04:22:14.828298", "text": "Kara coughs as his boxers are finally removed, tears streaming down his cheeks as they're quickly replaced by Oso's cock.\r\n\r\nWanting to get the ordeal over as quickly as possible, Oso rocks his hips quickly - certain that Shin wouldn't let this torment end until he came."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46238444, "type": "ic", "edited": "2017-11-06T04:30:50.958428", "format": null, "posted": "2017-11-06T04:30:50.958428", "text": "Shin laughs as Kara is forced to suck at his brother's cock, both looking absolutely miserable.\r\n\r\n\"Suck harder, Kara-kun. Make him cum as fast as you can - or else you're not going to have a good time these next few hours.\"\r\n\r\nHe gives Oso a smack to the ass, shoving two fingers into his hole and thrusting rapidly."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46238578, "type": "ic", "edited": "2017-11-06T04:35:27.536917", "format": null, "posted": "2017-11-06T04:35:27.536917", "text": "Oso's thrust with the fingers in his ass is less than gentle as he's startled into action, choking his younger brother on accident as he sucks and swirls his tongue around the cock. \r\n\r\nIt takes some time, but Oso eventually cums down his brother's warm, wet throat and nearly collapses on top of him without removing his cock from his mouth."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46238899, "type": "ic", "edited": "2017-11-06T04:46:42.962118", "format": null, "posted": "2017-11-06T04:45:27.662538", "text": "\"Good boy, Oso-kun...\" Shin nudges Oso away from his brother. \"...but you weren't fast enough to save your brother from his fate. Back to the tank he goes.\"\r\n\r\nHe shoves the boxers back into Kara's mouth before applying a new roll of tape and sliding the mask back on, lifting him up and slowly walking over to the tank.\r\n\r\n\"I'll put you back on the treadmill, too. Daichi should be back in an hour or so, so we'll stop then. Hopefully Kara hasn't passed out by that point. Unless you want to take his place.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46239446, "type": "ic", "edited": "2017-11-06T05:00:47.619246", "format": null, "posted": "2017-11-06T05:00:47.619246", "text": "What? Oso's mouth falls open in shock. Had Shin even remotely considered holding to his end of the deal? He's offering another one now and Oso is hesitant to accept on the grounds that Shin could quite feasibly screw them both over.\r\n\r\nTaking a deep breath, Oso nods. \"I'll take his place, please, put him back down.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46258702, "type": "ooc", "edited": "2017-11-07T02:33:48.236606", "format": null, "posted": "2017-11-07T02:33:48.236606", "text": "Pretty sure I'm in your group chat"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46258771, "type": "ooc", "edited": "2017-11-07T02:36:22.621620", "format": null, "posted": "2017-11-07T02:36:22.621620", "text": "(( oh cool! are you ichi or jyushi?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46258970, "type": "ooc", "edited": "2017-11-07T02:44:42.563985", "format": null, "posted": "2017-11-07T02:44:42.563985", "text": "Ichi"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46259091, "type": "ooc", "edited": "2017-11-07T02:48:22.045183", "format": null, "posted": "2017-11-07T02:48:22.045183", "text": "(( nice, small world! I'll reply to this chat soon after I get done doing a few things"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46259110, "type": "ooc", "edited": "2017-11-07T02:49:14.517295", "format": null, "posted": "2017-11-07T02:49:14.517295", "text": "No problem!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46260641, "type": "ic", "edited": "2017-11-07T03:50:30.332094", "format": null, "posted": "2017-11-07T03:50:30.332094", "text": "Shin pretends to consider for a moment before placing Kara's body back down on the floor.\r\n\r\n\"How sweet... I can see how much you care about him.\" He approaches Oso, yanking onto the collar towards the direction of the tank.\r\n\r\n\"You won't last five minutes in there,\" he taunts as he puts the gag and back on. \"And I'm still going to have a bit of fun with Kara-kun while you're in there.\"\r\n\r\nShin picks him up, placing him on his back once he's in the tank. Then he puts the mask back on before leaving Oso alone, switching the heat on and approaching Kara's mummified form for a bit of \"fun\"."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46261104, "type": "ic", "edited": "2017-11-07T04:09:48.286426", "format": null, "posted": "2017-11-07T04:09:48.286426", "text": "Osomatsu swallows thickly but doesn't fight as the bit and mask are replaced. The inside is still slick with his saliva from before and the NEET stumbles blindly after the man. It was the least he could do for selling out his brother, even if he could only do so much to protect him - and Choro once he arrived. \r\n\r\nAt the very least, he has an easier time navigating the tank than his mummified brother. The heat adds a miserable element, but he doesn't feel the need to find a way out when he knows the layout of the small room - and that escape isn't a viable option with his brother still trapped.\r\n\r\nMeanwhile, Kara squirms and writhes, confused by being picked up, put down, and then the sound of retreating footsteps. Had Shin returned? By the muffled conversation he's fairly certain that his brother made some kind of deal to keep him out of the tank."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46261386, "type": "ic", "edited": "2017-11-07T04:20:06.650644", "format": null, "posted": "2017-11-07T04:20:06.650644", "text": "Shin takes in Kara's squirming form, bending down to tug at his (likely sore) nipples.\r\n\r\n\"What should I do to you, Kara-kun...?\" He thinks aloud, hands slowly drifting down to his cock before giving it a few strokes. \"I haven't played with your ass yet. I should give it a try.\"\r\n\r\nHe flips his body over, raising his ass in the air and giving it rough spanks with practically no breaks in-between."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46261635, "type": "ic", "edited": "2017-11-07T04:28:56.505118", "format": null, "posted": "2017-11-07T04:28:56.505118", "text": "Kara struggles to keep the position, especially once the spanking begins and he starts sliding back to the floor. Muffled squeals work their way through the boxers and latex as his ass turns red."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46261992, "type": "ic", "edited": "2017-11-07T04:41:32.948614", "format": null, "posted": "2017-11-07T04:40:40.648087", "text": "\"Those noises are so cute, Kara-kun,\" Shin says as he gives him a few more spanks before stopping, rubbing his red cheeks. \"Your little hole is just begging for a few fingers to go inside...\"\r\n\r\nShin slides his thumb inside, circling around his hole before going deeper. He pulls out, giving Kara one last smack before leaving the room for lube."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46262878, "type": "ic", "edited": "2017-11-07T05:17:21.765930", "format": null, "posted": "2017-11-07T05:17:21.765930", "text": "Kara breathes heavily through the mask, taking advantage of the man's absence to recuperate. He'd responded more than he'd like to admit to the treatment of his ass, judging by how hard his cock is underneath him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46283579, "type": "ic", "edited": "2017-11-08T04:25:16.244336", "format": null, "posted": "2017-11-08T04:25:06.572919", "text": "Where on Earth was the lube? Shin finds himself struggling to find it; it isn't in Oso's room or the giant tank room, and he wasn't anywhere else in the warehouse today. Unless Daichi took it, which was the only explanation he could fathom.\r\n\r\nHis thoughts are interrupted from a knock at the door, which he assumes to be Daichi. Muttering to himself about his failed search, he opens the door and is greeted by his partner, who's struggling to carry a heavier-than-average bag.\r\n\r\nWith help from Shin, he dumps the contents onto the floor, revealing not one, but two of the sextuplets, tied back-to-back and gagged with tape.\r\n\r\n\"Holy shit, didn't you get lucky?\" Shin hollers, ripping the tape off of both mens' mouths. \"The other one is Ichimatsu, right?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46286762, "type": "ic", "edited": "2017-11-08T06:55:01.608131", "format": null, "posted": "2017-11-08T06:55:01.608131", "text": "Choromatsu and his younger sibling blink blearily as their eyes adjust to the change in lighting. They'd just been taking a walk when they'd been approached by a man with a job offer and before they knew it they'd been trussed up and gagged, writhing in the same cloth bag with no success in their various attempts to escape.\r\n\r\nBeing back to back, the two brothers get two entirely different views of the room. Choro facing the four-legged latex being with a collar that simply said Cock Slut and Ichi facing the mummified form that wasn't capable of moving in any one direction very far.\r\n\r\nIf the man in the car was to be believed by what he said on the drive up, the two suited figures were their older brothers who'd also fallen into their trap. \r\n\r\nThey both grimace as the tape is ripped away from their mouths, Ichi staring petulantly at the man asking confirmation on his name. \"Right.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46301313, "type": "ic", "edited": "2017-11-09T02:22:03.018683", "format": null, "posted": "2017-11-09T02:22:03.018683", "text": "Shin sneers down at Ichimatsu upon hearing his confirmation, a hand reaching to roughly grip onto his chin.\r\n\r\n\"Is that so... well, Ichi-kun. You like cats, right? Would you like to be one for us?\"\r\n\r\nHe pats his face, while Daichi focuses on Choromatsu.\r\n\r\n\"How are you feeling, Choro-kun? Are you having fun watching Oso-kun in the tank?\""}]