[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48695778, "type": "ic", "edited": "2018-03-12T03:44:36.871800", "format": null, "posted": "2018-03-12T03:44:36.871800", "text": "The worker pinning Ichimatsu groans, pinching his nose shut to deprive him of air so the other worker can jam the fairly large ball in his mouth. He straps it tightly behind his head, tilting his chin up to force him to look at him.\r\n\r\n\"You're the park's pet now. Starting today, you'll be under our complete control. We'll be offering you as a toy for people to play with, but don't worry. You'll eventually grow to love the rough training in a few months time.\"\r\n\r\nHe pats Ichimatsu on the cheek, ruffling his hair afterwards. Then he stands up, grabbing onto a collar and leash and strapping it around Ichi's neck. The collar says \"Kitty Slut\" on the tag, which the worker shows off before putting it on."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48696628, "type": "ic", "edited": "2018-03-12T04:26:28.215714", "format": null, "posted": "2018-03-12T04:26:28.215714", "text": "Ichi chokes around the sheer size of the purple ball as it’s forced between his teeth and strapped into place. It doesn’t take very long before drool is pooling from around the gag and forming a puddle right underneath his head as his new occupation is carefully explained to him.\r\n\r\nHis eyes widen at the curvive scrawl on the collar before it’s cinched tightly around his neck and attached to the collar. The clicks have a sound of finality to them that Ichi can’t stand. Not one of his brothers knew that this is where he went in the middle of the day."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696738, "type": "ic", "edited": "2018-03-12T04:32:30.871334", "format": null, "posted": "2018-03-12T04:32:30.871334", "text": "The worker grins at the fearful look in his eyes, yanking him towards a pole in the middle of the room and attaching the leash to it.\r\n\r\n\"Here, kitty kitty,\" he taunts, the workers all surrounding him with chains and shackles that are soon strapped around his wrists and ankles. The chains are attached to different parts of the floor, keeping the new pet locked in place without the option to squirm very far.\r\n\r\nOne worker grabs for a pair of scissors, snipping away at his hoodie before moving onto his pants. Ichimatsu is only in his boxers now, the fabric soon snipped away to reveal his cock.\r\n\r\n\"Are you ready to begin your training, kitty?\" One of them asks."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48696852, "type": "ic", "edited": "2018-03-12T04:38:23.388464", "format": null, "posted": "2018-03-12T04:38:23.388464", "text": "Ichi is forced to stumble along after the man or risk being choked by the already too tight collar that proclaimed he was a slut. He tries curling into himself once he’s surrounded, knowing that he wouldn’t be able to break away from the crowd while he was still attached to the pole.\r\n\r\nIt has to make their job easier at least. He’s helpless as his wrists and ankles are shackled together to the point where he can only move them about shoulder length apart, and then further restricted by the chains hooked directly to the floor.\r\n\r\nHe groans around the gag, looking fearfully up at the park employees from his position on the floor."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696993, "type": "ic", "edited": "2018-03-12T04:45:47.043658", "format": null, "posted": "2018-03-12T04:45:47.043658", "text": "\"Aw, our little kitten's scared,\" one taunts, pulling out their phone to take a picture. \"On his knees like a proper slut, too...\"\r\n\r\nAnother fastens a cock ring around Ichi's length, taking a crop from a shelf and tracing it along his chest and stomach.\r\n\r\n\"We'll need to put you through some pain endurance training,\" he explains before smacking the crop against his chest. \"Your other masters will get some clamps for those cute little nipples, too.\"\r\n\r\nAs if on cue, one employee attaches the clamps to his nipples, small weights at the end resembling toy bells.\r\n\r\n\"How does that feel, kitty? Want us to put a cat tail butt plug in your ass?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697103, "type": "ic", "edited": "2018-03-12T04:51:59.129131", "format": null, "posted": "2018-03-12T04:51:59.129131", "text": "Ichi breathes heavily around the ball gag as the cock ring is put into place, the sound hitching as he feels the crop trace over his skin. There’s nothing he can do to stop from getting hit aside from begging which he even doubts that that would work the way he wanted it to. \r\n\r\nHe jerks as the clamps are applied to his nipples, already starting to have the bells jingle cheerfully with the movement. The Matsu vehemently shakes his head no at the thought of having a tail plug in his ass."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697282, "type": "ic", "edited": "2018-03-12T05:01:24.199064", "format": null, "posted": "2018-03-12T05:01:24.199064", "text": "\"Aw, come on. You'd look downright adorable.\" Ichimatsu's head shaking is futile as the worker grabs for a butt plug with a cat tail, along with lubricant. Spreading a dollop on it, he gently pushes it inside, giving his cheeks a smack afterwards.\r\n\r\nCat ears are next to follow, placed on his head as strikes from the crop are given repeatedly to his chest and lurk dangerously close to his cock.\r\n\r\n\"Such a pretty kitty...\" one sighs, playing with his plump ass. \"You're going to be a very popular attraction.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697363, "type": "ic", "edited": "2018-03-12T05:06:11.789341", "format": null, "posted": "2018-03-12T05:06:11.789341", "text": "Ichi mewls incessantly around the gag, squirming with what limited movement he has and pressing his face against the floor as the plug is inserted into his hole. It’s too big and flares inside of him to the point that pushing it out on his own is next to impossible with how tight his ass is. And his asscheeks jiggle when they’re slapped, sending another bout of squirming and chiming bells his way once the crop makes its appearance several times."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48704906, "type": "ic", "edited": "2018-03-12T19:49:34.484230", "format": null, "posted": "2018-03-12T19:49:34.484230", "text": "The workers are having the time of their lives as they torture Ichi, yanking and jingling the bell clamps as they smack his ass.\r\n\r\n\"Squirm all you want, kitten. You're never going to escape this place,\" one taunts as the crop smacks against his cock. \"You'll spend the rest of your pathetic life here, as a toy for others to play with.\"\r\n\r\nOne yanks on the leash, forcing Ichi's head up towards the ceiling.\r\n\r\n\"Don't worry, we'll take good care of you... we'll make sure you're trained and disciplined for any kind of rough treatment our clients will put you through. Just think of how you'll be in a few months. You'll be able to handle anything!\r\n\r\n\"Up next we'll see how well you can handle a cock in your mouth and ass. How's that sound, slut?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48708794, "type": "ic", "edited": "2018-03-13T00:05:42.041205", "format": null, "posted": "2018-03-13T00:05:42.041205", "text": "Ichi struggles against the chains. It’s futile, but he can’t just bring himself to except his fate as the bells continue to ring with each tug and pull. He yells through the gag, straining as the crop makes sharp contact cock - cementing his position as little more than a plaything. \r\n\r\nHe chokes a little as the collar is lifted, bringing up his gaze as he’s asked about having cocks in his mouth and ass."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48720695, "type": "ic", "edited": "2018-03-13T18:36:43.870232", "format": null, "posted": "2018-03-13T18:36:43.870232", "text": "The workers laugh as Ichi chokes, one undoing his ball gag to free his mouth. Any freedom is soon lost, however, once a ring gag is brought out moments later and brought closer to Ichi's mouth.\r\n\r\n\"Open up, kitty,\" the worker holding the gag says. \"That slutty mouth of yours is going to be taking all of our cocks.\"\r\n\r\nOne worker takes out the plug and smacks him on the ass, his cheeks jiggling with the contact. Then his nose is held, the ring gag getting closer as they wait for him to open up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48732631, "type": "ic", "edited": "2018-03-14T05:51:28.280810", "format": null, "posted": "2018-03-14T05:51:28.280810", "text": "Much as he’s loathe to admit it, Ichi had been hoping that having been plugged and gagged only moments before would earn him a break from any future torment. Ass stinging and unable to keep his mouth closed unless he wants to suffocate, Ichi is soon gasping for air and giving the man prime opportunity to lock the ring in place behind his teeth and pull the strap as tight as it can go."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48732797, "type": "ic", "edited": "2018-03-14T06:03:43.144670", "format": null, "posted": "2018-03-14T06:03:43.144670", "text": "With the gag in place, the workers laugh as the one in front starts to unzip his pants - revealing his erect cock in front of Ichi's face. There's not much time to prepare as he shoves it inside his mouth, thrusting as fast and hard as he can.\r\n\r\n\"Use your tongue, slut,\" he orders, gripping onto his hair and forcing his head up towards him. Meanwhile, another worker lubes up behind him, inching his way inside his ass before thrusting at a rhythmic pace.\r\n\r\nAll the while, the other workers cheer, patiently awaiting their own turns with the new pet."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48732861, "type": "ic", "edited": "2018-03-14T06:07:30.082057", "format": null, "posted": "2018-03-14T06:07:30.082057", "text": "Ichi’s eyes glaze over not long after he’s impaled between the two men. As ordered, he starts swiping his tongue along the underside of the man’s cock before focusing on the head - gagging when the thrusts are too deep for him to take but he’s unable to get a proper breath of air. The rhythm set by the cock in his ass doesn’t help matters either, thrusting opposite than the man using his other hole and sending him sliding headfirst deeper onto the man’s cock."}]