[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50835875, "type": "ooc", "edited": "2018-07-07T06:53:03.393613", "format": "raw", "posted": "2018-07-07T06:53:03.393613", "text": "It’d be one of the few times that he could move on his own but he wouldn’t be able to stand on his legs or do anything human"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835944, "type": "ooc", "edited": "2018-07-07T06:58:58.406457", "format": "raw", "posted": "2018-07-07T06:58:58.406457", "text": "(( delightfully devious and humiliating!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50837778, "type": "ooc", "edited": "2018-07-07T11:58:35.148608", "format": "raw", "posted": "2018-07-07T11:58:35.148608", "text": "Thanks!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50848925, "type": "ooc", "edited": "2018-07-08T03:38:14.189829", "format": "raw", "posted": "2018-07-08T03:38:14.189829", "text": "(( I'm willing to write the starter shortly after Jyushi's kidnapping"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50848939, "type": "ooc", "edited": "2018-07-08T03:38:41.864088", "format": "raw", "posted": "2018-07-08T03:38:41.864088", "text": "I think that would work great!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50851872, "type": "ic", "edited": "2018-07-08T05:50:35.048515", "format": "raw", "posted": "2018-07-08T05:50:35.048515", "text": "It wasn't unheard of for cults to kidnap innocent people for their beliefs. But a certain cult's beliefs were centered around kidnapping people for their pleasure, sexually tormenting them in many ways.\r\n\r\nRecently, a cult had surfaced in Japan that focused on extreme BDSM, determined to make people they saw unfit for society into slutty playthings. Jyushimatsu happened to be their target, since he was unemployed and wasn't looking for a job.\r\n\r\nThe cult has found him alone in a park at night when they nabbed him, tying him securely and gagging him before stuffing him into a bag and driving off.\r\n\r\nWhen they got to their hideout, the cult members carried their captive to their main room, where a group of them had gathered for a magic ceremony. Taking him out of the bag, they placed Jyushi on a table, looking up expectantly at their cult leader."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852009, "type": "ic", "edited": "2018-07-08T05:58:01.748765", "format": "raw", "posted": "2018-07-08T05:58:01.748765", "text": "Typically the streets around the Matsu household were relatively safe. It was a nice neighborhood that was within walking distance of a park. The crime rate was practically nonexistent - to the point where just about anyone having a hard time falling asleep could tucker themselves out with a midnight stroll without any worries other than accidentally locking themselves out. Which...is probably why it was the perfect area to target for any unsavory characters.\r\n\r\nBut Jyushi had to be the first. Kidnapped while he’d been idly swinging on the playground, trying to find the motivation to walk back home. It’s over before it begins really, him not being able to put up much of a fight before being tied up and gagged.\r\n\r\nThe NEET blinks hazily as he’s placed on the table, mentally recoiling as he comes face to face with the cult he’s only heard about on the news."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50998337, "type": "ic", "edited": "2018-07-16T05:37:22.793055", "format": "raw", "posted": "2018-07-16T05:37:22.793055", "text": "The cult members look over Jyushi's bound body, grimacing. They had kidnapped people unfit for society as a part of their practice, but not many NEETs had fallen into their hands. With Jyushi being so low on the social and economic ladder, the punishments they'd picked out were especially devious.\r\n\r\n\"Jyushimatsu Matsuno,\" the man in charge of the rituals speaks, his voice enunciating as clearly as possible. \"Our group has deemed you unworthy of society, therefore, you will be forced to serve us as a slave and plaything. Your first day of training begins now.\"\r\n\r\nHe looks down at his book, scanning over the chant as the other cult members use scissors to cut away Jyushi's clothes, leaving him completely naked. One of the members grabs for a pen, inscribing a symbol on his stomach. Once it's drawn on, the cult leader begins to chant, the spell meant to turn Jyushi into an immobile doll."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51398374, "type": "ic", "edited": "2018-08-07T03:47:52.118803", "format": "raw", "posted": "2018-08-07T03:47:52.118803", "text": "The whimper that escapes Jyushi’s throat is a pitiful sound. As anyone else would likely be in this situation, he’s absolutely terrified by the group surrounding him and stripping him of his clothes. There’s a huff of air around the gag that’s clearly a muffled bout of short, hysterical laughter when the pen touches his stomach - he couldn’t help that he was ticklish.\r\n\r\nHe wants to protest and put up more of a struggle than he has so far but once the chanting has died down the NEET finds himself unable to move. Sure, his mobility had been limited by the ropes used to secure him during the abduction but he’d still been able to squirm. But now, in his current state, Jyushi feels an odd sort of heaviness in his limbs. Not stiff in the slightest, but practically limp.\r\n\r\nHis eyes dart around wildly with fear. The feeling encompassing his entire body feels almost light...like it wouldn’t be that difficult to move him but he’s unable to go through the motions himself."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51398609, "type": "ic", "edited": "2018-08-07T03:57:00.426036", "format": "raw", "posted": "2018-08-07T03:57:00.426036", "text": "The group doesn't give Jyushi any time to adjust before molesting him. Hands explore his limp body as his eyes dart around the room, giving him light pinches and slaps. Then one of the cult members is touching and stroking his cock.\r\n\r\nTwo others play with his nipples, pulling and yanking to the best of their ability. The entire room has their eyes on Jyushi as he's tormented and his bonds are soon cut away, leaving behind his immobile, helpless body.\r\n\r\n\"Looks like this little slut is ticklish,\" the one stroking his cock snickers. \"I think we might have a spell for that...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51398958, "type": "ic", "edited": "2018-08-07T04:11:03.078068", "format": "raw", "posted": "2018-08-07T04:11:03.078068", "text": "Newly untied, Jyushi wants so badly to escape. Even knowing that he’s outnumbered and surely wouldn’t be able to make it, he’d be a complete waste of space if he didn’t even make the effort to try. But nothing happens. No matter how much energy he attempts to put into moving himself, he remains immobile on the table.\r\n\r\nNot even a twitch racks his body as the cult members begin to play with him as if he were an object rather than a flesh and blood human being. \r\n\r\nStill, he isn’t completely numbed by the spell. He feels the hand on his cock and the ones that start tormenting his nipples, illiciting a series of gargled noises from his throat as he tries and fails to speak."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51492066, "type": "ic", "edited": "2018-08-12T08:14:13.967434", "format": "raw", "posted": "2018-08-12T08:14:13.967434", "text": "The cult members snicker at Jyushi's attempts to speak. Their ministrations continue, getting rougher in an effort to hear more noises.\r\n\r\n\"Dolls can't talk, dummy,\" the one striking his cock taunts. \"You're just there to look pretty while we have our fun with you.\"\r\n\r\nHe dips his head down to kiss Jyushi's cock, soon taking it fully in his mouth. Meanwhile, the two playing with his nipples pause for a moment to attach nipple clamps to his buds. The yanking that comes afterwards is cruel and unforgiving to the NEET's poor nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51494253, "type": "ic", "edited": "2018-08-12T15:13:09.139710", "format": "raw", "posted": "2018-08-12T15:13:09.139710", "text": "Tears are soon to come for Jyushi, whose whimpers continue to grow louder and louder. They’re the only sounds he’s capable of now after what they’ve done to him. But they’re bordering on pleasure when the cult member starts sucking his cock. That’s not bad at all actually.\r\n\r\nJyushi is distracted from the act as soon as the clamps are applied to his nipples, the pleased whines turning into stuttering whimpers every time the two start to pull on them."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51563107, "type": "ic", "edited": "2018-08-16T05:43:44.311710", "format": "raw", "posted": "2018-08-16T05:43:44.311710", "text": "Hands and lips are all over Jyushi's body as he cries and whines. It's clear the cult is having a grand time torturing the poor NEET, reveling in his tears and pitiful whimpers.\r\n\r\n\"Poor little doll,\" one of the cult members taunts as he strokes his cheek. \"I hope you're prepared to be our little toy for the rest of your life, Jyushimatsu.\"\r\n\r\nHe leans down to plant a kiss on his cheek. All the while, Jyushi's body is constantly molested, his cock deepthroated by the man paying attention to that part of his body."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51606398, "type": "ic", "edited": "2018-08-19T01:46:58.364322", "format": "raw", "posted": "2018-08-19T01:46:58.364322", "text": "Jyushi feels his cock flush with warmth as the cultist continues to deepthroat him. In any other circumstance he would have welcomed the attention. As is, it feels more like a violation when he can’t do anything to stop it. He can’t move or even speak with the spell put on him, and judging by the conversation earlier they weren’t finished with him yet.\r\n\r\nHe whimpers pitifully, eyes moving to glance over the cultists surrounding him - trying to find any mercy from them at all."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51606637, "type": "ic", "edited": "2018-08-19T01:59:31.232243", "format": "raw", "posted": "2018-08-19T01:59:31.232243", "text": "If Jyushi was looking for mercy, he wasn't going to find any among the cultists. The members surrounding him all have a sadistic glint in their eyes, eager for their turn with the new slave.\r\n\r\n\"You're so sensitive, Jyushimatsu,\" one playing with his nipples teases. \"You're a virgin, right? With you being a pathetic NEET, that's not a surprise.\"\r\n\r\n\"The spell will wear off in about five hours, but we can always extend it or just bind you up so you can't escape.\"\r\n\r\nAfter a final yank, Jyushi's clamps are taken off before two cultists begin to lick and suck at his nipples.\r\n\r\n\"After this, we have lots in store for you, so try not to break just yet, got it?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52242663, "type": "ic", "edited": "2018-09-26T00:03:52.136895", "format": "raw", "posted": "2018-09-26T00:03:52.136895", "text": "Jyushi doesn’t know why he isn’t surprised that the cult knows that he’s a virgin. But it doesn’t seem like much of a stretch when they already knew his name. It probably wouldn’t take much research after that to figure out that no one was tripping over themselves any time soon to get into his bed. \r\n\r\nFive hours without any control over his body sounds like torture. He doesn’t have enough mobility to try and play defensive. He’s completely open and helpless to the cult’s advances.\r\n\r\nEvidenced further by the fact that the only thing he can do when the clamps are pulled off is release a gargled scream and whimper when the devices are quickly replaced with two sets of mouths to provide his aching nipples even more attention."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52247769, "type": "ic", "edited": "2018-09-26T04:24:27.440895", "format": "raw", "posted": "2018-09-26T04:24:27.440895", "text": "The cultists' mouths lick and suck Jyushi's nipples to the best of their ability, desperate to hear their new doll's helpless whimpers and whines.\r\n\r\n\"That ass is just begging for a toy to go inside it,\" one of the cultists says, the other members hollering in agreement. It doesn't take long for a vibrator to get passed around, eventually landing in the hands of a cultist near Jyushi. When he's handed a bottle of lube, he works quickly to apply it as another cult member forces his legs open. Slowly sliding inside, the toy fills Jyushi before it's turned on.\r\n\r\nWave after wave of intense vibrations are sent through the toy, rubbing and buzzing against Jyushi's anal walls. Meanwhile, his sore nipples are still stimulated by the hot, wet tongues of the two cultists working on his chest."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52258900, "type": "ic", "edited": "2018-09-26T23:25:57.524245", "format": "raw", "posted": "2018-09-26T23:25:57.524245", "text": "Jyushi whines pitifully. He’s in no control of any part of his body and it only adds to the humiliation. There’s nothing he can do to even remotely try and put a stop to what can only be the beginning of his training as a sex slave. His body only obeys when it’s in control of one of the cultists, carefully maneuvered into whatever position they want.\r\n\r\nLegs spread and left vulnerable to the vibrator that’s slid into his ass.\r\n\r\nHis chest rises with quick, panting breaths as the sensation overwhelms him within the first minute."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52263926, "type": "ic", "edited": "2018-09-27T03:42:14.213199", "format": "raw", "posted": "2018-09-27T03:42:14.213199", "text": "As Jyushi breathes heavily with the vibrator buzzing inside him, the cultists devise schemes among themselves, potential punishments being thrown around the crowd. The NEET's suffering is more like a game to them, with the goal being how far they're willing to take the torture. Spells regarding breathplay, electro-stimulation, and several others can be heard among the ideas.\r\n\r\nAs the two cultists tease Jyushi's nipples with their mouths, the group passes a marker to the man handling the vibrator, inscribing another symbol on his ass. Then the chanting starts once the cult leader flips open to the correct page.\r\n\r\nWhen it dies down, a latex substance crawls up Jyushi's body, the material molding with his form like a second skin.\r\n\r\n\"Let's see how you like being a latex doll,\" one of the cultists snickers."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52264250, "type": "ic", "edited": "2018-09-27T03:59:36.630244", "format": "raw", "posted": "2018-09-27T03:59:36.630244", "text": "Listening in horror, Jyushi can do nothing to voice his objections. Though he tries to start a mantra in his head to plead against some of the suggested spells when the vibrator doesn’t jolt him in a particular area and leave his head fuzzy with pleasure. \r\n\r\nHe’s too distracted to even catch what spell the cultists finally decide on - though it dawns on him the second latex starts creeping over his skin. It coats the NEET from head to toe, fitting perfectly to him - to the point that it would be hard to tell that the substance was latex at all save for the color. \r\n\r\nHis sight is cut off completely, hearing muffled as the spell takes its full effect and seals him in."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52264836, "type": "ic", "edited": "2018-09-27T04:35:59.957292", "format": "raw", "posted": "2018-09-27T04:35:59.957292", "text": "The cultists watch in anticipation as the latex completely covers Jyushi, practically merging with his immobile form. His nipples and asshole are still revealed to the group, his cock sealed tight under the rubbery material.\r\n\r\n\"Let's leave this little slut alone for a bit,\" one cultist suggests as he rubs at his bulge. The others agree as they place him inside a glass container, his body on display for anyone to admire. Even if the immobility spell wore off, there'd be no way for Jyushi to get out of his rubbery prison no matter how much he thrashed and whined.\r\n\r\nThey position his arms behind his back, an armbinder forming and connecting to the latex. The vibrator still buzzes inside him, stimulating him with no way to orgasm."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52265006, "type": "ic", "edited": "2018-09-27T04:49:37.901378", "format": "raw", "posted": "2018-09-27T04:49:37.901378", "text": "Experiencing captivity without his sight is more terrifying than Jyushi thought it would be. Not that he had a reliable comparison, but he wasn’t aware of how quickly his heat beat could skyrocket when he can’t see where or when he’ll be touched. And there’s no visible reaction either. Jyushi doesn’t jolt or jerk away from contact, can’t in his current state. \r\n\r\nHe’s on full alert when a hand strokes his covered bulge, even more so when more hands touch other parts of his body and he can feel himself being moved. Jyushi is completely unaware of his new environment - though he pieces together that he’s standing, arms pulled taunt behind his back and held there by his latex prison.\r\n\r\nHis whimpers come back full force once he’s left to his own devices in the display case. There’s no escaping the vibrator in his ass - he just has to take it."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52287819, "type": "ic", "edited": "2018-09-28T18:29:33.190356", "format": "raw", "posted": "2018-09-28T18:29:33.190356", "text": "Pleased with their work, the cultists leave Jyushi on display for a few hours while they think of other ways to torture him. Every once in a while, a cult member passes by to admire how helpless Jyushi is in the latex suit, the skin-tight material preventing him from cumming at the hands of the vibrator.\r\n\r\nA rubber doll, once living as a human, is now completely immobile and isolated from the world around it. Its only purpose now is to be used as a sex object and decoration.\r\n\r\nFive hours pass with Jyushi in the display case, the immobility spell gradually wearing off. With it being so late at night, many of the cultists have gone to bed, only a few lingering around the room where Jyushi is kept."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52289708, "type": "ic", "edited": "2018-09-28T21:19:53.456670", "format": "raw", "posted": "2018-09-28T21:19:53.456670", "text": "It takes less than an hour for Jyushi’s spirit to break. The vibrator is his only constant, and it’s merciless - trapped in his ass by his new latex skin. There’s no release and no squirming to distance himself from the buzzing. If he were capable of any sound it would be near incomprehensible at two hours in as his bulge strains against the latex. Three hours in and Jyushi can feel his eyes rolling back with the never ending vibrations, breath coming in thready gasps. When four finally rolls around, the captive NEET is sweat soaked inside the latex and still just one the edge of desperate.\r\n\r\nThe immobility spell wearing off goes almost unnoticed at first. Jyushi has become accustomed to his position and the lack of movement on his part almost makes the vibrator bearable. Almost. It isn’t until his body can no longer hold the stance that he actually notices that he can move again. Possibly in the worst way.\r\n\r\nJyushi’s knees are the first to give out, dropping into a kneeling position with his head dropping to the bottom of the display case soon after. It jostles the vibrator, sending a cruel buzz right to his spine, and causing Jyushi to release a loud keen."}]