[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52294367, "type": "ic", "edited": "2018-09-29T02:44:15.035850", "format": "raw", "posted": "2018-09-29T02:44:15.035850", "text": "The captors that are still awake notice Jyushi's movements almost immediately. Instead of reapplying the spell, they settle on a new plan to let the NEET suffer in a different way.\r\n\r\nRemoving him from the glass case and turning off the vibe, the cultists allow the latex substance to disperse near his stomach. The material peels back to reveal Jyushi's skin, a sheen of sweat coating it from the several hours spent in the latex.\r\n\r\nHands run over Jyushi's torso before a cultist presses a marker against his skin, scribbling a sigil from the spell book as the others watch in anticipation.\r\n\r\n\"This little slut was ticklish before, wasn't he?\" The cult member muses as he finishes inscribing. \"This spell will keep his muscles working for a few hours so he can stay nice and fit for further training.\"\r\n\r\nThe cultists recite the chant, and when they finish, an odd, feathery sensation runs over Jyushi's entire body."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52297516, "type": "ic", "edited": "2018-09-29T06:38:37.477949", "format": "raw", "posted": "2018-09-29T06:38:37.477949", "text": "Jyushi’s entire body stiffens from its relaxed state the second that he feels the feathery sensation. The first one catches him off guard but the next series have him squirming in small bursts - muffled laughter coming from under the latex interspersed with sharp intakes of breath.\r\n\r\nThe poor NEET doesn’t become accustomed to the light tickling in the same way as he had the vibrator - and a small part of him has trouble figuring which of the two treatments is the worst."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52304902, "type": "ic", "edited": "2018-09-29T22:14:10.108659", "format": "raw", "posted": "2018-09-29T22:14:10.108659", "text": "Jyushi's tickling spell intensifies within minutes, the growing sensation particularly cruel on his trapped bulge and nipples. The cult revels in his squirming and sharp, desperate breaths for air - the latter cut off when the holes for Jyushi's nostrils grow smaller and disappear.\r\n\r\nWith their toy left without any way to breathe, the cult starts to rub at his bulge and newly exposed nipples. Meanwhile, the tickling sensation only grows, as if feathers are dancing over Jyushi's whole body.\r\n\r\nSeconds pass before Jyushi is allowed to breathe again, holes once again opening around his nostrils."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52311413, "type": "ic", "edited": "2018-09-30T04:09:09.367052", "format": "raw", "posted": "2018-09-30T04:09:09.367052", "text": "When the tickling reaches his trapped cock, Jyushi whines pitifully. His member strains against the latex skin - becoming unbearably hard after just coming down from the erection the vibrator had given him. It’s an uncomfortable sensation that he briefly notices before it’s lost in the muffled laughter again. The same can be said for his exposed nipples. \r\n\r\nHe’s in the middle of one of his breathing fits when the air holes disappear from the suit. Panic offsets the laughter and turns it into hysterical bursts - his cheeks wet with tears. \r\n\r\nThey only come back in the same instance that his head starts to feel fuzzy and faint and he tries his best to inhale as deeply as he can without losing precious air to laughing or hyperventilating."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52312210, "type": "ic", "edited": "2018-09-30T04:45:37.031118", "format": "raw", "posted": "2018-09-30T04:45:37.031118", "text": "Jyushi's hysterical sobbing only serves to make the sadistic cult more aroused. They plan to leave him like this for two hours, with his air supply cut off from time to time while his body is teased mercilessly by the spell.\r\n\r\n\"He must be going crazy in there,\" one of them remarks as he pinches Jyushi's nipples. \"I think he'll be nice and tuckered out once the spell wears off.\"\r\n\r\n\"To be trained properly, slaves need to rest.\" Another cultist says as he rubs his bulge. \"We'll wake him up tomorrow sometime after he's passed out.\"\r\n\r\nAfter spending more time teasing their new doll, the remaining cult members head off to bed, leaving Jyushi to suffer at the hands of the spell."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52312402, "type": "ic", "edited": "2018-09-30T04:53:32.419037", "format": "raw", "posted": "2018-09-30T04:53:32.419037", "text": "The NEET’s entire body shakes from within his new latex suit. It takes little time before all the laughing becomes downright painful. And with his air supply still being cut off for shot periods of time he doesn’t get any reprieve from the torture until the inevitable happens. \r\n\r\nHe passes out even before the tickling spell wears off, drifting in and out of consciousness every time the nose holes disappear and leave him to jerk helplessly throughout the night."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52345398, "type": "ic", "edited": "2018-10-02T05:17:05.827688", "format": "raw", "posted": "2018-10-02T05:17:05.827688", "text": "While Jyushi had been mercilessly tortured for the night, the cult slept soundly in nice warm beds - a privilege that the NEET won't be experiencing ever again if his captors have anything to say about it. And when morning comes, the cult eats their breakfast, discussing Jyushi's torture as if it was a friendly Thanksgiving dinner topic.\r\n\r\n\"He was squirming like a pathetic worm,\" one of the cultists says as he recounts last night's events. \"Laughing like a maniac, too... it was a fun sight.\"\r\n\r\nWhen the cult is done with their meal, they scoop up some untouched food and put them in a dog bowl for Jyushi. The latex peels back to reveal his mouth as he's lowered toward the ground, the cult members in charge of him shoving his face towards the bowl.\r\n\r\n\"Come on, eat up. We don't have all day.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52369129, "type": "ic", "edited": "2018-10-04T00:19:32.069418", "format": "raw", "posted": "2018-10-04T00:19:32.069418", "text": "Exhaustion eventually got to Jyushi, passing out in the early hours of the morning. When he wakes shortly after the cultists come down for breakfast - not even that long since he passed out in the first place. If this treatment continued for the rest of his captivity he’d break through sleep deprivation alone.\r\n\r\nJyushi is quiet during breakfast, nice and calm now that the spell had worn off and he’s left alone to listen to the muffled conversation. \r\n\r\nIt nearly catches him off guard when the latex around his mouth disappears - though the reasoning becomes clear when he’s shoved into...a bowl. A dog bowl! Embarrassing, but thankfully full of food scraps. He can’t bring himself to use the new freedom to beg for his freedom when he’s hungry. So instead, he eats."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52372745, "type": "ic", "edited": "2018-10-04T03:49:22.436265", "format": "raw", "posted": "2018-10-04T03:49:22.436265", "text": "Most of the cult watches on as Jyushi eats the food scraps from the dog bowl, laughing at his expense. Being left alone to squirm all night must have taken its toll on their pet, because he doesn't say a word of protest as he eats up his breakfast.\r\n\r\nWhen he's finished eating, the cultists yank him up by his mask and take a moment to appreciate his helpless form. Entire body covered by latex, save for his mouth. His cock a useless bulge underneath. Blind at the moment, and nearly deaf.\r\n\r\nCompletely at their mercy.\r\n\r\nThe latex peels back to allow him to see, the cult eager to see his expression before it's hidden again. Many of them even already have their cocks out, aiming it at Jyushi's mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52372874, "type": "ic", "edited": "2018-10-04T03:54:35.351128", "format": "raw", "posted": "2018-10-04T03:54:35.351128", "text": "Jyushi grimaces at the sudden influx of light. Being left in the dark for so long he was already becoming accustomed to the lack of light and when the latex shrinks back he can’t help but squint as he tries to focus and make the world not as blurry as it currently is.\r\n\r\nSomething he immediately regrets when the first thing he sees are the cultists’ cocks aimed at his face. \r\n\r\nHe whimpers pathetically, eyes wide with fear and surprise. He was going to have to endure another day of being the group’s plaything."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52435711, "type": "ic", "edited": "2018-10-08T05:39:27.473671", "format": "raw", "posted": "2018-10-08T05:39:27.473671", "text": "Jyushi's pitiful expression only arouses the cult further as they stroke their cocks in front of his face. It isn't long before cum decorates Jyushi, threads of the sticky substance landing in his mouth and all over his face. The one holding up Jyushi by his mask even licks some of it off in an attempt to further humiliate him.\r\n\r\n\"As for today's schedule...\" the cult leader announces as he steps up in front of Jyushi. \"I have a few ideas.\"\r\n\r\nThe cult listens attentively and waits for their leader to voice his plans, and when he does, the room soon erupts into cheers and applause.\r\n\r\n\"How about we take this pup out for a walk?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52450129, "type": "ic", "edited": "2018-10-09T04:00:34.824536", "format": "raw", "posted": "2018-10-09T04:00:34.824536", "text": "Jyushi cringes in the exact moment that the group of cultists release their loads. He didn’t need to be sexually experienced to know that it was bad enough how much of their cum landed in his mouth to begin with. And he squirms even more when the man holding him swipes his tongue along his face. \r\n\r\nHe can only watch as the men discuss their plans for him today, wondering what humiliation he’d have to be subjected to.\r\n\r\nA walk.\r\n\r\nOh no. That meant being around people. Jyushi whimpers and whines at the thought."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52467504, "type": "ic", "edited": "2018-10-10T06:02:30.935371", "format": "raw", "posted": "2018-10-10T06:02:30.935371", "text": "The cult snickers at Jyushi's whining, clearly pleased with themselves. Lots of things need to be prepared for, which the group discusses loudly enough for Jyushi to hear. One spell in particular would be fitting for the situation and it isn't long before the cult scribbles the sigil on his thigh as the latex momentarily peels back.\r\n\r\nChanting fills the room once more, and when it dies down, the spell almost immediately takes effect.\r\n\r\nThe spell in question is meant to make Jyushi act like a puppy, only able to whine and walk on all fours. Not that the latex gives him any choice as it forces Jyushi's limbs together, hands pressed against his shoulders and feet framing his ass.\r\n\r\nThe cult places him on the ground, elbows and knees touching the floor in a humiliating spectacle. Then the latex forms a mask on his face, the features dog-like as it molds floppy ears and a canine snout.\r\n\r\n\"Crawl around for us, pup,\" one man says before smacking his ass. \"We'll have to see how many tricks you can do...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52491712, "type": "ic", "edited": "2018-10-12T00:26:30.641846", "format": "raw", "posted": "2018-10-12T00:26:30.641846", "text": "Jyushi, quick on the uptake, is starting to hate every moment that his skin is bared to the cultists. It almost always ended with a new spell being cast and being thrust into a new, humiliating situation. But then...then he doesn’t care at all as this particular spell begins to alter how he thinks and acts.\r\n\r\nHe whines like a puppy as the latex reshapes itself to give him a better form to match his new purpose, yipping excitedly when he’s placed on the floor. \r\n\r\nHe cocks his head to the side just as the mask adds its final touches, sliding forward on his elbows and wiggling his ass playfully before launching himself into a quick crawl."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52541229, "type": "ic", "edited": "2018-10-15T03:25:29.679572", "format": "raw", "posted": "2018-10-15T03:24:26.951251", "text": "The cult laughs as the spell takes effect, soon attaching a collar around his neck with its own name tag - \"Puppy Slut\".\r\n\r\n\"What a playful little pup,\" one snickers as he attaches a leash to the collar. \"I'll bet you're excited to go for a walk, huh? We might even give you a special treat if you're a good boy.\"\r\n\r\nHe gives him a pat on the head before tugging on the leash towards the door. The rest of the cult watches eagerly as they urge him forward with smacks to his ass."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52541260, "type": "ooc", "edited": "2018-10-15T03:26:05.512673", "format": "raw", "posted": "2018-10-15T03:26:05.512673", "text": "(( I have a few prompt ideas for Halloween if you're interested"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52542111, "type": "ooc", "edited": "2018-10-15T04:00:30.639558", "format": "raw", "posted": "2018-10-15T04:00:30.639558", "text": "Oh yeah! Tell me about them!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52542284, "type": "ooc", "edited": "2018-10-15T04:08:21.295356", "format": "raw", "posted": "2018-10-15T04:08:21.295356", "text": "(( sure!\r\n\r\n1. A Matsu gets kidnapped by a drider clan, wrapped up in a silk cocoon and kept as a live toy\r\n2. The Matsus go on vacation to an island, soon learning that it's inhabited by horny monster girls\r\n3. A Matsu gets trapped in a mummy's sarcophagus, sealed away for incredibly long periods of time and kept healthy with magic. Sometimes he's taken out to be played with, but he's mostly used as a decoration.\r\n4. A Matsu gets trapped in a haunted house and is toyed with by monsters.\r\n5. A Matsu explores a cave and gets kidnapped by a tentacle monster."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52542708, "type": "ooc", "edited": "2018-10-15T04:27:35.987647", "format": "raw", "posted": "2018-10-15T04:27:35.987647", "text": "Ooh those are pretty great"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52542966, "type": "ooc", "edited": "2018-10-15T04:39:34.772911", "format": "raw", "posted": "2018-10-15T04:39:34.772911", "text": "(( glad you like them!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52542998, "type": "ooc", "edited": "2018-10-15T04:41:02.529814", "format": "raw", "posted": "2018-10-15T04:41:02.529814", "text": "I think the haunted house would be really fun and in spirit"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52543079, "type": "ooc", "edited": "2018-10-15T04:44:47.931963", "format": "raw", "posted": "2018-10-15T04:44:47.931963", "text": "(( I totally agree!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52543147, "type": "ooc", "edited": "2018-10-15T04:48:06.084849", "format": "raw", "posted": "2018-10-15T04:48:06.084849", "text": "Would you want to start the chat on that one and we can flesh out of ideas while I work on my reply for this one?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52543491, "type": "ooc", "edited": "2018-10-15T05:04:43.238469", "format": "raw", "posted": "2018-10-15T05:04:43.238469", "text": "(( sure! I'll post something in the directory"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52543515, "type": "ooc", "edited": "2018-10-15T05:05:57.533662", "format": "raw", "posted": "2018-10-15T05:05:57.533662", "text": "(( it's up!"}]