[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52545302, "type": "ic", "edited": "2018-10-15T06:51:27.290413", "format": "raw", "posted": "2018-10-15T06:51:27.290413", "text": "The idea of going for a walk, something Jyushi initially dreaded, now sends a jolt of excitement through the newly dubbed “Puppy Slut”. He’s much easier to handle this way, though he does squirm and wiggle playfully - blindly dodging the collar’s application before settling down and yipping excitedly through the rubber.\r\n\r\nHe’s just as wiggly when the leash is added even though he tries to stay obediently still. There’s been talk of walks and treats and Jyushi can’t even begin to think of how it could possibly get any better.\r\n\r\nHe bounds forward when he feels a tug on the leash, blindly navigating his way to the door otherwise and occasionally stopping to press his rubber snout to the floor in an effort to sniff anything interesting before he’s urged on by swats to his ass."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52561655, "type": "ic", "edited": "2018-10-16T04:31:44.599364", "format": "raw", "posted": "2018-10-16T04:31:44.599364", "text": "Jyushi's eagerness is definitely a change in attitude that the group finds endearing. While they loved the muffled pleading to stop during last night's torment, seeing him act like this is a fun change of pace.\r\n\r\nLeading him out the door and into the outside world, the cult is hit with a cold gust of wind. It's a tad chilly, but nothing too extreme for a walk.\r\n\r\nThey soon reach a park, where many passerby have their attention on the rubber pup. Nobody seems too shocked, given that it's a man in a bitchsuit and not an actual dog.\r\n\r\nEven then, Jyushi is given a lot of attention, receiving belly and bulge rubs as he's laid on his back."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52562149, "type": "ic", "edited": "2018-10-16T05:01:02.437660", "format": "raw", "posted": "2018-10-16T05:01:02.437660", "text": "Jyushi is ecstatic to be out and about - certainly an effect of the spell since being seen in such a state would otherwise have him flushing in embarrassment. But as of the moment he was a puppy, and a good one at that. He didn’t really have to be tugged along by the leash, even occasionally having to slow down and wait for the cultist holding the leash to catch up instead. He’s genuinely excited about the walk and the feeling increases the further they go.\r\n\r\nAnd when sidewalk is replaced by soft grass he almost immediately figures that they’ve arrived at a park. The perfect environment for a playful pup like himself.\r\n\r\nThe enchanted NEET is cheerful to a fault when he feels hands on his bitchsuit, leaning into the petting before abruptly moving away and trying to start a game of chase. He whines when he’s placed on his back but it doesn’t take long before the belly rubs and attention to his bulge have his limbs flailing."}]