[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54544504, "type": "ic", "edited": "2019-02-06T06:34:42.144964", "format": "raw", "posted": "2019-02-06T06:34:42.144925", "text": "Valentines Day Puppy"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54544505, "type": "ooc", "edited": "2019-02-06T06:34:59.931591", "format": "raw", "posted": "2019-02-06T06:34:59.931591", "text": "(( hey there!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54544521, "type": "ic", "edited": "2019-02-06T06:35:49.645898", "format": "raw", "posted": "2019-02-06T06:35:49.645898", "text": "Hi!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54544528, "type": "ooc", "edited": "2019-02-06T06:36:47.522918", "format": "raw", "posted": "2019-02-06T06:36:47.522918", "text": "(( would you be okay with writing a starter? maybe Totty is already wrapped up and was left on the person's doorstep?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54544536, "type": "ooc", "edited": "2019-02-06T06:37:21.574473", "format": "raw", "posted": "2019-02-06T06:37:21.574473", "text": "On it! Looks like we’ll be focusing on this and zoo for the time being"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54544540, "type": "ooc", "edited": "2019-02-06T06:37:34.409901", "format": "raw", "posted": "2019-02-06T06:37:34.409901", "text": "(( alright!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54544665, "type": "ic", "edited": "2019-02-06T06:47:43.378201", "format": "raw", "posted": "2019-02-06T06:47:43.378201", "text": "He can’t move. That’s the first thing that Totty notices when he wakes up. Or at least he thinks he wakes up, it’s hard to tell when he can’t see or hear anything - even trying to rock himself back and forth doesn’t seem to do anything. What the Hell had happened to him? Totty strains to think and fill in the gaps in his memory. \r\n\r\nHe remembered it being the day before Valentine’s Day and hitting up the bars in search of some company...nothing off about that. Then someone had approached him and said he was an absolute gift and Totty preened at the compliment, choosing to stick around and try his luck. Now he just felt...stuck. \r\n\r\nAnd on the outside it’s easy to see why. Red gift wrap with white hearts enveloped a long box that contained Totty, taped heavily shut and made to seem like an overly large chest for odds and ends. A particular observant person would notice the false bottom - underneath which held Totty in even more obscure layers. \r\n\r\nTotty tries to scream when he finds that he can’t move, but the sound is stopped completely by a massive dildo cinched tightly so that the tip touched the back of his throat and caused him to gag. Unbeknownst to him that the final layer was a bubblegum pink bitchsuit and the dildo gag actually formed a dog about with the part not shoved down his throat. A similar tail plug was lodged into his ass and while he couldn’t tell it yet, there was an extremely tight cock ring contracted around his member."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54544817, "type": "ic", "edited": "2019-02-06T07:01:26.144565", "format": "raw", "posted": "2019-02-06T07:01:26.144565", "text": "Rika had told her boyfriend Seiji time and time again what she wanted for Valentine's Day. Jewelry, money, but most of all, a puppy. So when she received a text from him to open her front door, she expected to find him standing there, a necklace in one hand and a puppy in another.\r\n\r\nInstead, she found a large box. Heavily taped shut, Rika was confused. Was this a prank of some sort? Seiji occasionally pulled them, but surely he wouldn't joke about a gift on Valentine's Day, right?\r\n\r\nDeciding to take a chance, Rika dragged the box inside, surprised at how heavy it was. With enough effort, she managed to bring it inside far enough. Now came the hardest part - tearing the tape off. Thankfully, she had a pair of scissors nearby, which she used to snip open the insane amount of layers. After several minutes of cutting tape, she opened it.\r\n\r\nSnug inside the box was an oddly shaped gift. Rika smiled at the hearts on the wrapping paper as she tore it off. Her smile soon faltered, however, when she found what she could only assume to be a footrest.\r\n\r\nThis was the best Seiji could do? Whatever. In any case, she might as well use it. Picking it up gently, she rests it on the floor in front of the couch before resting her feet on the top."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54544856, "type": "ic", "edited": "2019-02-06T07:05:37.725033", "format": "raw", "posted": "2019-02-06T07:05:37.725033", "text": "There have to be dozens more layers between him and outside world because Totty doesn’t even have a clue when he’s picked up or when Rika started using him as a footrest.\r\n\r\nThe current outside layer was a soft but incredibly tight material that pressed all the other layers in. Totty isn’t even recognizable as a human being the way he is now."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54550025, "type": "ic", "edited": "2019-02-06T19:45:43.719670", "format": "raw", "posted": "2019-02-06T19:45:43.719670", "text": "Rika watches TV for a few hours as Totty is trapped in the dark underneath her feet. She's completely unaware that a living, breathing human is below her, absolutely no movement or noise able to escape past the layers. Seiji had carefully wrapped Totty in well over fifty layers, including plastic wrap, tape, and extremely tight latex. He had a blast putting him together, knowing that when he woke up he'd be unable to twitch or even scream for help. Totty is practically a doll, trapped in the tightest confines in a state of complete isolation.\r\n\r\nWhen Rika heads off to bed, she thinks nothing of the footrest in the front room as it sits in front of the couch. What an odd gift, she thinks as she dozes off to sleep. Seiji would visit her in a few days, as he was currently out of town. He's unaware that the kidnapped puppy is still wrapped up tight in every single layer and unable to do anything."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54550234, "type": "ic", "edited": "2019-02-06T20:03:00.071131", "format": "raw", "posted": "2019-02-06T20:03:00.071131", "text": "Totty has no way of telling how much time has passed since he lost consciousness and woke up blind and deaf, unable to move a single inch. It was easy to overheat under the dozens of layers and pass out, losing several hours. He didn’t even have a clue that he was no where near the bar he’d met Seiji at or that he’d been passed along as a gift to his girlfriend.\r\n\r\nThe worst part is yet to come as the gag, plug, and even the cock ring begin to vibrate and torment the poor puppy on a random setting - likely something for Rika to enjoy watching him squirm if she’d completely unwrapped her present. As is, it’s just a miserable experience as he can’t even move an inch to distance himself, whining and whimpering around the vibrating gag."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54551676, "type": "ic", "edited": "2019-02-06T21:40:51.726418", "format": "raw", "posted": "2019-02-06T21:40:51.726418", "text": "The vibrating and whining is inaudible as the night passes by, Rika getting a good night's sleep as Totty suffers. Most of the next day passes without much fanfare, Rika too busy to use her \"footrest\" as she spends most of the day working. When she comes home later that night, Seiji is waiting for her on her doorstep,\r\n\r\n\"You liking the gift, Rika?\" He asks with a smile as he steps aside.\r\n\r\n\"What, you mean the weird looking footrest?\" She scoffs as she unlocks the door. \"I mean... couldn't you have picked something I asked for?\"\r\n\r\n\"Footrest? What are you-\" Seiji's pondering interrupt him as she opens the door, allowing him to see Totty still wrapped up.\r\n\r\n\"That's... not a footrest, Rika,\" He says with a small chuckle as they both step inside. \"It's still in it's original wrapping.\"\r\n\r\n\"Really? Well, in that case...\" Rika starts as she approaches Totty. \"Let's open it together.\"\r\n\r\nThe couple spends the next few hours taking off layer after layer. Rika can't help but be bewildered with each layer that covers her gift, asking Seiji if the next layer will be the last. After nearly four and a half hours of unwrapping, Totty is finally uncovered, bubblegum pink bitchsuit visible along with his plug and snout."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54555493, "type": "ic", "edited": "2019-02-07T01:09:11.333275", "format": "raw", "posted": "2019-02-07T01:09:11.333275", "text": "Being wrapped up for so long does wonders for Totty’s attitude. In the beginning he’s irritated and annoyed, getting more and more angry before he just started to worry. He had no idea where he was or if he’d ever be able to move again. And once the two start to unwrap him, his whining and crying become louder and louder.\r\n\r\nStill blinded by the bitchsuit’s hood with floppy ears, Totty has no ideas who his “rescuers” are - or even that one was the guy that put him into the suit to begin with. And once he’s finally revealed, Totty is wriggling happily and whining now that he finally had some movement back."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54592090, "type": "ic", "edited": "2019-02-09T02:14:55.072998", "format": "raw", "posted": "2019-02-09T02:14:55.072998", "text": "Rika's face lights up when every layer is unwrapped - beaming even more when Totty starts to wiggle and whine. The gift wasn't a footrest after all. It was a precious puppy, one that would provide loads of entertainment to the couple. Rika isn't bothered by the fact that it's a man trapped in a bitchsuit, in fact it pleases her more than if it were a real dog.\r\n\r\n\"What a cutie!\" She coos as she rubs the ears of the hood. \"I'm sorry that I forgot to unwrap him... poor little thing must have been terrified.\"\r\n\r\nThe idea of Totty being isolated and immobile for so long secretly arouses Rika, but now she's more focused on wanting to play with her new pup.\r\n\r\n\"Well, if he's not a good boy, we can always put him back in those layers for a day as punishment,\" Seiji laughs as he gives Totty's ass a smack. \"Anyway, how about we take him for a walk? Gotta make sure he can move correctly.\"\r\n\r\nSeiji attaches a leash to his collar labeled \"Slut Puppy\" before tugging him outside, walking hand-in-hand with Rika as he leads the new toy along the sidewalk."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 54598433, "type": "ic", "edited": "2019-02-09T10:40:30.511504", "format": "raw", "posted": "2019-02-09T10:40:30.511504", "text": "Totty moves as much as he’s able in the bitchsuit. He’d prefer being less confined than this but at least like this he’s able to move. He can feel the hands on the suit now and he wiggles his rear excitedly - tail wagging and causing the plug to move ever so slightly.\r\n\r\nAnd he honestly can’t bring himself to care. Underneath the hood he’s practically sobbing, nuzzling his snout into Rika gently and rubbing up against her. If he couldn’t get out of this, he would at least make sure that he stayed this mobile and made them happy.\r\n\r\nHe lets out a shrill bark when Seiji slaps his ass, scuttling back as fast as he can and sliding his elbows across the floor until he’s in a more playful position. He makes a fun game out of blindly dodging the collar and leash, proving that he was moving correctly by loping around the apartment’s living room a few times before yipping and coming to a halt for the collar to actually be put on. \r\n\r\nWalking feels nice too, Totty’s so excited to be up and about that he isn’t even dragged along, nearly pulling Seiji forward with how quickly he adapts to moving on all fours."}]