[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55073949, "type": "ic", "edited": "2019-03-08T06:08:51.038544", "format": "raw", "posted": "2019-03-08T06:08:51.038518", "text": "VR time!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55073952, "type": "ooc", "edited": "2019-03-08T06:08:57.827544", "format": "raw", "posted": "2019-03-08T06:08:57.827544", "text": "VR time!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55073957, "type": "ooc", "edited": "2019-03-08T06:09:14.428611", "format": "raw", "posted": "2019-03-08T06:09:14.428611", "text": "(( hey there! would you be okay with starting off?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55073965, "type": "ooc", "edited": "2019-03-08T06:09:49.359448", "format": "raw", "posted": "2019-03-08T06:09:49.359448", "text": "I could try? I know a little less about this one but I can go for it"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55073974, "type": "ooc", "edited": "2019-03-08T06:10:31.632121", "format": "raw", "posted": "2019-03-08T06:10:31.632121", "text": "(( nah it's alright! i'll write the starter in that case. It shouldn't be too hard for me to set up"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55074070, "type": "ooc", "edited": "2019-03-08T06:16:25.923371", "format": "raw", "posted": "2019-03-08T06:16:25.923371", "text": "Okay. Sorry, I’m also having to deal with a tipsy friend so I’m sort of distracted"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55074291, "type": "ic", "edited": "2019-03-08T06:29:45.058948", "format": "raw", "posted": "2019-03-08T06:29:45.058948", "text": "Technology is usually seen as a force for good. With it powering homes, schools, and workplaces, as well as giving millions entertainment through games, technological advances have helped the human race in countless ways.\r\n\r\nHowever, it's not without its downfalls, especially when in the wrong hands.\r\n\r\nThe annual VR Tokyo showcase event, being such a public and televised event, didn't have any fears when it came to unsavory people sneaking in. Tickets usually costed thousands of yen, but a select few were chosen by a lucky raffle they could enter weeks prior.\r\n\r\nTech demos and games were often the highlights of these events, with some of the more /adult/ VR experiences hidden in the back rooms requiring proper identification. Entire rooms were dedicated to a specific game that had been generating a lot of buzz - a so-called \"Ultimate Fantasy Simulation\" with hundreds of thousands of possible combinations of locations, partners, and kinks to discover.\r\n\r\nUnbeknownst to those playing, one of the developers had tapped in on their feeds. None of the men currently playing fascinated him, but he still watches on in hopes of finding a plaything well-suited to him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55074662, "type": "ic", "edited": "2019-03-08T06:53:16.467572", "format": "raw", "posted": "2019-03-08T06:53:16.467572", "text": "Karamatsu felt as though his luck was turning. The annual VR Tokyo event was extremely difficult to get tickets to, but he’d been one of the lucky few to get a ticket from the raffle that had been held weeks earlier. Each Matsuno had entered but when only one ticket arrived on their doorstep, the question of who got to go became an entirely new challenge. One that saw Kara at the convention center!\r\n\r\nHands stuffed in the pockets of his jacket, Kara walked between the different exhibits - meandering through the hall and looking for something to catch his eye. He finds what he’s looking for in the very back: Ultimate Fantasy Simulation.\r\n\r\nHe skims over the poster, whistling under his breath as he pushes the curtain aside to enter one of the rooms dedicated to the new game. It doesn’t take long for him to be outfitted in the proper gear, a skintight suit that would get his proportions for his in-game avatar and the VR helmet that covered the top half of his face. An attendant escorts him to the middle of the room that was roped off to give him plenty of player space.\r\n\r\nThen it was time to enter the game."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55698375, "type": "ic", "edited": "2019-04-14T04:30:21.821232", "format": "raw", "posted": "2019-04-14T04:30:21.821232", "text": "The developer perks up as a new player enters the scene. He gets a nice look at him when the VR helmet and suit is put on, finding himself drawn to his cute face and the flashy clothes he wore prior to putting on the VR suit.\r\n\r\nA room comes to life in front of Kara, scanning his body measurements and replicating them perfectly with his in-game avatar. Currently, his character is in front of a door, which slowly opens to reveal a beautiful, busty woman. She beckons for Kara to come closer, holding a delicate hand out.\r\n\r\n\"I'm so glad you came, cutie. All my friends are waiting for you...\" She gives him half-lidded eyes and a seductive smile. \"Don't want to keep them waiting, do we?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55720042, "type": "ic", "edited": "2019-04-15T06:14:39.425977", "format": "raw", "posted": "2019-04-15T06:14:39.425977", "text": "Even for someone with minimal experience when it came to high end technology, Kara can figure out that he’s stumbled upon something amazing. The glimpse he gets of his avatar is downright scary with how accurate it is.\r\n\r\nNot that he looks for too long when the woman makes her appearance. Perfect! He might have been a loser in real life, but in the virtual world...he could be or do anything he wanted. And right now...he wanted to go meet this beautiful woman’s friends.\r\n\r\n“Well I’m sorry to keep them waiting if they’re all as lovely as you are,” he responds, taking her hand and nearly drooling over himself. This would never happen to him in the real world. “Of course not! We should meet with them as soon as possible.”"}]