[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50805978, "type": "ic", "edited": "2018-07-05T17:12:14.062284", "format": "raw", "posted": "2018-07-05T17:12:14.062246", "text": "Hi! I was roleplaying super kinky stuff with you a while back and you kinda... disappeared. Are you alright? I'd be more than willing to start that up again!\r\n\r\nOur RPs included:\r\n• Totoko as a porn star\r\n• Karamatsu as a magician's assistant\r\n• Musical AU where Karamatsu becomes a pet to a group of his classmates"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50805984, "type": "ooc", "edited": "2018-07-05T17:12:37.178209", "format": "raw", "posted": "2018-07-05T17:12:37.178209", "text": "Hey again! Thought I’d start snapping these back up when I saw them"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50807464, "type": "ooc", "edited": "2018-07-05T19:11:44.158212", "format": "raw", "posted": "2018-07-05T19:11:44.158212", "text": "(( hi there, glad to see you again! Did you want to continue one of our RPs or start a new one?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50807610, "type": "ooc", "edited": "2018-07-05T19:21:32.627770", "format": "raw", "posted": "2018-07-05T19:21:32.627770", "text": "Do we want to move the magican’s One to here?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809322, "type": "ooc", "edited": "2018-07-05T21:17:30.186702", "format": "raw", "posted": "2018-07-05T21:17:30.186702", "text": "(( sure thing! we didn't get very far into it but I still have the starter"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809365, "type": "ooc", "edited": "2018-07-05T21:20:16.989957", "format": "raw", "posted": "2018-07-05T21:20:16.989957", "text": "Great! I’m fine with us starting over"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809524, "type": "ooc", "edited": "2018-07-05T21:30:19.830852", "format": "raw", "posted": "2018-07-05T21:30:19.830852", "text": "(( awesome! I'll write the starter"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809685, "type": "ooc", "edited": "2018-07-05T21:39:59.299084", "format": "raw", "posted": "2018-07-05T21:39:59.299084", "text": "Cool!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809925, "type": "ic", "edited": "2018-07-05T21:55:28.515173", "format": "raw", "posted": "2018-07-05T21:55:28.515173", "text": "Kensuke was a man all about show business, and he'd take whatever it took to get to the top, no matter what the cost.\r\n\r\nFor a while, business had been booming for him, but he still wasn't satisfied. He needed a new gimmick, something not seen very often in the magician industry.\r\n\r\nHis next show was all about that gimmick, which would involve an unlucky random member from the audience in an escape situation. But there would be no chance of escape, not with more layers being added until the assistant was practically a mummy. Afterwards, he'd keep the assistant for himself.\r\n\r\nNow, the time has come. Kensuke walks on the stage to an audience of a few thousand people, waving and smiling as the cheer.\r\n\r\n\"Good evening, ladies and gentlemen,\" he announces. \"Tonight is a very special show for all of you. And not just because the pamphlets said this was for mature audiences only.\"\r\n\r\nKensuke scans the audience, eyes landing on a young man near the back with a leather jacket.\r\n\r\n\"For my first trick, I'm going to choose a random member from the audience. And I think I know who... you, with the sunglasses. Step on up!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50810280, "type": "ic", "edited": "2018-07-05T22:18:37.769361", "format": "raw", "posted": "2018-07-05T22:18:37.769361", "text": "Kara wasn’t the type of guy to frequent magic shows, in fact he’d only attended the one tonight because one of his brothers had bailed at the last minute and it seemed like a waste of money for no one to go. He’d just been the only one free at the time of the show.\r\n\r\nHe hadn’t counted on being chosen as a volunteer. \r\n\r\nSmiling good naturedly, Kara pushes up his sunglasses and starts towards the front of the stage. “Alright, alright. I’ll be a good sport.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50817388, "type": "ic", "edited": "2018-07-06T04:48:11.015164", "format": "raw", "posted": "2018-07-06T04:48:11.015164", "text": "Kensuke looks over Karamatsu as he stands next to him. He didn't have any particularly remarkable features, but he was cute in his own way. And he'd look even cuter bound up on stage.\r\n\r\n\"Welcome, welcome,\" he greets, smiling and placing a firm hand on his shoulder. \"I'll bet you're surprised, huh? It's not everyday you get picked as a volunteer for a magic show.\r\n\r\n\"Now, you know this is a show for mature audiences. So you might be uncomfortable at first. But if it's any consolation, I'll pay you once this is all over.\"\r\n\r\nKensuke fails to mention that the \"payment\" won't be in money.\r\n\r\n\"So, I hope this doesn't sound weird, but I'm gonna need you to take off your clothes.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50823034, "type": "ic", "edited": "2018-07-06T16:06:18.136674", "format": "raw", "posted": "2018-07-06T16:06:18.136674", "text": "Kara raises an eyebrow at the request. He’d seen the sidenote on the ticket when his brother had given it to him but hadn’t given it much thought. How was a magic show for a mature audience anyhow?\r\n\r\nJudging by the crowd reaction, he’d probably be labeled as an asshole if he turned down being a volunteer this late. Besides, while he didn’t have a remarkable physique Kara knew that he wasn’t bad looking. Most people found him and his brothers...cute in a way.\r\n\r\n“Just a little, but I am curious.” He responds, smiling good naturedly and beginning to strip down on stage. It’s a little embarrassing to do so in front of a crowd of people but Kara chooses to think about it later when he’s trying so hard to not make a fool of himself."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50834489, "type": "ic", "edited": "2018-07-07T05:18:34.222627", "format": "raw", "posted": "2018-07-07T05:18:34.222627", "text": "Kensuke is stone-faced as Kara strips down to nothing. His eyes scan over every part of him, taking in every inch of his new assistant's body. He's not remarkable by any means, but he was still good-looking. And he'd look even better wrapped up as a helpless mummy.\r\n\r\n\"What I have prepared for you is an escape exercise,\" he explains, showing off a straitjacket. \"You'll need to escape within a time limit, then you'll be rewarded. Let me just strap you in real quick...\"\r\n\r\nHe fastens him in tightly, failing to mention that the area covering his ass is fitted with a small vibrator, which he plans to make use of during his escape."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50834594, "type": "ic", "edited": "2018-07-07T05:24:21.866808", "format": "raw", "posted": "2018-07-07T05:24:21.866808", "text": "Kara cocks his head, arms folded over his chest as he listens to the explanation and gives the straightjacket a good once over. Nothing unusual about it. From what Kara vaguely remembered, magicians often used them for escape tricks. So how he’s supposed to manage without any knowledge...he has no clue.\r\n\r\n“Sounds tough but I’ll give it a shot. Is there any advice you could give me?” He asks, plastering on a cheerful smile as he’s helped into the restricted confines of the garmet and giving a good tug to make sure that everything was secure."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50834878, "type": "ic", "edited": "2018-07-07T05:43:40.592863", "format": "raw", "posted": "2018-07-07T05:43:40.592863", "text": "Kensuke nods, knowing that Kara's smile will soon disappear.\r\n\r\n\"All I can say is to try to relax if you find yourself in a very tight bind. The process is a lot easier on you later if you don't push yourself too hard.\" He gives him a charismatic smile along with the advice, not mentioning that the advice applies to the hypnosis step much later.\r\n\r\n\"I'll give you three minutes to escape,\" he says, opening an app on his phone that controlled the vibrator. \"Ready, set, go!\"\r\n\r\nKensuke presses the button, the vibrator springing to life immediately after."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50835023, "type": "ic", "edited": "2018-07-07T05:50:31.283593", "format": "raw", "posted": "2018-07-07T05:50:31.283593", "text": "Three minutes. Kara’s certain that most straightjacket escapes don’t take that long. It’s enough time that he thinks that with a little bit of luck he might not make a total fool of himself in front of a crowd of strangers. \r\n\r\nHe works at it for a couple of seconds, twisting and squirming without a single clasp coming off. Not his lucky day. Especially when he’s soon brought to his knees, collapsing and panting on the floor as vibrations start on his ass. \r\n\r\nIt’s a distraction all right, one that prevents him from getting anything else done to free himself from the straightjacket. And when the buzzer sounds, Kara is still writhing on the floor and letting out quite moans."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835297, "type": "ic", "edited": "2018-07-07T06:09:03.413474", "format": "raw", "posted": "2018-07-07T06:09:03.413474", "text": "\"Well, isn't that a shame,\" Kensuke says, leaning down to Kara's pile of clothes to pick up his boxers. \"Since you didn't escape, we aren't quite done yet. I have to bind you tighter, but if it makes you feel better, I'll give you a longer time limit.\"\r\n\r\nWith Kara's mouth open in a moan, Kensuke shoves the boxers into his mouth, muffling his noises. He also takes out a pair of cuffs, strapping them to his ankles before resetting the timer.\r\n\r\n\"You've got five minutes this time,\" he announces before starting the timer. Kensuke also turns up the vibrator's power, eager to see his plaything's reaction."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50835380, "type": "ic", "edited": "2018-07-07T06:16:49.564512", "format": "raw", "posted": "2018-07-07T06:16:49.564512", "text": "So this is what made it show for mature audiences? Kara still hasn’t quite caught on to the fact that he’s just being toyed with by the magician but in his defense, it’s rather hard to think when the vibrator’s power is turned up.\r\n\r\nIt’s even harder to move with his ankles cuffed now and the grunts that escape his cotton gag become more and more frantic as five minutes turns into two...and then one again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835728, "type": "ic", "edited": "2018-07-07T06:42:05.645007", "format": "raw", "posted": "2018-07-07T06:42:05.645007", "text": "When the final second depletes and the buzzer sounds again, Kensuke doesn't waste a moment in grabbing for a big roll of duct tape and using it to wrap up Kara's body. From his ankles up to his neck, the NEET is wrapped up in several amounts of layers that would be outright impossible to escape. He finishes by blindfolding him with a cloth.\r\n\r\n\"Ten minutes this time, okay?\" Kensuke says before starting the timer again, thankful that the squirming captive can't see his growing erection."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50835795, "type": "ic", "edited": "2018-07-07T06:46:48.683883", "format": "raw", "posted": "2018-07-07T06:46:48.683883", "text": "Ten minutes. Ten minutes of useless struggling, grunting, and rolling on the floor and the only thing he really manages to do is work the blindfold halfway off by the time that he only has three minutes to escape several layers of duct type binding him closer together, the handcuffs around his ankles, and the straightjacket that started everything.\r\n\r\nIt’s downright exhausting work and he lets out a muffled curse through the gag when he hears the third buzzer. So far each round had ended with even more restrictive bounds to escape to so Kara is less than excited to see what the latest edition will be."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835999, "type": "ic", "edited": "2018-07-07T07:04:21.506993", "format": "raw", "posted": "2018-07-07T07:04:21.506993", "text": "\"Hang in there!\" Kensuke laughs as he grabs onto a roll of plastic wrap, maneuvering it around Kara's body and up to the lower half of his face. It keeps the boxers snug inside, although he doubts that he could spit them out to begin with. He ends by tightening the blindfold around his eyes, starting his progress over.\r\n\r\n\"10 more minutes, then we'll bring out the really good stuff!\" Kensuke restarts the timer, turning up the vibrator all the way higher."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50837776, "type": "ic", "edited": "2018-07-07T11:58:19.979930", "format": "raw", "posted": "2018-07-07T11:58:19.979930", "text": "Kara’s struggles are weaker now, becoming more so with every new layer added to his bondage. He’s starting to realize now that this...something has to be wrong. There’s no magic to this at all. None that he’s seen so far. \r\n\r\nHis cock twitches as the vibrator works on his ass again, back arching and a series of muffled groans escaping him despite the situation. It’s getting to the point where he can hardly move through the layers and once the next ten minutes pass he can’t even manage to shake the blindfold again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50838633, "type": "ic", "edited": "2018-07-07T14:38:00.191062", "format": "raw", "posted": "2018-07-07T14:38:00.191062", "text": "Kensuke prepares the earbuds once the next ten minutes have passed, pressing them against Kara's ears. No sound plays from them yet as he retrieves a latex mask, stretching the rubbery substance over his head and keeping the earbuds in place.\r\n\r\nThe magician picks up Kara and moves him on a chair in the middle of the stage, using a small amount of tape to keep him locked in place. Kensuke then turns to the audience, the grin on his face evident.\r\n\r\n\"He isn't going to last much longer like this, folks,\" he announces, eliciting a few laughs from the audience. \"Let's watch him together for the next ten or so minutes.\"\r\n\r\nWith the press of a button, the timer starts up again, but this time, the earbuds start playing the audio track, confirming Kara's suspicions.\r\n\r\n\"You've probably figured out by now that this little stunt is a trap. Now that I have you bound tight, there's no point in keeping up this charade. You're going to be my permanent assistant, traveling the country with me as my loyal pet. With the hypnosis audio, you'll have no choice but to follow my every command.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50838705, "type": "ic", "edited": "2018-07-07T14:53:10.686320", "format": "raw", "posted": "2018-07-07T14:53:10.686320", "text": "Kara’s head jerks in surprise when the earbuds are put in place. But he’s completely helpless to stop the application of the latex hood, stuck in place until he’s moved into a sitting position and taped into the chair.\r\n\r\nThe rubbery mask muffles the sounds of the outside world around him and Kara whines pitifully when he hears what is unmistakeable laughter coming from the audience.\r\n\r\nHis struggles renew when the audio filters in through the earbuds. It’s his only connection to the outside world but Kara doesn’t like what he hears. Permanent assistant is a worrying phrase but he doesn’t have much hope about the term hypnosis either."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50841591, "type": "ic", "edited": "2018-07-07T19:36:28.745936", "format": "raw", "posted": "2018-07-07T19:36:28.745936", "text": "The audio continues, Kensuke's voice becoming softer and sultrier as the hypnosis portion begins.\r\n\r\n\"Listen to the sound of my voice. Feel yourself getting drawn in deeper and deeper. There's no need to struggle any longer, just relax and let my voice guide you.\"\r\n\r\nKensuke and the audience watch closely, the former ecstatic to see Kara's transformation from a struggling mess to an obedient pet.\r\n\r\n\"Just listen to my voice... feel your desire for freedom start to slip away. Feel your body sinking into the chair, let the vibrator do its job.\""}]