[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50841628, "type": "ic", "edited": "2018-07-07T19:39:40.639097", "format": "raw", "posted": "2018-07-07T19:39:40.639097", "text": "The poor guy keeps up his feeble escape attempts until the very end, when the voice becomes too much and he feels himself becoming heavier. Listening wasn’t too hard, it was easier than anything else.\r\n\r\nKara’s body stills in the chair, only occasionally twitching with the straightjacket’s vibrator."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50859880, "type": "ic", "edited": "2018-07-08T20:55:38.874936", "format": "raw", "posted": "2018-07-08T20:55:38.874936", "text": "Kensuke smirks as Kara's body stills, pleased that the hypnosis tape is working. The voice in the earbuds continues to speak softly, giving Kara instructions for how he'll need to act from now on.\r\n\r\n\"Comfortable? As my permanent assistant, you'll obey my every command. You'll give yourself entirely to me, and me alone. Your previous life before this is no more. You live to serve me as my assistant and plaything from now on.\"\r\n\r\nThe voice grows sultrier, whispering quietly.\r\n\r\n\"Does that vibrator feel nice? Do you feel it growing stronger? Imagine it rocking you to your very core. It's excruciating, isn't it? The vibrations are getting stronger and stronger, and you find it harder to keep quiet...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50859979, "type": "ic", "edited": "2018-07-08T21:02:04.463503", "format": "raw", "posted": "2018-07-08T21:02:04.463503", "text": "It’s too much. Kara wasn’t particularly strong willed from the start so the hypnosis is more than effective in rewriting him from the ground up. What was he even doing before this very moment? The NEET can’t say that he remembers. All he knows is that he’s Kensuke’s assistant for all his performances. That’s what the most important thing is for him to know.\r\n\r\nHe keens through the gag and latex hood, becoming louder and louder as the vibrations become unbearable. In truth, it’s still on the same setting that he’s been enduring this whole time, but for Kara it seems to grow in power until he’s exerting effort to be louder than the buzzing in his ass. \r\n\r\nThe chair rocks with his movements, now twisting and moaning with pleasure."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50886505, "type": "ooc", "edited": "2018-07-10T03:45:58.274706", "format": "raw", "posted": "2018-07-10T03:45:58.274706", "text": "Question. Didn’t you at some point commission artwork of one of our role plays?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50886988, "type": "ooc", "edited": "2018-07-10T04:08:50.635784", "format": "raw", "posted": "2018-07-10T04:08:50.635784", "text": "(( i did!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50887372, "type": "ooc", "edited": "2018-07-10T04:26:40.485770", "format": "raw", "posted": "2018-07-10T04:26:40.485770", "text": "Could I see the link to that again if you still have it? I was thinking about it earlier today and I’d kill to see it again"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887395, "type": "ooc", "edited": "2018-07-10T04:27:45.877040", "format": "raw", "posted": "2018-07-10T04:27:45.877040", "text": "(( sure thing! I'll find it and send it again"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887425, "type": "ooc", "edited": "2018-07-10T04:28:48.612895", "format": "raw", "posted": "2018-07-10T04:28:48.612895", "text": "(( https://www.dropbox.com/s/1bma3w5o9d3naj9/latexoso.png?dl=0"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50887467, "type": "ooc", "edited": "2018-07-10T04:30:42.505928", "format": "raw", "posted": "2018-07-10T04:30:42.505928", "text": "Thanks so much!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51606187, "type": "ic", "edited": "2018-08-19T01:32:53.025439", "format": "raw", "posted": "2018-08-19T01:32:53.025439", "text": "Kensuke's cock is erect as he turns away from the audience, giving complete attention to the moaning Kara as he twists and moans in his heavy bondage. While the audience laughs at the twisting figure in front of them, the instructions continue through the earbuds.\r\n\r\n\"What a good little assistant... putting on a show for our audience, aren't we? Too bad something in your body... isn't letting you cum. During the entire duration of this performance, you will be unable to cum, only able to squirm and moan through that gag of yours.\"\r\n\r\nKensuke walks behind Kara's chair as his calloused hands trail down his bound body. Every moan from behind the mask turns Kensuke on even more as he stares down at his plaything with lustful eyes."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51606348, "type": "ic", "edited": "2018-08-19T01:43:08.114018", "format": "raw", "posted": "2018-08-19T01:43:08.114018", "text": "Kara jolts in the seat at the realization of what’s to come. There’s no escaping this. He’ll be Kensuke’s assistant for as long as he was bound and hypnotized - hell, even if he was just hypnotized there wouldn’t be a chance for him to get free. His body is obeying every order coming through the earbuds.\r\n\r\nMeaning that he’s not going to be able to cum at all though the rest of the show. The Matsu whines, twisting from within his layers of bondage."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51618230, "type": "ic", "edited": "2018-08-19T20:28:22.544423", "format": "raw", "posted": "2018-08-19T20:28:22.544423", "text": "Even in his current state, Kensuke still has plans for Kara for the rest of the performance. As the hypnosis tape ends, it whispers a final message into Kara's ears.\r\n\r\n\"I look forward to working with you for a very, very long time, my little assistant.\"\r\n\r\nAs the tape ends, Kensuke takes off the mask and earbuds, revealing Kara's face still blindfolded and gagged with the boxers. The audience hollers and whistles at the heavily bound Kara in front of them as Kensuke gives them a big smile.\r\n\r\n\"Who wants to see my assistant suffer even more before I wrap things up?\"\r\n\r\nWhen he's met with cheering, Kensuke responds by plugging his nostrils, intending to end the show with him passing out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51676535, "type": "ooc", "edited": "2018-08-23T03:35:52.398791", "format": "raw", "posted": "2018-08-23T03:35:52.398791", "text": "(( off-topic, but I think you'll like this fanart: \r\nhttps://78.media.tumblr.com/0836b97cba49579a9ae18612090045ac/tumblr_p8dm6dCsBn1vw9tczo1_1280.png\r\n\r\nhttps://78.media.tumblr.com/d776a2003d8dceafb28413356182f490/tumblr_p8dm6dCsBn1vw9tczo2_1280.png"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52242534, "type": "ic", "edited": "2018-09-25T23:55:48.897915", "format": "raw", "posted": "2018-09-25T23:55:48.897915", "text": "Kara plays his given role exceptionally well, keening through the gag like an animal in heat for as long as he’s unable to cum. Warmth pools in his cock with how badly he wants to release but can’t. \r\n\r\nHe hardly even notices when the latex mask is removed. Though the earbuds are a different story all together. Going from the isolated quiet of hearing the tape to the cheers and vulgar encouragement of the audience puts a flush on Kara’s cheeks despite himself.\r\n\r\nThe humiliation doesn’t last long. Not once his new master plugs his nose. Kara jerks and twists helplessly in the chair, mind focusing on its need for air until the lack thereof finally gets to him and his body goes limp in the chair."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52248039, "type": "ic", "edited": "2018-09-26T04:40:47.006154", "format": "raw", "posted": "2018-09-26T04:40:47.006154", "text": "With Kara fainting, the show comes to a close. As Kensuke bids the crowd farewell, he's met with roaring applause that continues when he drags Kara and the chair backstage.\r\n\r\nThe sadistic magician examines his new assistant, able to get a better look now that he's no longer thrashing in his bonds. He has a cute face, but his body isn't particularly built. Kensuke doesn't mind, since his body type is still appealing and suits him.\r\n\r\nAvoiding a crowd by sneaking outside, Kensuke drags Kara into his tour bus, his body still strapped to the chair. He takes the damp boxer gag out of his mouth, allowing breaths to come more easily, and unties the blindfold around his eyes. Finally, he turns off the vibrator, but still keeps it where it was.\r\n\r\nKensuke gives him a few rough pats to the cheek in an attempt to wake him, curious to see if the hypnosis is still in effect."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52250142, "type": "ic", "edited": "2018-09-26T09:08:01.337220", "format": "raw", "posted": "2018-09-26T09:08:01.337220", "text": "Kara’s closed eyes wrinkle as he squints, burrowing deeper into unconsciousness. His brain feels fuzzy but it doesn’t feel bad to remain in the semi-conscious state. It’s the skin to skin contact that really wakes him up, reminds him that there’s work to do. The Matsu doesn’t remember a whole hell of a lot - doesn’t need to, his brain supplies, he just needs to listen to his new master.\r\n\r\nMakes sense.\r\n\r\nSo Kara wakes slowly, blinking away any lingering grogginess. But it isn’t the same expression that he wore at the beginning of Kensuke’s show. It’s almost as if a light had gone out in his eyes, but they linger on Kensuke attentively once they open.\r\n\r\nHe doesn’t even struggle in his bondage anymore."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52578650, "type": "ic", "edited": "2018-10-17T05:09:31.942386", "format": "raw", "posted": "2018-10-17T05:09:31.942386", "text": "Kensuke chuckles, pleased that Kara's still in his state of hypnosis. His futile struggles from the performance have stopped, replaced with glazed-over eyes and weariness.\r\n\r\nJust the way he liked it.\r\n\r\n\"How's my lovely assistant?\" Kensuke says as he strokes Kara's face. \"Did you enjoy your nap? I have to say, you put on quite the show out there.\"\r\n\r\nKensuke's boner still hasn't gone down from watching Kara struggle, and he plans to fix that as he unbuckles his pants and lets his cock hang free.\r\n\r\n\"Use your tongue properly,\" he demands as he inches closer to his mouth. \"Show me what you can do.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52719960, "type": "ic", "edited": "2018-10-26T05:05:46.751511", "format": "raw", "posted": "2018-10-26T05:05:46.751511", "text": "A small part of Kara’s mind is playing a warning on repeat, screaming that something isn’t quite right with this situation. It’s overpowered by the larger portion of his thoughts that sluggishly whisper that everything is just the way that they’re supposed to be. He’s supposed to be with Kensuke, with his master. And as long as he keeps listening to him, he’ll continue to be a good assistant to the hypnotist. \r\n\r\nIt’s almost fluid in the way that Kara moves when he’s given an order, straining against his bonds again as he opens his mouth for Kensuke’s cock. As soon as he’s able he begins to lap at his cock with his tongue and suck at his member without any care for anything else."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52720114, "type": "ic", "edited": "2018-10-26T05:18:17.378785", "format": "raw", "posted": "2018-10-26T05:18:17.378785", "text": "Kensuke moans as Kara sucks him off, satisfied that he's been reduced to an obedient servant. From his skill, it's clear he's never sucked cock before, but Kensuke is more than willing to teach him.\r\n\r\n\"Good boy,\" he purrs as he strokes his hair. \"If you keep acting like this, you won't be punished often.\"\r\n\r\nThe sadistic magician groans as he shoves himself deeper down Kara's throat, losing himself in pleasure as he uses him like some kind of toy. Then he's cumming, shooting some of his load down Kara's throat and pulling out to coat his face.\r\n\r\n\"I'm looking forward to working with you, my lovely little assistant,\" he says with a smile."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52720167, "type": "ic", "edited": "2018-10-26T05:22:48.345111", "format": "raw", "posted": "2018-10-26T05:22:48.345111", "text": "Impressively enough, Kara doesn’t gag in his work until Kensuke himself starts to fuck his throat mercilessly. He’s inexperienced, but makes up for it with his sheer dedication to complete his orders. \r\n\r\nHe flushes at the praise, swallowing obediately and looking to Kensuke expectantly while ignoring the cum beginning to dry on his face."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53768513, "type": "ic", "edited": "2018-12-28T08:20:40.033328", "format": "raw", "posted": "2018-12-28T08:20:40.033328", "text": "Kensuke squats down to examine Kara, feeling intense satisfaction from seeing his own cum on his face. He deeply kisses his new assistant, tongue pressing against his own in a messy, sloppy kiss. Saliva connects their mouths when he pulls back and offers a smile.\r\n\r\n\"You look wonderful taped up like this,\" he says, running his hands down the plastic wrap that he placed over the tape. \"I think I'm going to keep you like that for the rest of the night. Hopefully it's nice and snug so you'll fall asleep quickly. Don't worry, I'll take you out of the chair so I can snuggle with you in bed.\"\r\n\r\nUnwrapping the small amount of tape attached to the chair, Kensuke lifts up Kara like a bride and carries him to the back of the bus. Waiting for him is a large bed with fluffy white covers and a dim light emitting from a lamp nearby.\r\n\r\n\"My driver will be leaving for a rest stop soon,\" he explains as he lowers him down on the bed. \"So I'll be back here with you.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53887661, "type": "ic", "edited": "2019-01-03T07:16:17.789787", "format": "raw", "posted": "2019-01-03T07:16:17.789787", "text": "Kara whines, any worry that he might have had completely erased by Kensuke’s words. He’d downright excited to be here, ready to perform the best that he possibly can as the hypnotist’s assistant. As far as he knows, there’s nothing else for him. His brothers will be waiting for him to come back and he’ll never show, not even the wiser that he has a home to return to.\r\n\r\nHe’s just happy that Kensuke seems happy, all wrapped up without any room to struggle or find an escape. He’s practically purring in the man’s arms as he’s carried to the back and placed on the bed. Everything truly is snug, forcing him into an immobile position so that he would have to rely on Kensuke even if he didn’t want to.\r\n\r\n“Okay,” he responds cheerfully, smiling wide and genuine as he looks up to Kensuke. “I’ll miss you. I don’t ever want you to leave.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53907355, "type": "ic", "edited": "2019-01-04T05:55:41.067962", "format": "raw", "posted": "2019-01-04T05:55:41.067962", "text": "Kensuke strokes Kara's cheek gently as he lowers himself on the bed, giving him feathery kisses along his forehead before focusing on his lips. He gives him several pecks as he holds his mummified body close to him and hums in satisfaction.\r\n\r\n\"Good boy,\" he whispers against his lips before planting another kiss. \"I'm glad you see your purpose. We're going to be very close these next few months, my lovely assistant.\"\r\n\r\nKensuke's hands run along his snugly wrapped body and embraces his form as he relaxes on the bed. Sighing in Kara's ear, he wonders how long the hypnosis tape will have its effect. If anything, he can put him under again, but the thought still lingers as he nibbles on his earlobe.\r\n\r\n\"I'll be right here with you all night, don't worry,\" he whispers, flipping over to turn off the lamp light. \"I'll hold you close, so you have nothing to worry about.\"\r\n\r\nKensuke holds onto Kara, cuddling him like a pillow.\r\n\r\n\"Good night, my precious pet.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53924602, "type": "ic", "edited": "2019-01-05T03:20:15.411670", "format": "raw", "posted": "2019-01-05T03:20:15.411670", "text": "Kara practically purrs at the treatment and the assurance that they were going to have a good time with one another. Right now, he wanted nothing more than to please Kensuke and it seemed like he could do so just by being there for the man to cuddle with.\r\n\r\nAnd he could do that, that was an easy job. Even if he does crane his neck ever so slightly to push into the kiss and whines when Kensuke starts to focus on the rest of his body.\r\n\r\nHe falls asleep long before Kensuke, comfortable in the hypnotist’s embrace. But he wakes in the middle of the night, thrashing and struggling against the bondage with no hope of escape.\r\n\r\nThe last thing he remembered was attending the show and being placed into a chair after several failed escape attempts. Then...nothing. All he knows is that he’s somewhere dark and just judging by the pit in his stomach caused by motion sickness, he’s on the move. That and someone’s holding him.\r\n\r\n“What the fuck?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53927589, "type": "ic", "edited": "2019-01-05T05:38:48.455866", "format": "raw", "posted": "2019-01-05T05:38:48.455866", "text": "Kensuke groggily wakes up, groaning as Kara struggles against him. He's barely awake at first, having just woke up from a dream about how he envisioned the next few weeks - with Kara as his obedient assistant.\r\n\r\nBut he's not met with that when he comes to. Instead, Kara thrashes uselessly against the tape and plastic. The spectacle arouses Kensuke, causing an erection to grow in his boxers.\r\n\r\n\"Looks like the hypnosis didn't last as long as I wanted it to,\" he sighs. \"You know what this means, right? I'll have to punish you for waking me up so rudely. So be a good boy and take it.\"\r\n\r\nUndoing his pants and sliding off his boxers, Kensuke frees his erection and shoves Kara's face into it. He expects him to struggle and shout, fully prepared to punish him further."}]