[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53927836, "type": "ic", "edited": "2019-01-05T05:51:07.534062", "format": "raw", "posted": "2019-01-05T05:51:07.534062", "text": "If Kara were capable of making a fist now, he would. As is, his arms are still wrapped tightly around his body by the straight jacket underneath the tape and plastic wrap, leaving with him with little option on how to proceed in his current predicament.\r\n\r\n“The hypnosis! You’re a creep, let me out of here,” he argues, gritting his teeth in irritation as he continues to just barely squirm and move.\r\n\r\nHe’s absolutely horrified when the man shoves his head into his cock, Kara refusing to open his mouth now that he’s this close until he starts trying to twist his head away from Kensuke’s grasp.\r\n\r\n“Let me go!”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53928020, "type": "ic", "edited": "2019-01-05T05:59:18.376155", "format": "raw", "posted": "2019-01-05T05:59:18.376155", "text": "Kara's useless struggles only edge Kensuke on further as he shoves his face into his crotch, erection twitching and leaking precum.\r\n\r\n\"No can do,\" he chuckles as he yanks back on his hair. \"I'm in dire need of an assistant, and you're perfect for the job. The audience loved watching you struggle and moan on stage, and they're going to be seeing a lot more of it.\"\r\n\r\n\"I'm giving you one last chance to be a good boy for me. Either suck me off like a good little assistant, or I'll make you suffer the whole damn night.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53928220, "type": "ic", "edited": "2019-01-05T06:09:33.423348", "format": "raw", "posted": "2019-01-05T06:09:33.423348", "text": "Kara hisses through his teeth when his hair is pulled, not appreciating the fact that it’s being used as a handle to control his movements - and a painful one at that. But he still doesn’t budge, refusing to open his mouth for Kensuke.\r\n\r\nHe doesn’t want to suck the hypnotist off. He has no idea if he’d done it while apparently hypnotized, but he isn’t about to start now when he has his wits about him. Although...suffering didn’t sound that great either with how vulnerable he is in this position.\r\n\r\nSlowly, Kara opens his mouth and tentatively begins to take Kensuke’s cock in his mouth. He doesn’t like that the salty taste of the man’s precum is vaguely familiar - sneering with disgust as he starts to quickly pull back and ends up scraping his teeth against the man’s cock."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54316203, "type": "ic", "edited": "2019-01-25T05:23:02.446148", "format": "raw", "posted": "2019-01-25T05:23:02.446148", "text": "Kensuke closes his eyes in pleasure as Kara's mouth touches his cock, only for him to wince shortly after once his teeth scrape against the sensitive skin. Grimacing, he yanks back on Kara's hair and stares him down face-to-face.\r\n\r\n\"Now you've done it,\" he snarls, shoving him down onto the bed. \"I can't let this slide... I have no choice but to punish you. And I know just the thing.\"\r\n\r\nFiddling with a remote by the bed, Kensuke activates the vibrator that was in Kara's ass during the performance. It buzzes on a fairly high setting as the sadistic magician rummages through his drawer to pull out two earbuds and the rubber mask.\r\n\r\n\"I made a few backup recordings in case you snapped out of it,\" he explains before putting in the earbuds. \"I'll just sit back and watch you struggle for a while.\"\r\n\r\nHe finishes by stretching the mask over his head to make sure he'd only hear the recording, Kensuke's voice filling Kara's ears as he sets up the audio player.\r\n\r\n\"Looks like my little assistant disobeyed me,\" the voice says in a silky smooth tone. \"Listen to my voice like last time, and I will explain your punishment...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54318150, "type": "ic", "edited": "2019-01-25T07:34:00.406272", "format": "raw", "posted": "2019-01-25T07:34:00.406272", "text": "A wild grin spreads across Kara’s face even when he knows the act of rebellion won’t go unpunished. Worth it. He’s smiling up until Kensuke activates the vibrator again and he’s left to squirm underneath the hypnotist in all his bondage - eyes holding a fierce determination despite the humiliating position.\r\n\r\nHe bucks in panic when he spots the mask and earbuds again. No! That’s what got him here to begin with. Well that and his current inability to move more than a few centimeters on his own. Kara tries jerking his head away and fails, trapped inside the latex mask with nothing but his own thoughts until the recording starts up."}]