[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 48654585, "type": "ic", "edited": "2018-03-09T20:11:31.649048", "format": null, "posted": "2018-03-09T20:03:17.192236", "text": "Takeshi's love of intense bondage was evident through his internet history, along with the videos he had saved on his computer. Whenever he watched a handsome young man struggle through their restraints fruitlessly, he found himself aroused in ways that were considered socially unacceptable.\r\n\r\nBut watching it hadn't been doing it for him this past week. Out of options, Takeshi decided to capture a toy for himself, and make a little money in the process.\r\n\r\nTakeshi's studio was filled with all sorts of sexual tools - different latex suits, masks, duct tape, sleep sacks, gags of all types, whips, and all sorts of other sadistic devices. A collection like this was enviable, and combined with his camera, could prove to be very successful with fellow kinky people. He had experience in filming porn, as he had a few playthings for himself before selling them away for extra money.\r\n\r\nSo when he found six young men who looked like they could be fun, Takeshi acted, calling his buddies to stalk and capture them. He learned their names, likes, dislikes, and other facts, but also that they were virgin NEETs.\r\n\r\nTakeshi got the call some time later, that the six had been stripped naked, tied, gagged, and thrown in three separate bags before being forced in his friends' car. They were on their way right now, so Takeshi set up his camera, setting it to stream as soon as they entered the front door and dumped the sextuplets' bound bodies on the floor."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48665456, "type": "ic", "edited": "2018-03-10T11:18:59.482506", "format": null, "posted": "2018-03-10T11:18:59.482506", "text": "For a couple of unemployed NEETs, the Matsus did fairly well for themselves when it came down to it. They were content in their normal lives and were perfectly fine with the lack of excitement that others around them seemed to crave. Each brother had their own likes and dislikes, but they were almost indistinguishable from one another aside from those traits. \r\n\r\nNone of them would have ever predicted being nabbed on their way to the store, stripped of their clothes and forced to be gagged by their own underwear and a thick strip of duct tape that wrapped all the way around their heads - not that they could peel it off with their arms given the same treatment behind their backs before being stuffed into three separate bags that contained two squirming, naked Matsus each.\r\n\r\nBlinking owlishly as they’re spilled onto the floor, the brothers can only look around the room with various expressions of shock as they take in all the contents."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48670414, "type": "ic", "edited": "2018-03-10T20:18:30.527807", "format": null, "posted": "2018-03-10T20:16:19.312438", "text": "Takeshi's cock grows hard in his pants as he observes the brothers' reactions, chuckling at their shocked expressions. Being bound so tightly, there was no way they'd be able to escape - especially considering his plans to bind them even tighter.\r\n\r\nPointing the camera down at them, he offers a greeting.\r\n\r\n\"Good evening,\" he says calmly, panning the camera to give the audience a good look at their bodies. \"You all look a bit troubled... perhaps I can take care of that with a few of my toys here.\"\r\n\r\nTakeshi's friends go off to retrieve some more rolls of tape from a cabinet, along with a vibrating wand toy and nipple clamps.\r\n\r\n\"Now we'll begin your training, boys,\" Takeshi announces as his friends crowd around Oso with the rolls of tape, wrapping him up in an insane amount of layers sans his sensitive areas. Then the vibrator is put on his cock, along with the clamps for his nipples.\r\n\r\nTakeshi's camera focuses all over Oso's heavily bound body, with special attention on his nipples, cock, and expression."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48682545, "type": "ooc", "edited": "2018-03-11T11:08:50.253922", "format": null, "posted": "2018-03-11T11:08:50.253922", "text": "Hey! Sorry for the delay but I just had an idea. What if one Matsu was put onto their knees before being bound up and their mask had a hook that pulled their head very far back while the clamps on their nipples had chains that pulled outward and attached to weights on a pulley system so that they would have to choose between pulling their nipples or pain in the neck?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48682556, "type": "ooc", "edited": "2018-03-11T11:11:02.760197", "format": null, "posted": "2018-03-11T11:11:02.760197", "text": "(( I like that idea a lot!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48682651, "type": "ic", "edited": "2018-03-11T11:35:35.326342", "format": null, "posted": "2018-03-11T11:35:35.326342", "text": "Oso’s cock is soft the entire time that he’s wrapped in layer after layer of tape until he’s no longer able to move even a centimeter. Even his fingers and toes had been wrapped individually before being taped together into thick mitts - no sooner taped again with his legs completely together and his arms forced into a reversed prayer. His grunts of protest are muffled further than the gag after the layers spiral around his neck and then form a thicker padding around the lower half of his face. \r\n\r\nBut his member doesn’t stay that way for long, quickly coming to attention a few moments after the vibrator is strapped to his cock. If not for the heavy layering of tape constricting his balls, Oso can’t imagine that he would last very long underneath it’s buzzing. As is, his cock is almost painfully hard when the clamps are applied to his nipples. The stinging ache pools in his chest as he glances out of the corners of his eyes to look at his brothers for assistance.\r\n\r\nNot that they would be able to do anything in their current states, but as Oso’s arousal builds with no hope of immediate release his mind starts to wander elsewhere - eyes flickering and brows drawn tight as pre-cum leaks from his cock."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48688315, "type": "ic", "edited": "2018-03-11T21:37:53.075086", "format": null, "posted": "2018-03-11T21:37:53.075086", "text": "\"You look like you're enjoying yourself, my little plaything,\" Takeshi teases, his buddies yanking on each clamp and tugging Oso's nipples toward the ceiling.\r\n\r\n\"While they have their way with you, I'll play with your brothers. You can't do anything to stop me, anyway.\" One of Takeshi's friends is now in charge of the camera as Takeshi moves onto Todomatsu, slinging him over his shoulder and placing him on a chair not unlike one at a dentist's office.\r\n\r\n\"How do those boxers feel stuffed in your mouth, Totty?\" Takeshi asks as he straps him into the chair with the thick leather attached to the sides. \"It's practically bulging out your cheeks...\"\r\n\r\nHe grabs onto a latex mask nearby, showing it off to Totty.\r\n\r\n\"With this mask, you won't be able to hear much, or see anything... you'll be completely helpless for the rest of your life, along with your brothers. I'll put you through so much pain and humiliation, and with the mask, you'll never know what's coming next. What do you think about that, Totty?\"\r\n\r\nTakeshi slowly lowers the mask onto his plaything's head, the latex covering his eyes and ears but still showing off his taped mouth. The mask is a tight fit, two small holes where his nostrils are to allow him to breathe."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48688994, "type": "ic", "edited": "2018-03-11T22:12:28.743761", "format": null, "posted": "2018-03-11T22:12:28.743761", "text": "The mummified Oso grunts as his nipples are pulled, eyes flashing with pain that conflicts with the pleasure in his cock. His brothers can only watch in horror as he’s surrounded by the man’s friends to be toyed with. They squirm as Takeshi approaches the rest of them, with Totty releasing a muffled squeal when he’s the one chosen. \r\n\r\nIn the chair, he can only grunt in response to the questions he’s being asked. Straps cinch his wrists to the arm rests, eyes wide as his legs, chest, and neck are also strapped down to the point of immobility. \r\n\r\nTotty whines in the back of his throat, unable to move his head away as the mask is stretched over the upper half of his face and he’s left blind and partially deaf - only able to take shallow breaths through his nose. Immediately he hates it, jerking against the restraints and twitching from whatever has to be coming his way next."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696245, "type": "ic", "edited": "2018-03-12T04:07:26.962314", "format": null, "posted": "2018-03-12T04:07:26.962314", "text": "Takeshi pulls at Totty's nipples as he squirms, giving him a slap to the chest as punishment for moving around so much. He doesn't bother to say anything as he reaches for the machine's tube, fastening it around Totty's cock as he strokes it. Pressing a few buttons off to the side, Takeshi watches as the machine vibrates and strokes around Totty's cock, the tube designed to collect his cum in a small container.\r\n\r\nTakeshi moves onto the next brother after the camera focuses on Totty for a while, looking towards Choromatsu before picking him up roughly and bringing him over to a pulley mechanism with a weight. He works quickly to attach clamps to his nipples, attaching them to chains connected to the system.\r\n\r\n\"Do you want a tight mask like Totty, Choromatsu?\" Takeshi asks, mask in his hands before slowly lowering it on. Forcing the now blind and deaf captive on his knees, his nipples are harshly tugged on by the pulley's weights, Takeshi attaching a hook to the back of the mask and yanking it back, forcing Choro's head towards the ceiling as he straps it to another pulley.\r\n\r\nHe ends by binding him in layers of tape, not quite as many as Oso but still enough to be inescapable."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48696535, "type": "ic", "edited": "2018-03-12T04:22:00.129511", "format": null, "posted": "2018-03-12T04:22:00.129511", "text": "Totty’s whines increase in volume, the pinches and slap somehow amplified by not being able to see them coming. It makes the next part of his predicament unbearable as he feels a device slide over his cock and begin to pump and vibrate the member until he’s twitching with an orgasm and cumming into the tube. When it continues, he lets out a muffled cry as he realizes that he’s going to be in the chair for a considerable period of time. \r\n\r\nChoromatsu doesn’t fair much better than his brother in attempts to squirm away from Takeshi. The rest of the brothers are slowly beginning to piece together their fates, quickly losing hope that this couldn’t really be happening with each one of them that’s taken away from the pile and put into bondage.\r\n\r\nThe weights on his nipples stretch the poor buds to the point that he stands very still as Takeshi applies the mask that practically forms a perfect mold over his head and becomes a second skin. The tugging is worse as he’s forced onto his knees and the weights are lifted via the pulley system - and he doesn’t quite understand the point until his head is jerked back by the second set of pulleys. \r\n\r\nHe has to choose between lifting the weights to relieve the pain in his neck or vice versa - made more unbearable once his arms are taped outstretched behind his back to trust out his chest and his calves are taped to his thighs. Grunts of frustration rise from Choro as he rocks back and forth between the positions available to him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696606, "type": "ooc", "edited": "2018-03-12T04:25:16.967511", "format": null, "posted": "2018-03-12T04:25:16.967511", "text": "(( btw, have we rp'ed in the past? I think we've done quite a few RPs before, all involving Matsus in heavy bondage"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48696653, "type": "ooc", "edited": "2018-03-12T04:27:28.273929", "format": null, "posted": "2018-03-12T04:27:28.273929", "text": "Maybe once before? It’s been a while since I’ve been on cherubplay and I had to make a new account because I couldn’t remember the password. If we have, sorry that I went MIA on you!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696792, "type": "ooc", "edited": "2018-03-12T04:35:43.897311", "format": null, "posted": "2018-03-12T04:35:43.897311", "text": "(( it's ok! I was worried that something bad happened. I think we did quite a few RPs actually, like one involving Jyushi as a pet for a baseball team and another involving Totoko as a porn star, and another one with Oso being trained like a horse, among other RP scenarios. Do any of those sound familiar? I'm glad you're back btw!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48696889, "type": "ooc", "edited": "2018-03-12T04:39:45.963064", "format": null, "posted": "2018-03-12T04:39:45.963064", "text": "They do actually! Still, sorry about making those grind to a halt. I definitely plan on being able to stick around this time though."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697035, "type": "ooc", "edited": "2018-03-12T04:48:02.116801", "format": null, "posted": "2018-03-12T04:48:02.116801", "text": "(( I'm happy you're back! I'd also be willing to continue at least a few of those with you if you are, since I still have the logs and can send them to you, we can pick them up right where we left off. Again, only if you want to!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697115, "type": "ooc", "edited": "2018-03-12T04:52:42.228294", "format": null, "posted": "2018-03-12T04:52:42.228294", "text": "That sounds great! We’d basically have a whole schedule of RPs to torture these poor boys"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697146, "type": "ooc", "edited": "2018-03-12T04:54:19.205098", "format": null, "posted": "2018-03-12T04:54:19.205098", "text": "(( sounds good to me! which RPs in particular do you want to continue? Do you want me to list them?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697202, "type": "ooc", "edited": "2018-03-12T04:57:33.919382", "format": null, "posted": "2018-03-12T04:57:33.919382", "text": "I’m perfectly fine with continuing all of them if you are actually"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697241, "type": "ooc", "edited": "2018-03-12T04:59:39.480790", "format": null, "posted": "2018-03-12T04:59:39.480790", "text": "And if we ever get an idea for something new we could toss it around and start a new RP"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697308, "type": "ooc", "edited": "2018-03-12T05:03:09.861685", "format": null, "posted": "2018-03-12T05:03:09.861685", "text": "(( awesome! I'd love to continue all of them too! I'll post some stuff in the directory with links to our RPs!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697373, "type": "ooc", "edited": "2018-03-12T05:06:35.152715", "format": null, "posted": "2018-03-12T05:06:35.152715", "text": "Awesome! I’ll start grabbing them up and working on responses"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697676, "type": "ic", "edited": "2018-03-12T05:24:02.794947", "format": null, "posted": "2018-03-12T05:24:02.794947", "text": "The camera focuses on Choro as he tortures himself, constantly switching between positions so he wasn't too uncomfortable for too long. Takeshi moves on to Ichimatsu next, yanking him over to a large dildo on the wall with a metal ring above it.\r\n\r\nThe tape gag is unwound from his mouth, the boxers removed shortly after as Takeshi presses on the back of Ichimatsu's head and forces him towards the dildo.\r\n\r\nTakeshi's friend straps a collar around Ichi's neck, the short leash looping around the hole in the wall and keeping him from pulling away too far from the dildo.\r\n\r\n\"This'll train your gag reflex,\" Takeshi explains as he puts a latex mask over Ichi's head. \"My friend will make sure your properly practicing, got it?\"\r\n\r\nHe straps Ichi's arms behind his back with tape, giving his ass a smack before deciding on the next victim."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48697996, "type": "ic", "edited": "2018-03-12T05:44:49.775910", "format": null, "posted": "2018-03-12T05:44:49.775910", "text": "Having observed his brother’s fates, Ichi feels as though he’s gotten off lightly in comparison before he’s ushered into action. The only thing he’s able to get a good sense of is the dildo serving as his new gag once the mask is placed over the upper half of his face to match Oso and Choro. With the length of the collar, the fake cock is halfway in at the furthest he can pull himself away.\r\n\r\nHe’s also kept standing with his arms folded behind his back as Takeshi’s friend begins his job of forcing his head all the way down the length of the dildo. Ichi’s eyes begin to water as he holds the position for several minutes before being allowed back to the halfway point for a brief moment. Then the cycle repeats itself as he gags on the large dildo.\r\n\r\nJyushi and Kara swallow nervously around their respective gags as Takeshi approaches, knowing by this point not to expect anything pleasant."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48698170, "type": "ic", "edited": "2018-03-12T05:57:00.171677", "format": null, "posted": "2018-03-12T05:57:00.171677", "text": "Takeshi grabs onto Jyushimatsu next, placing him on a chair and tying him up with rope. Once he's satisfied with the bindings, he places the mask on and gets help from one of his friends to hoist him up towards the ceiling from a ring the ropes are tied at. Suspended in the air, Jyushimatsu is helpless as Takeshi starts to whip him.\r\n\r\n\"How are you holding up, Karamatsu?\" He asks between strikes. \"Are you looking forward to your part of the training?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48698432, "type": "ic", "edited": "2018-03-12T06:19:23.038766", "format": null, "posted": "2018-03-12T06:19:23.038766", "text": "Kara’s eyes are wide with fear as he watches his younger brother be hoisted in the air - each of them able to hear the poor boy’s muffled screams with each lash of the whip that leaves behind a bright red mark on his otherwise pale skin. \r\n\r\nThe Matsu shakes his head in protest, unable to tear his eyes away from the scene."}]