[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48698898, "type": "ooc", "edited": "2018-03-12T07:15:29.723778", "format": null, "posted": "2018-03-12T07:15:29.723778", "text": "Two ideas! One for an entirely new RP and the other as one of the videos that the Matsus are in.\r\n\r\n1. RP where one of the Matsus is forced to be someone’s maid - lots of frilly dresses and I was thinking of a set up where they’re locked in a cock cage attached to a long steel bar that is attached to their cuffed hands to limit their movement.\r\n\r\n2. If you don’t mind Matsucest you can divide them into groups of three. Have one Matsu on the ground with a ring gag and a vibrator taped to his bound hands. Another situated to ride the first’s cock and have the vibrator pressed against their cock complete with a cock ring so they can’t cum. The third is situated to have their cock in the first’s mouth and a second vibrator in their ass. To complete the torment the last two have a very short chain between their necks."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48704618, "type": "ooc", "edited": "2018-03-12T19:26:23.028949", "format": null, "posted": "2018-03-12T19:26:23.028949", "text": "(( I really like the new RP idea! As for the video idea, I'd be willing to do that. Perhaps with a shared dildo in the last two's mouth as well? Or maybe their tormentors ring gagging them and forcing them into a kiss while they try to squirm away.\r\n\r\nWould the third Matsu also be affected by the vibrator, a cock ring preventing them from orgasming as well?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48704721, "type": "ic", "edited": "2018-03-12T19:34:47.851493", "format": null, "posted": "2018-03-12T19:34:47.851493", "text": "Takeshi continues to whip Jyushi, covering almost all of his body in red marks as well as pulling on his nipples from time to time. While he does, his friend retrieves Karamatsu, his head shakes in protest futile.\r\n\r\nHe's forced on his knees, head to the floor and ass in the air. His captors repeatedly spank his asscheeks and thighs, one nudging a vibrator inside his ass and starting it up on a high setting.\r\n\r\nAs Takeshi continues to torture Jyushi, his friends force the mask over Kara's head, taping his body to the floor to keep it in place as they spank and play with his ass."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48704979, "type": "ooc", "edited": "2018-03-12T19:54:13.363851", "format": null, "posted": "2018-03-12T19:54:13.363851", "text": "I think you could combine the dildo and the ring gag idea honestly. And the third has the vibrator but no ring because their cock is in the first’s mouth."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48705001, "type": "ooc", "edited": "2018-03-12T19:55:55.239754", "format": null, "posted": "2018-03-12T19:55:55.239754", "text": "(( nice, works for me!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48705105, "type": "ooc", "edited": "2018-03-12T20:03:01.468885", "format": null, "posted": "2018-03-12T20:03:01.468885", "text": "Nice!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48705186, "type": "ooc", "edited": "2018-03-12T20:07:12.943964", "format": null, "posted": "2018-03-12T20:07:12.943964", "text": "I’ll put something in the directory"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48707060, "type": "ic", "edited": "2018-03-12T22:07:29.844475", "format": null, "posted": "2018-03-12T22:07:29.844475", "text": "Kara whines as he’s set upon by the group of men, tearing up as his head is pressed against the hard tiles with only his ass in the air. And it isn’t long before the vibrator turns the pain into pleasure, distracting him long enough for the mask to be applied without complaint and for him to be immobilized on the ground by the tape. There’s just enough give for him to jerk with each slap to his ass and thighs, but other than that Karamatsu can’t move in any direction. \r\n\r\nNow, with the exception of the mummified Oso still moaning behind layers of tape as the wand teases his cock with no hope of release, each of the sextuplets have been blinded by the latex masks and enveloped within their own dinstinct tortures. Various cries of pain and pleasure are captured on the recording as the Matsus are subjected to their first round of torment.\r\n\r\nTotty has cum several more times under the ministrations of the milker attached to his cock, moaning as another batch is collected into the tube. Choro continues rocking back and forth, but ultimately seems to have decided that the pain in his neck is nothing compared to lifting the weights with his nipples. Ichi seems to have gotten the hang of deepthroating the dildo he’s collared to, able to work past his gag reflex and stay down for much longer. And Jyushi continues to squeal as he’s whipped and sways from his suspension bondage."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48707864, "type": "ic", "edited": "2018-03-12T22:59:24.944602", "format": null, "posted": "2018-03-12T22:59:24.944602", "text": "Takeshi's friends take the sight in, the one in charge of the camera focusing enough attention on each Matsu in their various forms of humiliation. Kara's ass and thighs are bright red after countless slaps, Jyushi's body is covered in marks, and all of it is streamed live to an audience of a couple hundred people.\r\n\r\nPointing the camera to Oso's mummified form, Takeshi's friend snickers as the final mask is placed on him, leaving him blind and half-deaf like his brothers.\r\n\r\nThe program continues for twenty more minutes, with viewers leaving dirty comments and suggestions for the next video. Takeshi ends the video with a final message, saying that the boys will stay his playthings for a very long time, and will livestream all their future training sessions.\r\n\r\nThe camera turns off moments later, the milking machine attached to Totty coming to a halt. The pulleys attached to Choro are released, and Jyushi is taken down from the ceiling. Oso's vibrator is removed, along with his clamps, and Ichi's leash is taken off, his head pulled away from the dildo and finally allowing him to breathe more easily. Finally, Kara is unwrapped, the vibrator removed from his ass.\r\n\r\nOso remains in his heavy mummification as the boys are rounded up, forced into the bags they were carried to the studio in. Takeshi and his friends carry them to the car, shoving them in the trunk before driving off to the sextuplets' new home."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48708418, "type": "ic", "edited": "2018-03-12T23:37:32.191444", "format": null, "posted": "2018-03-12T23:37:32.191444", "text": "The brothers take advantage of the small reprieve from their various predicaments - nipples and cocks sore for a multitude of reasons. Kara and Jyushi whimper more than the others as they’re handled and thrown into the trunk, having been through a more rigorous physical ordeal than the rest of their brothers.\r\n\r\nAll blinded and gagged, with the new exception of Ichimatsu who was only the former, they have no way to tell where they’re being transported or have any way to tell how long it takes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48713264, "type": "ic", "edited": "2018-03-13T04:00:55.999030", "format": null, "posted": "2018-03-13T04:00:55.999030", "text": "Once Takeshi reaches his house, his friends help him carry the bags containing the Matsus up to his door, Takeshi unlocking it and urging his friends inside.\r\n\r\nDumping them out on the floor again, one locks the door, not that the Matsus would be able to run off given their bound forms. Takeshi looks them over, smirking as he thinks of what to do next.\r\n\r\nHe settles with wrapping them up in tape, with the exception of the already mummified Oso. Layers upon layers are fastened around their forms, to the point where they can barely budge.\r\n\r\nUsing the opportunity of Ichi's mouth being ungagged, Takeshi kisses him, his friend bringing over a dildo and pushing it into his mouth once Takeshi is done with the kissing."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48713383, "type": "ic", "edited": "2018-03-13T04:07:05.329342", "format": null, "posted": "2018-03-13T04:07:05.329342", "text": "There are four sets of grunts going off through the room as the brothers are put into the exact same situation as their eldest brother. Ichi remains silent despite not being gagged, not wanting to attract any attention or gain their captor’s ire. They’re all blind and deaf to the world around them as they’re put into identical bondage, indingusiable to the outside world except for the colors of the masks over the upper halves of their faces.\r\n\r\nIchi moans through the kiss, pressing back and hoping to gain some favor before the dildo is shoved down to the hilt. Thanks to his earlier training, he barely chokes on the fake cock as it plugs his throat."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48713567, "type": "ic", "edited": "2018-03-13T04:17:38.531059", "format": null, "posted": "2018-03-13T04:17:38.531059", "text": "Takeshi places tape over the dildo's base, wrapping it around to keep it locked inside Ichi's mouth. Then he's laid out on the couch, Takeshi's friends kissing and pulling on his nipples and stroking his cock.\r\n\r\nTakeshi focuses his attention on Totty next, standing him up as he tells his friend to pull out a sleep sack from his room. He plans to punish him for squirming around too much after the mask was first put on, but most of all just wants to hear Totty panic as he's stored away like a precious doll.\r\n\r\nTakeshi puts him inside the tight leather sack, zipping it up almost all the way but leaving a part open to allow him to breathe a little better.\r\n\r\n\"Must be hot in there,\" he laughs as his friend leans him against the wall."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48713681, "type": "ic", "edited": "2018-03-13T04:24:01.967287", "format": null, "posted": "2018-03-13T04:24:01.967287", "text": "Ichi grunts around the dildo as he’s worked to the same levels of arousal Oso had endured earlier - worked up by the attention to his nipples and cock but unable to cum with his balls taped down. It’s a frustrating position to be in and the Matsu hates it as both of his sensitive areas rise to the occasion as they’re lathered with attention. \r\n\r\nTotty squirms as he feels himself being moved. Underneath all the layers of tape it’s hard to tell when he’s being touched but he definitely knows when he’s moved and the temperature begins to rise. Already he can feel himself beginning to sweat as he’s moved again and only able to get the barest amount of air through the holes in the mask."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48713908, "type": "ic", "edited": "2018-03-13T04:37:52.201058", "format": null, "posted": "2018-03-13T04:37:52.201058", "text": "Deciding a complete set of Matsus in sleep sacks would be fun to see, Takeshi and his friend start to place the rest of the Matsus in different sacks - each one with a different color of tape on the outside to differentiate between them. He lines them all up in a row by birth order, saving Ichi for last as his friends are finished playing with him.\r\n\r\nWith all six Matsus locked tight in their mummified and sacked states, Takeshi unzips a small part of the sack to reveal their cocks, the only part that hangs out of the sack. No doubt they're sweating from the tape and leather, but Takeshi can't find it in him to care, more aroused than anything as he heads off to bed.\r\n\r\nHis friends each attach a vibrator to their cocks, using tape to keep it in place and letting them suffer for the rest of the night."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48713986, "type": "ic", "edited": "2018-03-13T04:42:12.260190", "format": null, "posted": "2018-03-13T04:42:12.260190", "text": "The house is full with the muffled moaning of the Matsus throughout the night. With no release available to them the night is a long one as their cocks leak precum and create tiny puddles below each sack. Inevitably the heat causes most of them to pass out during the night when sleep doesn’t come easily and the vibrators keep their cocks impossibly hard."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48720839, "type": "ic", "edited": "2018-03-13T18:49:23.311205", "format": null, "posted": "2018-03-13T18:49:23.311205", "text": "When morning comes, the first thing Takeshi does is check on the Matsus. The vibrators are still buzzing away, puddles of precum underneath each sack. Takeshi heard them moaning throughout the night, but with there being no noise now it's clear that they passed out from the heat.\r\n\r\nHe turns off each vibrator, from oldest brother to youngest, and starts to remove them from their sacks. Totty is the first to come out, Takeshi attempting to shake him awake.\r\n\r\nEyeing the puddle of precum underneath Totty's sack, Takeshi has an idea, unraveling the tape gag and removing the boxers from his mouth. He kisses him deeply, pinching at his nipples before pulling away."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48721239, "type": "ic", "edited": "2018-03-13T19:22:50.217837", "format": null, "posted": "2018-03-13T19:22:50.217837", "text": "Totty starts coming to at the kiss, but doesn’t truly come back to consciousness until his nipples are pinched. With a groan he remembers yesterday’s events when opening his eyes yields no results due to the latex mask. Deaf as he is, he’s able to tell that he’s no longer gagged - though that doesn’t catch his attention as much as he notices that the vibrator is no longer turned on.\r\n\r\n“Please, please let us go,” he begs pitifully, voice starting to waver."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48721351, "type": "ic", "edited": "2018-03-13T19:30:30.712344", "format": null, "posted": "2018-03-13T19:30:30.712344", "text": "Takeshi chuckles at Totty's weak voice, continuing to kiss him deeply for several moments. When he pulls away, he roughly shoves him towards the floor, face-first into his pile of precum. Takeshi's shoe rubs on the back of his head, pressing him deeper towards the floor to urge him into action.\r\n\r\n\"You made this mess, now clean it up. Dirty sluts know how to use their tongues to clean up their filth.\"\r\n\r\nHe knows Totty can't hear him, but Takeshi's degrading words are having an effect on himself, cock rising in an erection."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48721639, "type": "ic", "edited": "2018-03-13T19:52:36.137847", "format": null, "posted": "2018-03-13T19:52:36.137847", "text": "Without the use of his hands to balance himself, Totty falls to the floor with a heavy thump and sobs as Takeshi’s shoe puts a steady pressure on the back of his head. He can’t hear but he’s smart enough to put one and one together when he notices the sticky puddle underneath his cheek.\r\n\r\nHesitantly, he begins to lick up his mess, making a face as the taste clings to his tastebuds. It’s humiliating but it’s better than whatever the alternative is."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48730486, "type": "ic", "edited": "2018-03-14T03:42:58.229565", "format": null, "posted": "2018-03-14T03:42:58.229565", "text": "Takeshi smirks as Totty licks up his own cum. Once he's gotten it all down, he squats down, pulling back on his hair to get a good look at his face.\r\n\r\n\"Such a worthless slut,\" he taunts, putting his head to the floor as he goes back to taking the other Matsus out of their sacks. He positions them on the couch, pinching at their nipples in an attempt to wake them up. Totty remains on the floor, but Takeshi's friends that stayed over for the night have claimed him, playing with his cock and kissing him on the lips.\r\n\r\nHaving taken note of the comments on the previous stream, Takeshi already has an idea of what he wants to do this time around as he cuts open the tape mummifying them, their limbs still bound from the other tape underneath.\r\n\r\nUndoing their gags and removing the boxers (or dildo in Ichi's case), Takeshi waits as his friends bring out some noodles, using chopsticks to put them in the Matsu's mouths.\r\n\r\n\"Eat up, you're gonna need it.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48732546, "type": "ic", "edited": "2018-03-14T05:45:18.215382", "format": null, "posted": "2018-03-14T05:45:18.215382", "text": "Totty whines at the sharp pain his scalp, shrinking into himself the best he can with what movement is available to him once he’s released back to the floor. The relief of being left alone only lasts so long before Takeshi’s friends start to play with his aching cock and he’s forced to kiss each of them, trying the best he can to appease their needs. \r\n\r\nMeanwhile his brothers are slowly coming to after having their nipples pinched. Various protests arise as they’re finally ungagged and taken out of their mummification, but they soon die down in favor of eating their fill of the noodles being fed to them."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48732677, "type": "ic", "edited": "2018-03-14T05:54:33.276634", "format": null, "posted": "2018-03-14T05:54:33.276634", "text": "Once the brothers have been fed enough, Takeshi brings Totty over to the couch as well, snipping away his mummification bondage and allowing him to eat his share of noodles.\r\n\r\nThe brothers aren't ungagged for long, Takeshi's friends forcing ring gags into their mouths in preparation for today's training session. Soon after, they're all stuffed into bags and carried to the car, Takeshi driving them back to the studio.\r\n\r\nOnce they've reached the studio, the Matsus are all dumped on the floor, Takeshi's friends roughly playing with their sensitive areas as the cameras start rolling."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48732773, "type": "ic", "edited": "2018-03-14T06:02:25.674530", "format": null, "posted": "2018-03-14T06:02:25.674530", "text": "All in all, the Matsus are piecing together the cycle without being able to see or hear their new surroundings. There’s metal in their mouths holding them open and allowing drool to spill out over their chests, they aren’t as tightly restricted as they were previously, and they’re traveling to a new location after already having been loaded into the bags and out again twice before. With no way of knowing that their current location is the same studio where their torment began, the masks succeed in their purpose of disorienting their wearers.\r\n\r\nUnaware that they’re being filmed, they’re unrestrained in their reactions in being handled so callously. Totty, cock still sensitive from being milked and spending the night with the vibrator, moans with pleasure while Ichi and Kara remain sullen in their grunted responses, twisting and squirming in unison with the rest of the sextuplets."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48733018, "type": "ic", "edited": "2018-03-14T06:20:52.477646", "format": null, "posted": "2018-03-14T06:20:52.477646", "text": "Takeshi and his friends. having discussed their plans on the car drive up, are on top of things, not wasting any time in preparing the Matsus in the next phase of their sexual torture.\r\n\r\nOso is grabbed from the pile of squirming sextuplets, placed on his back and taped to the floor. As he's bound, a wand vibrator is placed upright on his stomach, soon taped in place.\r\n\r\nKara and Choro are picked out next from the pile, the former placed on top of Oso's cock after the eldest is lubricated. His cock is then fitted with a ring constricting him from orgasm, his member pressed against the wand toy as it's turned on.\r\n\r\nChoro's cock is soon forced into Oso's mouth, a vibrator of his own pushed into his ass before getting a quick smack. One of Takeshi's friends fastens two collars around the younger two's necks, a very short chain connecting them. He laughs at their predicament, pressing their heads together to force them into a kiss.\r\n\r\nThe camera is mainly focused on them, another friend grabbing a double-ended dildo and forcing both ends into their mouths."}]