[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390104, "type": "ic", "edited": "2019-05-24T07:01:28.065961", "format": "raw", "posted": "2019-05-24T07:01:28.065942", "text": "Birthday Time!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390105, "type": "ic", "edited": "2019-05-24T07:01:28.066960", "format": "raw", "posted": "2019-05-24T07:01:28.066941", "text": "From the oldest to the youngest Matsu, today was an extremely special day. The day they were born! They hadn’t changed much in the past year but they had something to look forward to all week leading up to today.\r\n\r\nA special party thrown by some of Totty’s friends.\r\n\r\nThe boys are smiling as they walk into the venue - a club that they hadn’t even heard of before today which meant that it had to be cool. Leaving their coats at the door, the Matsus make their way further into the club in search of their group.\r\n\r\nIt’s kind of a shame that Totty wasn’t able to make the party but her friends all seem excited to see that they made it. Which made sense since they were the guests of honor."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390109, "type": "ooc", "edited": "2019-05-24T07:01:53.795121", "format": "raw", "posted": "2019-05-24T07:01:53.795121", "text": "Hi!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390235, "type": "ooc", "edited": "2019-05-24T07:16:12.137691", "format": "raw", "posted": "2019-05-24T07:16:12.137691", "text": "Any special bondage ideas? I like the idea of them being trapped in present boxes at one point and passed around in a gift exchange to be played with by the guests, along with a \"pin the tail on the donkey\"-like game where they're stuck to a wall and the guests try to clamp their nipples"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390242, "type": "ooc", "edited": "2019-05-24T07:17:22.015708", "format": "raw", "posted": "2019-05-24T07:17:22.015708", "text": "Oh those sound good! \r\nIn the same vein as the idol brigade slop they could have to eat a whole cake by themselves but the icing is their own cum?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390258, "type": "ooc", "edited": "2019-05-24T07:19:36.327440", "format": "raw", "posted": "2019-05-24T07:19:36.327440", "text": "I like that idea a lot!\r\nWhen you say Totty couldn't make it, are you implying that he's already been tricked and trapped?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390267, "type": "ooc", "edited": "2019-05-24T07:21:03.869368", "format": "raw", "posted": "2019-05-24T07:21:03.869368", "text": "Perhaps he's the first \"gift\" they open, which clued them in that something is wrong"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390276, "type": "ooc", "edited": "2019-05-24T07:21:34.888161", "format": "raw", "posted": "2019-05-24T07:21:34.888161", "text": "Oh shit I meant Totoko for some reason but I think that could work"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390284, "type": "ooc", "edited": "2019-05-24T07:22:40.058553", "format": "raw", "posted": "2019-05-24T07:22:40.058553", "text": "Alright no problem! Anything else we should discuss?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390292, "type": "ooc", "edited": "2019-05-24T07:23:48.891987", "format": "raw", "posted": "2019-05-24T07:23:48.891987", "text": "Oh! Their gags could be those party favors that roll out when you blow on them. Other than that, that’s all I have"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390299, "type": "ooc", "edited": "2019-05-24T07:24:34.823592", "format": "raw", "posted": "2019-05-24T07:24:34.823592", "text": "Cute! I'll write a response"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390302, "type": "ooc", "edited": "2019-05-24T07:24:53.714891", "format": "raw", "posted": "2019-05-24T07:24:53.714891", "text": "Kk"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390378, "type": "ic", "edited": "2019-05-24T07:37:05.990765", "format": "raw", "posted": "2019-05-24T07:36:08.695006", "text": "Although Totty considered these people his friends before today, that would all change with this party they planned. Currently, the youngest Matsu is tied up naked inside a big box, sealed with wrapping paper and ribbon. Inside Totty's mouth is a gag filling his throat, a party blower on the outside that would turn any muffled screams into high-pitched whistles.\r\n\r\n\"We're so glad you could make it,\" one of the planners smiles as he lifts up the box containing Totty and places it in front of them. \"It's sad Totty couldn't be here. He was actually helping us with some last minute arrangements, you could say.\"\r\n\r\n\"Here's your first present,\" he says as he nudges it towards Oso. \"I look forward to seeing what you think.\"\r\n\r\nEvery exit door is locked, unbeknownst to the Matsus, to ensure they would stay for the whole duration of the party."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390429, "type": "ic", "edited": "2019-05-24T07:41:37.741703", "format": "raw", "posted": "2019-05-24T07:41:37.741703", "text": "“Happy to be here,” Kara tacks on as his brothers exchange pleasantries with the rest of the attendees.\r\n\r\nThey don’t actually know anyone here, but any friends of Totty’s had to be an okay sort to party with.\r\n\r\n“It’s a shame Totty couldn’t be here,” Ichi comments as the brothers gather around the gift box and Oso lifts the lid.\r\n\r\nFive gasps fill the room as they see the state Totty is in, his party favor gag whistling jovially as he wiggles in his bindings and releases a panicked shout. \r\n\r\n“What did you do to our brother!”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390575, "type": "ic", "edited": "2019-05-24T07:57:43.368113", "format": "raw", "posted": "2019-05-24T07:57:43.368113", "text": "The mood changes immensely as the bound and gagged Totty is revealed, five guests each approaching the other Matsus fron behind and shoving matching gags into their mouths. They hold them still as the one who planned everything speaks up, a cruel smile on almost every guest's face.\r\n\r\n\"You see, your brother made a mistake in trusting us. The real reason we were friendly towards him was because we wanted to humiliate him. And with five equally cute identical brothers, we had to act on it. Thank your sly fox of a brother for the hell you're about to experience.\"\r\n\r\nEach Matsu's wrists are tied behind their backs, guests approaching them with scissors to snip away their clothing. With all of them naked, it isn't long before the five new captives are groped and toyed with mercilessly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390613, "type": "ic", "edited": "2019-05-24T08:02:18.045802", "format": "raw", "posted": "2019-05-24T08:02:18.045802", "text": "The air is soon filled with the sound of plastic crinkling as the gags unfurl and make the loud sound of the party favor rather than whatever protests each of the Matsus had. They feel completely betrayed by the host but there’s nothing they can do as their hands are tied behind their backs and their clothes are snipped away.\r\n\r\nHands on his naked body, Oso is the first to get hard, cock twitching to life between his legs as he shudders and shakes.\r\n\r\nJyushi struggles with the hands groping him, rubbing down his skin and leaving him with a sheen of sweat on his temple as pre starts to leak from the tip of his cock.\r\n\r\nThe other Matsus are soon in very similar states."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390694, "type": "ic", "edited": "2019-05-24T08:14:06.931396", "format": "raw", "posted": "2019-05-24T08:14:06.931396", "text": "The guests watch intently as the Matsus tremble from being molested, taking pictures with their phones to commemorate the moment. Totty is soon pulled out of the box, his handler forcing his head towards his brothers and their torment.\r\n\r\n\"This is your fault, you know,\" he murmurs in his ear. \"If you hadn't fallen for our trap, your brothers wouldn't have been involved in this.\"\r\n\r\nHe gives Totty a kiss on the cheek, soon groping and toying with his body.\r\n\r\n\"We're going to spend the next several hours making sure you and your brothers suffer. Happy Birthday, Totty.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390759, "type": "ic", "edited": "2019-05-24T08:25:05.409157", "format": "raw", "posted": "2019-05-24T08:25:05.409157", "text": "Totty whines as he’s pulled from the box, bound far more tightly than his brothers but looking far more like a kinky present.\r\n\r\nTwo bows are attached to his nipples via clamps and a colorful ribbon is tied around his cock tightly to keep him from cumming. The party favor unfurls several times as his handler speaks to him, struggling when he’s played with so easily.\r\n\r\nNone of the Matsus feel particularly happy to be spending their birthday this way but it doesn’t look like they have much of a choice."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56419040, "type": "ic", "edited": "2019-05-26T03:57:07.778204", "format": "raw", "posted": "2019-05-26T03:57:07.778204", "text": "The man playing with Totty hums as he gropes him, yanking on the bows attached to his nipple clamps.\r\n\r\n\"Struggle all you want, even if you could get out of those bonds, all the doors are locked.\" He chuckles, nibbling on his neck soon after. \"We have lots in store for you and your brothers to celebrate your special day.\"\r\n\r\nJyushi's tormentor notices the precum leaking from his cock and motions others to gather around. Several people gather to grope his body, one leaning down to lick his cock. His nipples are soon given clamps to match Totty's, yellow bows on the ends to color-coordinate."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56452506, "type": "ic", "edited": "2019-05-28T00:50:50.783474", "format": "raw", "posted": "2019-05-28T00:50:50.783474", "text": "Totty screams in pain when the clamps are rugged on, tears welling up in the corners of his eyes as his party favor unfurls with his unhappy cries. \r\n\r\nJyushi follows up with the same series of noises when he’s given his own bow clamps, torn between the sharp pain in his nipples and the pleasure he feels when one of the men lick his cock.\r\n\r\nSeeing the colors of the bows, the other Matsus can only assume that the same treatment is in store for them."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56477024, "type": "ic", "edited": "2019-05-29T06:21:54.923233", "format": "raw", "posted": "2019-05-29T06:21:54.923233", "text": "Sure enough, the other Matsus are given their own colored bows to match, each attached to their nipples and tugged on by their cruel tormentors. Totty's tormentor lives to hear him sob, continuing his rough tugs to his nipples and nibbling his earlobe.\r\n\r\n\"Relax, the hours will fly by before you know it,\" he chuckles. \"We have a lot of fun games for you six, and gifts too. You don't want to miss out on it.\"\r\n\r\nHe gives him a kiss to the cheek, soon returning to tugging on his nipples."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56477084, "type": "ic", "edited": "2019-05-29T06:26:49.562624", "format": "raw", "posted": "2019-05-29T06:26:49.562624", "text": "There’s a resulting cry of pain as each Matsu is subjected to the sharp sting of the nipple clamps. The sensation causes them to squirm even more in their captors’ grasps, making the clamps move even more than just being tugged on and creating an endless loop of pain.\r\n\r\nTotty pants heavily through his party gag, glancing around the room and finding that there are other boxes stacked against the wall and wrapped up that have to be the presents the man is talking about. \r\n\r\nOne cry rises above the rest as Kara strains in his captor’s hold, cumming just from having his nipples tugged and tormented. His face flushed with shame and humiliation."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56477181, "type": "ic", "edited": "2019-05-29T06:36:12.416634", "format": "raw", "posted": "2019-05-29T06:36:12.416634", "text": "The tormentor roughing up Kara laughs as he cums from his touches, yanking back on his hair and pushing his cheek into the puddle of his own cum. The other tormentors sneer, murmuring words of disgust loud enough for Kara to hear.\r\n\r\n\"You'll have a taste of that later, you damn slut,\" he snickers as he rubs his cheek into the floor.\r\n\r\nA few minutes of torment later, a present is brought out of the huge stack. The box is rather long, the group whispering as they realize what it is.\r\n\r\n\"How about Osomatsu opens a present first? It's only fair since he's the oldest.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56477285, "type": "ic", "edited": "2019-05-29T06:44:27.687621", "format": "raw", "posted": "2019-05-29T06:44:27.687621", "text": "Kara’s party favor unfurls, masking a pained hiss as his hair is pulled. It wasn’t even like he had wanted to cum in the first place. It just kind of...happened. He grimaces as he’s pushed to the floor and has his face rubbed in the puddle of his own cum, the substance clinging to his hair as well.\r\n\r\nOso blinks as the box is put in front of him. He has no idea what could possibly be inside but judging by the reactions he probably didn’t want to know. Too bad he didn’t have much of a choice.\r\n\r\nThe other Matsus seem to forget what pain they’re in as well, craning their necks to watch Oso and the present. \r\n\r\nIt’s easily torn paper even without the use of his hands. Not wanting to be humiliated even further, Oso leans forward in his captor’s hold and rubs his cheek against the wrapping until a tear appears that he starts dragging wider by pressing his nose against the box. The rest would have to be done by someone else."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56477375, "type": "ic", "edited": "2019-05-29T06:59:10.342263", "format": "raw", "posted": "2019-05-29T06:59:05.886342", "text": "\"Good boy,\" the one who gave him the box coos before unpacking it. Inside the box is none other than a huge dildo, with a tube of lubricant added as a bonus.\r\n\r\n\"Have you ever put anything in your ass, Oso?\" He asks as he squirts lube on his hand. \"Well, in any case, you're going to be experiencing something quite fun. For us, at least.\"\r\n\r\nHe runs the lube all over the dildo, smirking when two handlers carry Oso over to it. They each lower him slowly onto the dildo, the toy filling him up and stretching him out. It takes some time, but they eventually get him go take all of it up his ass.\r\n\r\n\"I could just eat you up...\" he teases before giving his clamp a yank."}]