[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56479208, "type": "ic", "edited": "2019-05-29T12:52:28.752524", "format": "raw", "posted": "2019-05-29T12:52:28.752524", "text": "Oso swallows nervously. He’s never put anything up his ass, but he’s seen dildos before and this has got to be one of the biggest he’s every laid eyes on - both in length and width. And listening and watching his tormentor only reveals that he’s going to have the honor of having the dildo inside of him.\r\n\r\nLucky him. \r\nHe has to wonder what gifts his brothers will have to open.\r\n\r\nThough he doesn’t spend too much time on it before he’s carried over to the dildo that’s been anchored on the floor. The process is even slower with how he clenches around the toy to try and impede its progress entering him, but eventually he’s sat down on top of it completely, moaning into his gag with his arms bound behind his back. \r\n\r\nAny movement, like the small lurch from having his clamp pulled on, has him bouncing on the fake cock and groaning as loud as he can."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56562037, "type": "ic", "edited": "2019-06-03T05:02:33.172332", "format": "raw", "posted": "2019-06-03T05:02:33.172332", "text": "The captors chuckle at Oso's movements and sounds after he's placed on the huge dildo. Camera lights from phones flash in his direction, the guests eager to capture every moment of the sextuplets' birthday humiliation.\r\n\r\n\"Just listen to those moans,\" one sighs as he records the spectacle. \"Hopefully I'll have a turn with him later when it's time for /that/.\"\r\n\r\nAnother present is brought over, this time in front of Kara as his head is yanked out of the puddle of his own cum on the floor. The shape is a simple box, leaving the gift to be anyone's guess.\r\n\r\n\"Let's take a look at what's inside, hm?\" The man holding the box smirks as he opens it. He smirks as he lifts it up, revealing it to be a golden cock ring.\r\n\r\n\"We know how much you love cool, fashionable things, so I like to think this is a thoughtful gift,\" he says as he slips the ring on Kara's dick all the way down to the base."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56569835, "type": "ic", "edited": "2019-06-03T18:46:53.843459", "format": "raw", "posted": "2019-06-03T18:46:53.843459", "text": "Oso can only drool through his gag as his experience is recorded and photographed. With his arms tied behind his back, he has no way to push himself all the way off and his own attempts leave him riding the dildo, his cock twitching.\r\n\r\nKara grunts as he’s yanked back up, startled but thankful that he’s no longer in a pool of his own cum. He eyes the present wearily as it’s unwrapped, having seen Oso’s present and not wanting to meet the same fate.\r\n\r\nHe’s lucky enough not too, but the tight pressure around his cock is enough to make him want to change his mind pretty quickly. He won’t be cumming again anytime soon but there’s no doubt in his mind that he’s going to want to."}]