[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50907799, "type": "ic", "edited": "2018-07-11T06:25:13.979169", "format": "raw", "posted": "2018-07-11T06:25:13.979169", "text": "Muffled gasps begin to emanate from the hoods, soon turning into surprised shrieks as the dildos begin to randomly thrust into their holes in alternating rhythms. Any fan of theirs would know that none of the sextuplets had even been in a relationship before, much less used something like a dildo.\r\n\r\nBut fans watching the stream being uploaded to their site would probably be too focused on what Kenji was currently filming - six small boxes appearing onscreen to show their faces in real time.\r\n\r\nNoses turned upwards and flattened, eyes partially closed but filling with tears as they began to cry out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50907947, "type": "ic", "edited": "2018-07-11T06:34:05.157960", "format": "raw", "posted": "2018-07-11T06:34:05.157960", "text": "Kenji laughs at the images in front of him, growing harder with each muffled cry that comes from the masks. The girls are completely helpless to stop their abuse, more fans tuning in and watching their torture.\r\n\r\nThe bodyguards even have their own fun with the sextuplets, giving their breasts slaps and rough squeezes while the dildos continue to thrust inside them. They're merciless, treating the girls like dolls as they pinch and pull at their nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50908051, "type": "ic", "edited": "2018-07-11T06:40:38.862799", "format": "raw", "posted": "2018-07-11T06:40:38.862799", "text": "Jyushi is the first to break down, followed closely behind by Totty, as the guards’ rough treatment mixes in with the thrusting dildos. Like their sisters, their arms have been taped behind their backs underneath the first stocking layer - forcing them to all thrust out their breasts. And the stands are far too tall to do anything but stand on their tip toes and take the abuse. \r\n\r\nEveryone watching could see the two youngest siblings dissolve into tears from within their masks as their nipples are tormented and their breasts jiggle with each and every slap."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50926868, "type": "ic", "edited": "2018-07-12T07:38:25.154340", "format": "raw", "posted": "2018-07-12T07:38:25.154340", "text": "Lust overflows Kenji as he watches the youngest sisters cry within their masks, catching it all on the livestream as muffled warbles escape the layers. He wonders when the others will break as the guards continue to molest them, their hands growing grabbier and rougher by the second.\r\n\r\nWith the guards occupied, Kenji takes his time to add to the girls' torment. Brandishing six pairs of nipple clamps, he attaches them in reverse birth order, giving each of their nipples a tug afterwards. The guards use the clamps to their advantage, yanking without mercy while the dildos continue to thrust inside them."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50928303, "type": "ic", "edited": "2018-07-12T12:12:00.913428", "format": "raw", "posted": "2018-07-12T12:12:00.913428", "text": "The pain brought by the nipple clamps serves to renew the girls’ struggling, succeeding only in twitching against the dildos while the guards pull on them. Six pairs of eyes widen in surprise from underneath the masks at the new sensation.\r\n\r\nIchi, Kara, and Choro begin to sob through the abuse with high, keening whines. Leaving Oso as the last Matsu sister to not completely break down into tears."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50941568, "type": "ic", "edited": "2018-07-13T04:34:03.398014", "format": "raw", "posted": "2018-07-13T04:34:03.398014", "text": "Kenji smiles as he watches the Matsuno sextuplets break down into tears, surprised that Oso is still hanging on. Being the leader, he figured she was the most determined. But under these circumstances, it shouldn't take her too long to break under the pressure.\r\n\r\nThe guard molesting her yanks on her clamps, giving her breasts slaps and harsh squeezes. Fed up with her determination, his hand goes up to her mask, pressing against the holes for her nostrils. Oso's air supply is cut off as the dildos continue to thrust, her nipples still receiving harsh treatment."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50941887, "type": "ic", "edited": "2018-07-13T04:49:22.894075", "format": "raw", "posted": "2018-07-13T04:49:22.894075", "text": "Kenji is right. Oso doesn’t have that much left in her to resist the tears threatening to fall. Her facecam shows an expression that’s filled with an almost grim determination despite the abuse, but there are cracks in it that show how much the rough treatment is getting to her.\r\n\r\nThat and the cries of her five sisters. If it were only happening to her, she might be stronger, but she can’t stand to hear their muffled sobbing. She wasn’t just their group leader, she was the eldest. She was supposed to protect her sisters from things like this.\r\n\r\nA pained yelp comes through the gag as the clamps are yanked on again and the pain mixes with the pleasure she’s receiving from the dildos - even if she does hate it. It’s a sound that soon turns into panicked shrieking when her air supply is cut off and she’s left to struggle on the dildos while still enduring the abuse to her nipples.\r\n\r\nQuestioning noises begin to emanate from the other five as they try to figure out what’s happening from noise alone. And even that’s soon replaced by more sobbing as their clamps are continually pulled as well. It’s too much for Oso, who begins crying while trying to yank away and catch her breath."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50942037, "type": "ic", "edited": "2018-07-13T04:57:26.846754", "format": "raw", "posted": "2018-07-13T04:57:26.846754", "text": "Pride washes over Kenji as all six sisters are broken, the facecams showing tears pouring out of their eyes from the constant abuse. Oso's receiving the worst of it, having to deal with a loss of air combined with the dildos and nipple clamps. Her struggles are futile as the guard continues to hold her head in place, the other guards getting inspired as they block off her sisters' air supplies as well.\r\n\r\nThe six sisters are forced to take it, the guard in charge of Oso letting go of her for a brief moment to allow her to catch her breath. But the break doesn't take long, the torture continuing after only a few seconds."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50942247, "type": "ic", "edited": "2018-07-13T05:07:12.685614", "format": "raw", "posted": "2018-07-13T05:07:12.685614", "text": "Each Matsu is suddenly plunged into their own little world, facing the torment on their own without being able to worry about their sisters in the same situation as they’re forced into breathlessness. \r\n\r\nWhen Oso is given release, the only thing she can focus on is taking as many breaths as she can before the holes are plugged again. Now the movement among the girls is a struggle for air given in short bursts.\r\n\r\nKara whines in embarrassment as she feels her own juices between her legs, cumming with the dildo still thrusting between her legs. Ichi is worse off, actually losing consciousness in her panic."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50942630, "type": "ic", "edited": "2018-07-13T05:24:43.972604", "format": "raw", "posted": "2018-07-13T05:24:43.972604", "text": "Dildos still thrust into Ichi's body, her facecam showing off her unconscious face. The guard turns off the dildos before too much time passes, but still slaps and bounces her breasts around.\r\n\r\nKenji notices Kara's mess between her legs, juices spilling down the thrusting dildos. It's enough to make him laugh as the guard keeps torturing her, cutting off her air supply again and again as he slaps her breasts.\r\n\r\nThe chatroom on the livestream is in a buzz, poking fun at the six and their miserable, teary faces. A few of them are worried about Ichi's state, but overall don't seem to have as big of a reaction as one would expect.\r\n\r\nThe livestream goes on for hours, the girls taking more and more abuse as their nipples turn red from the near-constant tugging. Brought to the brink of passing out again and again, the Matsus are completely helpless as they're turned into pathetic playthings for all their fans to see."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50942756, "type": "ic", "edited": "2018-07-13T05:31:31.000024", "format": "raw", "posted": "2018-07-13T05:31:31.000024", "text": "The pain in their nipples is practically unbearable. After some time Ichi seems to regain consciousness when her breasts have been slapped to the point of stinging. Momentarily her panic shows on the cam as she seems to remember where she is and what’s happening to her.\r\n\r\nKara cums twice more as the hours passed, leading the girls in who’s orgasmed more under the treatment. Though Choro and Jyushi aren’t that far behind as they begin to cum.\r\n\r\nIt’s hard to tell if it’s only because of the thrusting dildos or if they’re become acclimated to the rough treatment of their sore breasts.\r\n\r\nIn the end, it doesn’t really matter as they’re all beginning their training as personal fuck toy idols."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50942913, "type": "ic", "edited": "2018-07-13T05:40:10.419993", "format": "raw", "posted": "2018-07-13T05:40:10.419993", "text": "Before the livestream ends, the guards stop the thrusting dildos, allowing the girls to catch a breath before Kenji steps in front of the camera.\r\n\r\n\"The Matsus appreciate your support, and ask for your help in their path to become the most well-trained cock sluts in all of Japan. This was only their first training segment. Tomorrow, these six pets will face even harsher challenges as they climb their way to the top! They'll be waiting to service you!\"\r\n\r\nThe cameras stop rolling, the guards taking the masks off and allowing the girls to hear and see once again. Then the clamps are taken off, their nipples red and sore from the abuse.\r\n\r\nGlancing over them, Kenji looks Ichi in the eye, crouching in front of her with a stern expression.\r\n\r\n\"You're going to be trained even rougher as punishment for passing out,\" he tells her."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50943047, "type": "ic", "edited": "2018-07-13T05:47:01.623062", "format": "raw", "posted": "2018-07-13T05:47:01.623062", "text": "There’s almost a collective sigh of relief from all the girls as the dildos fucking their pussies and asses come to a complete stop. It doesn’t feel great to just be resting on them either, but it’s better than the relentless pace at which they’d been fucked. \r\n\r\nSix tear-stained faces bear shocked expressions as the livestream comes to a close, listening to the fate that awaits them. Japan’s most well trained cock sluts? That couldn’t be true. They had an image to maintain as idols. Surely their fans didn’t possibly think that this was a choice that they would make on their own.\r\n\r\nThey duck their heads as the masks are pulled off, sharing looks with one another for the first time since the video began and they’d been masked in the first place. Tears start falling again as they’re unable to truly comfort one another.\r\n\r\nIchi whines when she’s addressed, trembling in fear at the thought of being punished even as five angry grunts jump to her defense."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50943227, "type": "ic", "edited": "2018-07-13T05:57:03.857551", "format": "raw", "posted": "2018-07-13T05:57:03.857551", "text": "\"Still got fighting spirit, huh?\" Kenji chuckles, reacting to the girls' muffled defense of their sister. \"I love training feisty fucktoys, so this will be fun.\"\r\n\r\nHe gives Ichi a pat to the face, tilting his head as if to mock her.\r\n\r\n\"Poor little kitty... are you tired? Don't worry, you and your sisters will have time to rest in tight, rubber sleepsacks.\"\r\n\r\nThe guards leave the room to retrieve them, leaving Kenji alone with the girls.\r\n\r\n\"You'll still have to wear the tape and stockings, though. The six of you look so shameful with your noses pressed up and flattened like that. What are you, pigs?\"\r\n\r\nThe guards come back with color-coded sleepsacks, unzipping them before lifting the girls off of the stands and placing them inside. Only their heads stick out as they're zipped in, the rubber sacks resembling cocoons as they're laid out on the floor in birth order."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50943376, "type": "ic", "edited": "2018-07-13T06:04:01.633521", "format": "raw", "posted": "2018-07-13T06:04:01.633521", "text": "Ichi closes her eyes, afraid that their new manager will slap her as part of the punishment. Somehow the condescending pat is almost worse than being hit.\r\n\r\nThe girls moan in frustration in response to Kenji’s hurtful words. It wasn’t like they could help their appearance. They hadn’t chosen to be treated like this at all. And it wouldn’t have ever happened if they hadn’t gotten a new manager. \r\n\r\nBut it is a relief to be taken off of the display stands, breasts and pussies sore and aching from the hour or so they’d spent being abused on the livestream.\r\n\r\nExhausted by the ordeal, the Matsus almost immediately fall asleep despite the bondage."}]