[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 48713579, "type": "ic", "edited": "2018-03-13T04:18:05.411559", "format": null, "posted": "2018-03-13T04:18:05.411559", "text": "Jyushi waits with bated breath as he watches the Professor wave Takeru over and begin to speak in a low voice. This was it. The baseball team would get in trouble and he’d be freed. \r\n\r\nThen he hears the man’s verdict and his spirit falls considerably. No way was this real. They couldn’t just let this continue to another student. He’d worked so hard to do good in his classes.\r\n\r\nTears start to fall as the teacher leaves and he’s stared down at by Takeru."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48713742, "type": "ic", "edited": "2018-03-13T04:26:53.225056", "format": null, "posted": "2018-03-13T04:26:53.225056", "text": "Takeru snickers as Jyushi cries, the rest of the team gathering around him to watch.\r\n\r\n\"Look on the bright side,\" Takeru says. \"At least you don't have to worry about failing your classes.\r\n\r\n\"But for trying to rat us out like that? I think you deserve to be punished. You'll spend the rest of the game with nipple clamps on, and then you'll be fucked by the whole team in the storage room.\"\r\n\r\nA member attaches said clamps to Jyushi, weights on the ends as they tug his nipples down."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 48713800, "type": "ic", "edited": "2018-03-13T04:30:06.617713", "format": null, "posted": "2018-03-13T04:30:06.617713", "text": "“Ahn!” Jyushi cries as the clamps are applied, tears coming harder as they’re weighed down. \r\n\r\nBall collecting would be miserable with them swinging back and forth with every movement and he wasn’t looking forward to being fucked by the rest of the team afterward."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48789058, "type": "ic", "edited": "2018-03-17T18:39:17.243839", "format": null, "posted": "2018-03-17T18:39:17.243839", "text": "Takeru snickers, tugging on the clamps and giving Jyushi's ass a smack.\r\n\r\n\"Aw, poor little puppy,\" he taunts, the rest of the team laughing at his tears. \"Those clamps must hurt like a bitch...\"\r\n\r\nTaking a bat in his hand, he gives it to a member and tosses a ball in his direction. Once the bat hits the ball, it's sent flying to the edge of the field, quite a ways away from Jyushi and the team.\r\n\r\n\"Go fetch the ball, pup. If you're not back in three minutes, we'll punish you.\""}]