[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50793447, "type": "ic", "edited": "2018-07-04T20:46:49.894234", "format": "raw", "posted": "2018-07-04T20:46:49.894214", "text": "18+ ONLY\r\n\r\nSo I had an RP partner that disappeared that I miss greatly. I hope they come back at some point, but until then I'll keep posting prompts in hopes that others are also interested.\r\n\r\nThis is a Matsu noncon prompt, with a big emphasis on heavy bondage. I will be playing their captor(s), while you'll be playing at least one Matsu. I usually don't have a big preference for who you play, but at this moment I'm craving a Karamatsu.\r\n\r\nSome of my favorite kinks are mummification, bitchsuits, blindfolds, gags, fear, suspension, nipple clamps, and tons more I don't feel like listing. Feel free to connect if interested!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50793452, "type": "ooc", "edited": "2018-07-04T20:47:17.914656", "format": "raw", "posted": "2018-07-04T20:47:17.914656", "text": "Hey! I’m finally back, sorry about that. Had some medical issues to take care of"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50798601, "type": "ooc", "edited": "2018-07-05T03:16:21.218293", "format": "raw", "posted": "2018-07-05T03:16:21.218293", "text": "(( I'm so glad you're back!! How are you doing?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50798691, "type": "ooc", "edited": "2018-07-05T03:22:42.218956", "format": "raw", "posted": "2018-07-05T03:22:42.218956", "text": "I’m doing a lot better now. Had to start a new e-mail to get into everything so I’ve lost most of our chats, but I should be here to stay unless I need to be in the hospital again."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50798694, "type": "ooc", "edited": "2018-07-05T03:22:49.025337", "format": "raw", "posted": "2018-07-05T03:22:49.025337", "text": "And thanks!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50798925, "type": "ooc", "edited": "2018-07-05T03:38:34.514351", "format": "raw", "posted": "2018-07-05T03:38:34.514351", "text": "(( nice to hear that! I've already been planning ideas for potential RPs in case you ever came back"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50798944, "type": "ooc", "edited": "2018-07-05T03:39:35.629335", "format": "raw", "posted": "2018-07-05T03:39:35.629335", "text": "That’s great! Send them my way and we can totally kick things off!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799039, "type": "ooc", "edited": "2018-07-05T03:45:52.604122", "format": "raw", "posted": "2018-07-05T03:45:52.604122", "text": "(( nice! we could also continue a few RPs, such as the Kara magician one.\r\n\r\nHere's some ideas I had:\r\n\r\n• A Matsu gets arrested for a crime he didn't commit, and is kept as the police pet.\r\n\r\n• A Matsu gets kidnapped and is forced to work for a brothel.\r\n\r\n• A Vampire Matsu is kidnapped by a vampire hunter. Instead of being killed, he's kept as a pet.\r\n\r\n• Angel Matsu's wings get injured and he lands in the yard of a collector, who keeps him locked in a cage and frequently tortured.\r\n\r\n• A Matsu left home alone, only for the house to get broken into by robbers who decide to keep the Matsu as a little prize.\r\n\r\n• A Matsu gets kidnapped by a BDSM cult and is forced to undergo extreme bondage training sessions\r\n\r\n• A Matsu gets assigned under the NEET Correctional Facility, only to discover that it's an institution meant to break people sexually."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50799108, "type": "ooc", "edited": "2018-07-05T03:51:35.183426", "format": "raw", "posted": "2018-07-05T03:51:35.183426", "text": "Oh! These are fantastic! I really like the police pet, vampire, the robbers, and the cult."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799190, "type": "ooc", "edited": "2018-07-05T03:56:55.681824", "format": "raw", "posted": "2018-07-05T03:56:55.681824", "text": "(( thank you! I'd love to start with the vampire one, and we could also make chats for the other ideas you like"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50799383, "type": "ooc", "edited": "2018-07-05T04:09:07.726590", "format": "raw", "posted": "2018-07-05T04:09:07.726590", "text": "I was actually thinking the same thing!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799413, "type": "ooc", "edited": "2018-07-05T04:11:15.984549", "format": "raw", "posted": "2018-07-05T04:11:15.984549", "text": "(( awesome! there's a lot of ideas we could do with the vampire one. only sunlight or stakes can kill them, so the Matsu could be stored away in heavy bondage in a coffin or on display for very long periods of time, only taken out to be played with"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799457, "type": "ooc", "edited": "2018-07-05T04:13:24.225058", "format": "raw", "posted": "2018-07-05T04:13:24.225058", "text": "(( I was also hoping the Matsu could be Ichi in this one, if that's alright"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50799492, "type": "ooc", "edited": "2018-07-05T04:15:37.847484", "format": "raw", "posted": "2018-07-05T04:15:37.847484", "text": "Ichi is the best choice without a doubt! And yeah I think the heavy bondage in a coffin would be super great. Maybe the coffin is on display and is actually clear."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799551, "type": "ooc", "edited": "2018-07-05T04:19:55.241412", "format": "raw", "posted": "2018-07-05T04:19:55.241412", "text": "(( I love that idea! His captor could use a few toys on him to watch him squirm and struggle inside the coffin.\r\n\r\nI'm willing to write the starter, with him transporting Ichi to his mansion"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50799599, "type": "ooc", "edited": "2018-07-05T04:22:01.264171", "format": "raw", "posted": "2018-07-05T04:22:01.264171", "text": "Go for it!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50799805, "type": "ic", "edited": "2018-07-05T04:35:31.981335", "format": "raw", "posted": "2018-07-05T04:35:31.981335", "text": "Ryo prided himself in his job as a vampire hunter. Over the years, he had amassed a large following, with fame and fortune and women by his side. Many vampires feared him, as his kill rate was very high.\r\n\r\nRecently, however, he had started to get bored. The women were pretty, but didn't do much for him these days. What he wanted wasn't a partner, but someone to be his slave. And what better candidate than an immortal vampire?\r\n\r\nThe Matsunov family of vampires were notorious for their deeds, but despite this Ryo had never considered killing them. Truthfully, he found the fourth son, Ichimatsu, the most desirable. So when it came time to choose his victim, Ryo knew who he'd go after.\r\n\r\nIchimatsu didn't go down without a fight. The vampire was strong, but not strong enough to evade Ryo's agility and quick wits. With some difficulty, Ryo had successfully tied up and contained Ichimatsu in a black coffin, chaining it shut before taking it home by carriage.\r\n\r\nWhen he reached his mansion, Ryo carried the coffin up to his door with help from his guards. They carried it to his sex chamber, leaning it against the wall before Ryo unlocked the chains, taking off the top to reveal his captive."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50800596, "type": "ic", "edited": "2018-07-05T05:19:40.645691", "format": "raw", "posted": "2018-07-05T05:19:40.645691", "text": "As an immortal species, vampires did what they could to preserve their prestige and gain favor with the nobles within the community. The Matsunov were no different - other than the fact that they were closer to the top of the social ladder. Infamous among vampires and humans alike, with six heirs to carry the family on for centuries to come.\r\n\r\nIchimatsu was the fourth in line, well known for carrying himself like the vampires that had first made themselves known. His clothes were specially tailored and reminiscent of times long past - though not many saw him when he spent most of his time holed up in his own estate located away mortals and immortals alike. It was bothersome to deal with other vampires one on one and most mortals fell into two categories: food or hunters. And even then hunters often moved into the first category after wasting his time.\r\n\r\nThough not today. The hunter that had visited his home had managed to overpower him, but rather than kill him outright as Ichimatsu had expected he’d been imprisoned in a coffin and transported. To...where he doesn’t know.\r\n\r\nNot even when the lid is removed and he’s able to see the hunter again, hissing angrily and straining against the ropes binding him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50802819, "type": "ic", "edited": "2018-07-05T07:56:39.824218", "format": "raw", "posted": "2018-07-05T07:56:21.322184", "text": "Ryo chuckles at the sight in front of him, delighted to see the vampire bound and helpless. The ropes are tied tightly enough that it would be near impossible to break free, making Ichimatsu completely trapped.\r\n\r\n\"Catching you was quite the challenge, Matsunov,\" he says with a cruel smirk. \"But I always do love a challenge...\"\r\n\r\nRyo leans into Ichimatsu's ear, hand around his neck in a firm grip as he carefully explains his new role to him.\r\n\r\n\"You're probably wondering why I didn't kill you. That's because I wanted to keep a little prize for myself. Starting today, you'll be my personal sex slave.\"\r\n\r\nRyo's grip tightens, the hunter darkly chuckling.\r\n\r\n\"I'm going to have so much fun seeing how much you can handle, my dear pet.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50803841, "type": "ic", "edited": "2018-07-05T12:27:21.673316", "format": "raw", "posted": "2018-07-05T12:27:21.673316", "text": "Ichimatsu cranes his neck, lured in by the scent of blood. More often than not he denied himself the benefits of fresh blood - occupied by more pressing matters. It could partially be why he had been made a target. A vampire was far stronger after feeding and he was known for denying himself the luxury while distracted. \r\n\r\nBut the hand on his neck prevents him from an angle good enough to sink his teeth into Ryo’s. Lucky him really when Ichimatsu wasn’t keen on showing any mercy once he was given the opportunity to tear the hunter to shreds with the level of disrespect being shown to him. \r\n\r\n“Personal sex slave?” He snarls, recoiling back to the coffin and furrowing a brow in confusion. “I think not. You’re not going to be able to hold me for long.” And as far as Ichimatsu knew that was the truth. The hand on his neck was a hinderance in his weakened state but it didn’t hurt."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50807428, "type": "ic", "edited": "2018-07-05T19:09:23.639240", "format": "raw", "posted": "2018-07-05T19:09:23.639240", "text": "Ryo simply laughs at Ichimatsu's comment, pulling away to get a better look at his face. His angry expression does little to deter him, instead making him more eager to begin the training.\r\n\r\n\"You underestimate me,\" he muses, a smug smile tugging at his lips. \"Matsunov, these coming months are going to be /hell/ for you. You'd probably prefer to die, but where's the fun in that? I need a trophy, and you're the perfect candidate.\"\r\n\r\nRyo releases his grip on Ichi's neck, walking over to a shelf lined up with various gags. He hums in thought before deciding on a ring gag, approaching his captive with the gag right in front of his face.\r\n\r\n\"Be a good little slave and open wide,\" Ryo says, already planning out Ichi's torment."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50808477, "type": "ic", "edited": "2018-07-05T20:20:26.049194", "format": "raw", "posted": "2018-07-05T20:20:26.049194", "text": "Ichi’s eyes narrow with irritation as he watches Ryo approach the shelf. If a mere human truly thought that he could break him then he was seriously lacking in common sense. “I’m going to tear you limb fr-ah!”\r\n\r\nIt’s enough of an opening for the ring gag to be cinched into place and quickly fastened."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809485, "type": "ic", "edited": "2018-07-05T21:27:40.625359", "format": "raw", "posted": "2018-07-05T21:27:40.625359", "text": "As soon as he's finished fastening the ring gag in Ichi's mouth, Ryo steps back to examine him, pleased with his work. With his mouth forced wide open, there's no way he can bite him or even form coherent protests, any words reduced to gargles and grunts.\r\n\r\n\"There, that suits you much better,\" Ryo teases, giving him a few rough pats on his pale cheek. \"And that's no way to talk to your master. I'm going to have to punish you for that, my slave.\"\r\n\r\nHe goes back to his shelf, picking up a nearby pair of scissors and approaching the bound and gagged vampire.\r\n\r\n\"Hold still,\" Ryo warns, snipping away the fabric covering his body. \"You don't want to get a nasty cut.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809682, "type": "ic", "edited": "2018-07-05T21:39:45.878948", "format": "raw", "posted": "2018-07-05T21:39:45.878948", "text": "Ichi grunts in protest, still straining against his bonds and snarling through the gag when Ryo pats his cheek. This shouldn’t be happening, not to him. He was stronger and faster than a human and yet he’d been bested and captured. \r\n\r\nKept as a trophy and slave. Unbelievable.\r\n\r\nBut he’s still as Ryo cuts away his clothes, not wanting to take any chances while he was still uninjured."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809832, "type": "ic", "edited": "2018-07-05T21:49:24.032562", "format": "raw", "posted": "2018-07-05T21:49:24.032562", "text": "Once Ryo finishes cutting Ichi's clothes away and his naked body is bared to the cold air, he wastes no time with moving onto the next step.\r\n\r\nRetrieving a pair of nipple clamps from his collection of instruments, Ryo attaches them to Ichi's buds, giving them a sharp tug afterwards. He chuckles at Ichi's defiance, his anger only making him more aroused.\r\n\r\n\"Such a nice body...\" he purrs, running his hands along his waist. \"I can't wait to see it covered in bruises. Which reminds me...\"\r\n\r\nRyo grabs for a riding crop, letting it rest on Ichi's cock. He waits a few seconds, then gives a quick smack against the tender flesh, running it along his length once more."}]