[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50810375, "type": "ic", "edited": "2018-07-05T22:25:09.279825", "format": "raw", "posted": "2018-07-05T22:25:09.279825", "text": "A startled yelp comes from the gag as the clamps pinch at his nipples, the pain turning into a dull ache and turning sharp again when Ryo tugs on them. It’s a situation that Ichi finds hard to keep his composure in.\r\n\r\nHarder still as the crop makes contact with his cock and he jolts in the coffin. Tears start forming in Ichi’s eyes with the building pain."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50817357, "type": "ic", "edited": "2018-07-06T04:46:49.587464", "format": "raw", "posted": "2018-07-06T04:46:49.587464", "text": "Ryo's own cock twitches in his pants as Ichi jerks from the smack, chuckling as he notices the tears in his eyes. It's a delightful sight to him, made even better by his noises when he tugs on the clamps.\r\n\r\n\"What's wrong, Ichimatsu? I thought you were going to tear me limb from limb.\" Ryo is merciless with the swats, teasingly running the crop along almost every inch of his body before letting it come down hard against his skin. A few bruises mark his body, further solidifying his position as little more than a toy.\r\n\r\nRyo tops it off with one last yank to his nipple clamps, harsher than the last few tugs. But he's not quite done with Ichi as he eyes a chair in the middle of the room.\r\n\r\n\"We still have more to do, so stay strong.\" Ryo gives him a few ruffles of his hair, yanking it back for a brief moment before releasing."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50822881, "type": "ic", "edited": "2018-07-06T15:50:57.484785", "format": "raw", "posted": "2018-07-06T15:50:57.484785", "text": "The endurance of a vampire is something to be reckoned with, and Ichi is certainly no different. But it still hurts, and badly. His poor cock is throbbing from the mistreatment and he can’t help but flinch when the crop comes down on less sensitive areas and still leaves behind a lasting sting.\r\n\r\nHe struggles with the clamps as they’re pulled, retreating back into the safe confines of the coffin once he’s released again. \r\n\r\nA glare is shot in Ryo’s direction when he ruffles his hair."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52402891, "type": "ooc", "edited": "2018-10-06T05:26:20.951545", "format": "raw", "posted": "2018-10-06T05:26:20.951545", "text": "Thought we might want to bring this spooky RP back for Halloween?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52402920, "type": "ooc", "edited": "2018-10-06T05:28:57.600281", "format": "raw", "posted": "2018-10-06T05:28:57.600281", "text": "(( absolutely! sorry for leaving it in the dark for a while"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52402956, "type": "ooc", "edited": "2018-10-06T05:32:44.825184", "format": "raw", "posted": "2018-10-06T05:32:44.825184", "text": "It’s fine! We have a lot of RPs going on so I understand completely when some of them go quiet for a bit"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52403129, "type": "ic", "edited": "2018-10-06T05:46:37.087574", "format": "raw", "posted": "2018-10-06T05:46:37.087574", "text": "Ryo looks over his torture instruments as he thinks of what to use on Ichi. Candle wax, plastic bags, and cock rings are just a few of his devices he considers before settling on a taser and dildo. He approaches Ichi's bound form, the taser humming as it charges up.\r\n\r\n\"I'd like to test your gag reflex,\" he explains before shoving the dildo into his forced-open mouth. He allows it to rest for a bit before shoving it in further, thrusting back and forth to fuck his throat.\r\n\r\nSparks fly from the taser soon after as Ryo presses it against Ichi's abdomen and allows electricity to flow through his body. Seconds later, the taser shocks him again, all while his throat is still under assault from the dildo."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52436512, "type": "ooc", "edited": "2018-10-08T06:54:28.259069", "format": "raw", "posted": "2018-10-08T06:54:28.259069", "text": "Sorry I’ll get to replying again soon. I’m going through some stuff"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52449773, "type": "ooc", "edited": "2018-10-09T03:42:59.108563", "format": "raw", "posted": "2018-10-09T03:42:59.108563", "text": "And now I’m good again. Midterms are killing me."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52449970, "type": "ic", "edited": "2018-10-09T03:52:56.491232", "format": "raw", "posted": "2018-10-09T03:52:56.491232", "text": "Ichi’s expression is bordering on predatory as he watches Ryo look over his inventory. If he weren’t tied down into the coffin he would have an easy time making the human regret every decision that he’d made leading up to this very moment. All he really needed was for one opportunity to bite Ryo and suck him dry - something not so easily accomplished while he’s gagged.\r\n\r\nAs is, he’s left choking in surprise when the dildo is shoved through the open ring while he’s lost in thought. There’s no adjusting to the rythm that Ryo has set for the experiment and Ichi’s chin is quickly coated in his own drool as the dildo is thrust back and forth.\r\n\r\nHe grunts around the dildo in pain when Ryo tases him, entire body tensing up as the electricity courses through him and wracks him with pain."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52561977, "type": "ic", "edited": "2018-10-16T04:49:58.546297", "format": "raw", "posted": "2018-10-16T04:49:58.546297", "text": "Ryo doesn't hold back with the shocks or the thrusts, eager to hear every grunt and pained noise from the bound vampire. It's having quite the effect on him - evident through his clothed erection.\r\n\r\nSeveral more shocks course through Ichi's body before Ryo decides he's had enough. He pulls the dildo out of his open mouth, setting the taser off to the side before checking out his other instruments of torture.\r\n\r\n\"Ah, this'll be fun,\" he chuckles as he holds up a cock ring. \"This little toy can vibrate on four different settings, all while preventing you from cumming.\"\r\n\r\nRyo wastes no time in sliding it down onto the base of Ichi's cock, pressing a button on the ring to allow it to spring to life."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52562241, "type": "ic", "edited": "2018-10-16T05:07:31.036029", "format": "raw", "posted": "2018-10-16T05:07:31.036029", "text": "More saliva drips down Ichi’s chin with the absence of the dildo and he takes several deep breaths through the ring gag as he tries to recover from the electricity. It wasn’t nearly enough to actually hurt him but that didn’t make the experience any less uncomfortable over a prolonged period of time. Vampires were resilient creatures to a fault but they weren’t invincible.\r\n\r\nHe glowers at Ryo, not entirely impressed with his newest idea. He’d gotten the gist of what the hunter intended to do with him but with his lack of interest he didn’t see how a cock ring would do that much for him either way. \r\n\r\nIt isn’t until the device starts vibrating that he’s able to understand. Even without being on the highest setting, it doesn’t take too long before Ichi’s cock is erect and downright painful now that the ring is stopping him from cumming. Ichi grinds his teeth against the gag and tries to stifle an open mouthed grunt of frustration."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52562536, "type": "ic", "edited": "2018-10-16T05:29:28.208316", "format": "raw", "posted": "2018-10-16T05:29:28.208316", "text": "Ryo chuckles darkly at Ichi's state and at how helpless he's made him. Another cruel and twisted idea comes to mind that he's quick to act on when he reaches for nose plugs and a rubber mask.\r\n\r\n\"Last I checked, vampires don't technically need to breathe,\" he says as he approaches him. \"You're undead, so you just breathe out of habit and comfort. You'll feel uncomfortable with these, but you'll probably get used to the burning breathlessness after a while.\"\r\n\r\nRyo slips the mask on before speaking again.\r\n\r\n\"And if you don't, I don't really care.\"\r\n\r\nIchi's nostrils are the next to be plugged, leaving him with no way to breathe as the mask seals him in a state of isolation."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52562736, "type": "ic", "edited": "2018-10-16T05:46:16.107052", "format": "raw", "posted": "2018-10-16T05:46:16.107052", "text": "Ichi wasn’t exactly well known for his temper, but he can certainly start to see how his kind got a reputation for being monsterous the more time that he spends with Ryo. The hunter is as infuriating as he is sadistic and Ichi’s struggles become more pronounced the longer his urge to rip the man to shreds goes without action.\r\n\r\nBut the hunter isn’t wrong. He did breathe out of habit than anything else. So he isn’t too worried about the application of the mask and nose plugs. There’s no panic in the lack of air even, just a stillness as Ichi tries not to take in a breath that wouldn’t get him anywhere.\r\n\r\nIt happens eventually, a hitch in his breath when the cock ring’s vibrations come to his attention again. Then Ichi jerks his head irritably as the nose plugs stop him and he’s left to breathing through the ring gag and sucking in the latex mask."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52595156, "type": "ic", "edited": "2018-10-18T03:58:44.103813", "format": "raw", "posted": "2018-10-18T03:58:44.103813", "text": "The sight of Ichi jerking his head sends pleasant chills down Ryo's spine, along with him sucking in the latex mask through his ring gag. The vampire's irritation only makes Ryo more aroused rather than fearful. There isn't much a bloodthirsty creature of the night can do when he's heavily bound and hooded, after all.\r\n\r\nEspecially when Ryo turns up the vibrations to the highest setting. The ring buzzes wildly around Ichi's cock, sending constant vibrations while he's still struggling to breathe.\r\n\r\nMore than anything, Ryo wants to see Ichi suffer."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52719837, "type": "ic", "edited": "2018-10-26T04:57:59.686705", "format": "raw", "posted": "2018-10-26T04:57:59.686705", "text": "Ichi keens through the mask. He wouldn’t have believed anyone if they told him he could suffer so much within the confines of a coffin. His cock is aching with the need to cum the longer the ring is left on its highest setting and his breathing becomes even more erratic as he tries his best to calm himself."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52720022, "type": "ic", "edited": "2018-10-26T05:10:06.841352", "format": "raw", "posted": "2018-10-26T05:10:06.841352", "text": "Ryo chuckles darkly at Ichi's torture, pleasure coursing through him as he sucks in the mask in a struggle for air. His sounds are even better, keening whines and erratic breathing muffled by the latex hood.\r\n\r\n\"Still haven't gotten used to no air?\" He jeers as he yanks on his clamps. \"God, you're like a pathetic little worm. So helpless and useless on your own...\"\r\n\r\nRyo gives him a slap to the chest before pulling away, hands reaching towards the coffin door. Perhaps a little isolation until the next night would teach him his place as a slave.\r\n\r\n\"I'll play with you the next time it's dark out,\" he says as he starts to close the coffin. \"Good night, my little trophy.\"\r\n\r\nWith a final push, he closes the door, but not before chaining up the coffin."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52720105, "type": "ic", "edited": "2018-10-26T05:17:33.875801", "format": "raw", "posted": "2018-10-26T05:17:33.875801", "text": "If Ichimatsu wasn’t already aware of his rising temper, he’d be infuriated by Ryo now. The latex mask doesn’t do much to cut down on his unnaturally keen senses and he heard every word from the hunter’s mouth, punctuated by the yanking on the clamps and his own pained grunts through both the gag and the mask. \r\n\r\nHis unseen eyes narrow and he lets out a hiss when Ryo slaps his chest and closes the coffin door. Left alone inside a coffin is hardly a real threat given his nature, but it’s one of the first times that he’s been left alone with so much stimulus. Ichi is almost too focused on trying to compose himself to hear the coffin being chained shut, but the rattling metal outside briefly catches his attention anyway.\r\n\r\nNot that he can do anything about it until Ryo decides to come release him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52720303, "type": "ic", "edited": "2018-10-26T05:34:35.069781", "format": "raw", "posted": "2018-10-26T05:34:35.069781", "text": "The rest of the night passes uneventfully for Ryo, who can only think about how else he can torture his new slave. As a vampire hunter, he never saw vampires as people, just fun toys to intimidate and kill.\r\n\r\nOr in Ichi's case, intimidate and torture.\r\n\r\nRyo spends the next day buying things at the marketplace, and occasionally receiving words of praise from townsfolk who admired his work. He appreciates it, but all he could think about the entire time was Ichi gasping for breath behind the coffin and mask, vibrating cock ring preventing him from releasing.\r\n\r\nSo when the sun sets and he's back home, one thing is on his mind.\r\n\r\nGoing down to where Ichi is kept, Ryo unlocks the chains and opens the coffin door. A sadistic smile lights his face as he sees his plaything in the exact same position as he left him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52720395, "type": "ic", "edited": "2018-10-26T05:42:21.322779", "format": "raw", "posted": "2018-10-26T05:42:21.322779", "text": "Whilst his usual schedule would include sleeping until the next moonrise, Ichi finds himself in the predicament of spending the next several hours alone and futilely trying to calm himself into some kind of trance. It doesn’t work but by the time that night has fallen, he’s at least managed to get his “breathing” under control.\r\n\r\nHe’s no longer thrashing and in a panic when Ryo opens the lid of the coffin - though the scratches on the side can attest to hours of the exact opposite. Occasionally a moan escapes him while the cock ring vibrates, jolting and groaning again when the nipple clamps move too."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52779307, "type": "ic", "edited": "2018-10-30T05:18:04.231851", "format": "raw", "posted": "2018-10-30T05:18:04.231851", "text": "Ryo couldn't be happier as he examines Ichi squirming in his confined space - an erection of his own taking form as the vampire moans through the rubber mask. He also takes notice of the scratches on the side of the coffin, pleased at the thought of Ichi struggling like a mad animal during the day.\r\n\r\nAs much as he likes seeing Ichi as a faceless toy, he also wants to see his defiant, angry expression under the mask. Ryo takes it off, grinning when he sees his slave's face for the first time since the night before.\r\n\r\n\"Are you ready for another night of training, my little plaything?\" He asks with a tug to his clamps."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52781009, "type": "ic", "edited": "2018-10-30T09:43:31.141259", "format": "raw", "posted": "2018-10-30T09:43:31.141259", "text": "Not even the latex mask and the coffin surrounding him were entirely capable of muffling the sound of the human’s heartbeat. Not when it’s been some time since his last feeding and he’s already been enraged time and time again by Ryo. Ichi wasn’t broken yet, didn’t see himself as a slave to the human’s every desire. That would change given enough time. There isn’t so much as a flinch when Ryo reopens the coffin given that Ichi has known the human’s general location since he’d entered the room.\r\n\r\nHis eyes are cold and angry as the mask is removed, crimson red and pupils narrowed into jagged, reptilian slits. If not for the gag he would be vying to get a taste of Ryo’s blood - not caring whether he bled the hunter dry in one sitting or not. Impossible as that is he still hisses, the sound drawing out into a pained one when Ryo begins messing with the nipple clamps that have been attached to his own since the previous night. \r\n\r\nIchi’s poor buds are aching, the numbness overtaken by a sharp jolt once Ryo pulls on them. Lunging as far as he can with the restraints holding him inside the coffin, Ichi fights to raise his arms to an adequate distance to claw at Ryo - snarling when his attempts are quickly brought to a halt."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52786164, "type": "ic", "edited": "2018-10-30T20:54:17.189091", "format": "raw", "posted": "2018-10-30T20:54:17.189091", "text": "\"You know that your struggles only turn me on more, right?\" Ryo laughs as he slaps Ichi's chest. \"A powerful vampire, turned into a hunter's pathetic sex toy... I can hardly wait to see your transformation.\"\r\n\r\nHe leaves the nose plugs in as he prepares more of Ichi's breathplay torture, sealing his whole head with a plastic wrap that wraps tightly around his ring-gagged mouth and shoves the nose plugs deeper inside. Ichi's face looks distorted as his plugged nose is flattened upwards, mouth sealed shut to prevent any breaths from being taken.\r\n\r\nFinally, Ryo takes the vibrating ring off, awaiting the moment for Ichi to cum after being denied release for so long."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52788527, "type": "ic", "edited": "2018-10-30T23:41:16.634868", "format": "raw", "posted": "2018-10-30T23:41:16.634868", "text": "Ichimatsu flinches as the slap causes the clamps to bounce and tug at his nipples, sending a jolt of pain and pleasure straight up his spine. Matched with Ryo’s words, he can see how dangerous his predicament is for the first time. He was a powerful creature and extremely proud but not particularly strong willed when it came right down to it. He’d be whatever Ryo needed of him right when he needed it if he wasn’t careful. \r\n\r\nHaving already stilled himself in the night to not panic, the plastic wrap addition doesn’t do much at all to make him start panicking anew. However, should he have held a reflection, his distorted face would have humiliated him further. Upright nose, one eye closed while the other was half open, his moans barely muffled by the thin material - plastic wrap entirely too tight for him to try and school his features into a more natural expression.\r\n\r\nAnd when the cock ring is removed...Ichi’s resulting cry borders on near painful as he cums onto his chest and inside the coffin. Even worse, it causes a hitch in his chest that he can only solve by trying to take a deep breath in order to gasp only to be met by the crinkling of the plastic wrap."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52794249, "type": "ic", "edited": "2018-10-31T05:41:41.112397", "format": "raw", "posted": "2018-10-31T05:41:41.112397", "text": "The helpless vampire's distorted face sends pleasure that goes straight to Ryo's cock as it twitches to an erection. His cries of pain as he cums, along with his inability to breathe, is a cherry on top of the cake that is his humiliation.\r\n\r\n\"If only you could see yourself right now,\" Ryo laughs as he gives his nipples another tug. \"You look so disgraceful... not fitting of your kind at all.\"\r\n\r\nRyo grabs onto a riding crop and traces it along his cock, feigning a few swats while he torments him.\r\n\r\n\"I think this role fits you much better,\" he says. \"Tied up as my personal pleasure pet, gagged, unable to do anything while I abuse you in any way I please... wouldn't you agree?\"\r\n\r\nHe lands a first strike on his cock, waiting a few moments before swatting again."}]