[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52794325, "type": "ic", "edited": "2018-10-31T05:47:18.345095", "format": "raw", "posted": "2018-10-31T05:47:18.345095", "text": "Another failed attempt at trying to lunge at Ryo and strike him with his sharp nails and Ichi continues to thrash wildly as the inability to breath mixed with his painful orgasm leads to panic mixed with outrage. \r\n\r\nThe hunter’s face is blurry through the transparent plastic but his words are clear and Ichi didn’t need the advantage of his sight to feel the crop on his dick again. \r\n\r\nKeening in pain, Ichi’s tongue works against the plastic wrap as he tries to speak through the gag. Trying to agree with him wholeheartedly, anything to get him to stop."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52794995, "type": "ic", "edited": "2018-10-31T07:09:56.174714", "format": "raw", "posted": "2018-10-31T07:09:56.174714", "text": "Despite Ichi's attempts to get Ryo to stop, the sadistic hunter doesn't let up for a moment. The desire to further torment his captive is overwhelming, to the point where he can't see anything past his lust. He /needs/ to break him, to make him into the perfect pain slut. It would take a while, but he's more than willing to train him until that day arrives.\r\n\r\n\"Beg all you want, I'm still going to use you however I like,\" Ryo says as he gives him several swats to his cock. \"Someone like you doesn't deserve mercy. You only exist to be a slave now.\"\r\n\r\nWith a final swat, Ryo discards the crop for a moment to unzip his pants. His cock is fully erect as he strokes himself off, aiming towards Ichi's chest.\r\n\r\n\"Put on a show for me. Struggle and scream with all your might and I might give you a small break.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52795047, "type": "ic", "edited": "2018-10-31T07:17:40.896563", "format": "raw", "posted": "2018-10-31T07:17:40.896563", "text": "Each swat of the riding crop to his cock is a sharp jolt of pain that incentivizes Ichi to do whatever it takes to get Ryo to stop. It’s too much for the extremely sensitive area and the last few hits hurt worse as his cock actually works itself into another erection - leaving Ichi confused as to whether or not he was actually enjoying the treatment. \r\n\r\nIt’s not a question he has to think about for long, not when Ryo mentions the reward of a small break in exchange for debasing himself further. A more resolute vampire would refuse, Ichi sees it as a fair trade.\r\n\r\nHe’s quickly able to work himself into a frenzy simply by focusing on his breathing and trying to go through the motions when he knows he won’t be able to do so. His neck jerks wildly, head cracking against the coffin and one open eye rolling back as he rattles the chains keeping him locked inside."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52836618, "type": "ic", "edited": "2018-11-03T05:44:38.187582", "format": "raw", "posted": "2018-11-03T05:44:38.187582", "text": "The humiliating spectacle in front of Ryo sends him into a frenzy as he strokes himself off. Ichi's wild, desperate thrashing and the rattling of the chains eventually gets Ryo off, who shoots his load all over Ichi's chest within minutes.\r\n\r\n\"Such a good little slave,\" he sighs as he gives him a light tug to his nipples. \"I suppose you'll get that break now. But don't think that I'll be taking that plastic wrap off. That disgraceful face fits you too well... fresh air is a privilege that a lowly slave like you doesn't deserve.\"\r\n\r\nHe removes the clamps, but not before giving them another sharp tug.\r\n\r\n\"How does it feel, being locked away like this with no chance of escape?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52837750, "type": "ic", "edited": "2018-11-03T07:17:34.790782", "format": "raw", "posted": "2018-11-03T07:17:34.790782", "text": "Disgusting. It’s the first thing that comes to Ichi’s mind when Ryo cums on him. He’s also a realist. Unless he was freed from the coffin he’d likely have to get used to such treatment. Could someone ever possibly become accustomed to that? The vampire doesn’t want to find out.\r\n\r\nInstead, he dwells on what Ryo would consider to be a reward.\r\n\r\nIchi regains his composure after a few tries, ruined twice more as the human pulled on the clamps. They’d been on for over twenty-four hours at this point and there was a dull pain in his chest that came back sharply when the clamps are removed.\r\n\r\nThen he regards Ryo silently, unable to respond to his question."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53146061, "type": "ic", "edited": "2018-11-22T08:07:10.437471", "format": "raw", "posted": "2018-11-22T08:07:10.437471", "text": "Ryo takes a minute to look over every part of Ichi's pale body. The ring gag strapped tightly in his mouth. The plastic wrap denying him air. His poor nipples that had been clamped for over a day.\r\n\r\nEven with all this torture and restriction, Ichi's eyes still hold the same anger and defiance as they had the night before.\r\n\r\nRyo gazes into Ichi's one open eye as he approaches him, calloused hands running gently over his sore nipples. A sadistic smile tugs at his lips when he gives them a light pinch, exhaling against Ichi's sealed face.\r\n\r\n\"You know, I think a lot of my followers would love to see you like this,\" he chuckles. \"A brooding, bloodthirsty creature of the night, chained up and on display... what do you think, my plaything?\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53205382, "type": "ooc", "edited": "2018-11-26T05:53:18.290446", "format": "raw", "posted": "2018-11-26T05:53:18.290446", "text": "(( you doing alright?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53363190, "type": "ooc", "edited": "2018-12-06T18:28:43.620148", "format": "raw", "posted": "2018-12-06T18:28:43.620148", "text": "Yes sorry I’m fine? Had a pretty busy last half of the semester"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53365586, "type": "ooc", "edited": "2018-12-06T22:20:50.050890", "format": "raw", "posted": "2018-12-06T22:20:50.050890", "text": "(( ok good! I just wanted to make sure everything was ok"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53366393, "type": "ooc", "edited": "2018-12-06T23:19:43.548139", "format": "raw", "posted": "2018-12-06T23:19:43.548139", "text": "Yeah it’s fine sorry to worry you again. I’ll get to replying after I fix up a website for a final project"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53367333, "type": "ooc", "edited": "2018-12-07T00:39:55.034639", "format": "raw", "posted": "2018-12-07T00:39:55.034639", "text": "(( got it"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53369909, "type": "ic", "edited": "2018-12-07T03:25:18.661700", "format": "raw", "posted": "2018-12-07T03:25:18.661700", "text": "Arguably, Ichi would prefer to not be seen in such an uncouth state. It would add even further humiliation to the fact that he’d been overpowered and captured, completely at Ryo’s mercy until he grew bored of him. He hates even more that his methods are productive.\r\n\r\nIchi is one part pained and one part pleasured with every encounter, no matter how much he’d prefer to resist. \r\n\r\nOn the other, having guests might cause Ryo to let his guard down and give him a chance to escape. All he had to do was play nice and allow the hunter to underestimate him.\r\n\r\nHe keens beneath the plastic wrap and shivers underneath Ryo’s touch. The latter action far from an act as his sore nipples are toyed with."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53426884, "type": "ic", "edited": "2018-12-11T00:35:19.297888", "format": "raw", "posted": "2018-12-11T00:35:19.297888", "text": "Ryo chuckles as Ichi keens through the plastic wrap, giving him a quick slap to the chest.\r\n\r\n\"Such a beautiful creature, all mine to enjoy... I'l schedule the party for tomorrow night, then. Until then, we'll have our fun tonight.\"\r\n\r\nHe gives a kiss to the plastic wrap sealing Ichi's open mouth and strokes his cheek, giving the bound vampire a cruel smile.\r\n\r\n\"If you beg for me like a good little slave, I might let you breathe properly. While you don't deserve the comfort of air, I have other uses for that mouth of yours.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53427429, "type": "ic", "edited": "2018-12-11T01:04:29.008784", "format": "raw", "posted": "2018-12-11T01:04:29.008784", "text": "Tomorrow then, tomorrow would be his best possible window to escape or feed. Either one would work. Escaping was optimal but feeding would give him the strength needed to make another attempt.\r\n\r\nHe just needed to play along. Ichi whines through the gag again, pressing the plastic wrap against Ryo’s lips when the hunter kisses it. He could pretend to be a good slave at least for a night, especially if it meant being able to breath without the hindrance of the plastic wrap or nose plugs.\r\n\r\nNot knowing what Ryo might have in store for the other uses of his mouth, Ichi fights his bonds again to raises his hands like he has before. Except instead of a clawing motion, they’re held with his claws curled inward in a universal display of begging."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56302820, "type": "ic", "edited": "2019-05-19T05:35:34.721812", "format": "raw", "posted": "2019-05-19T05:35:34.721812", "text": "Ryo smirks down at Ichi as he begs for him. The fact that he's reduced the proud vampire to a bound, disgraced plaything sends arousal to his cock yet again as he pokes holes in the plastic wrap covering his mouth.\r\n\r\n\"Feels a lot less constricting, hm?\" He chuckles as he tears open the remainder of the plastic, taking out the nose plugs afterwards. \"Being able to breathe after being denied for so long... that must bring you joy.\"\r\n\r\nRyo kisses him on the cheek, giving him a sadistic grin before unravelling the chains binding him.\r\n\r\n\"Don't get your hopes up, these chains aren't going away,\" he says as he yanks him on the floor and wraps the chains around his arms behind him. \"I still don't trust you, and you need to be strictly bound at all times.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56303397, "type": "ic", "edited": "2019-05-19T06:28:13.757252", "format": "raw", "posted": "2019-05-19T06:28:13.757252", "text": "Ichi draws in a shallow breath when a hole is made in the plastic wrap. He didn’t even need to breathe in order to survive, but the experience is so ingrained into his system from his mortal days that being deprived of it nearly scares him senseless. Vampires were durable creatures and everything that Ryo’s done to him is less than what it would take to actually harm one of his kind. Though it’s everything he needed to completely debase Ichi and turn him into a wheezing mess.\r\n\r\nThe hunter is right. Breathing is so much easier without the nose plugs obstructing his ability to do so and Ichi takes in several deep breaths while Ryo presses his lips to his cheek and frees him of the chains keeping him inside the coffin.\r\n\r\nHe doesn’t even have the time to take advantage of this new found freedom before he’s forcibly shoved out and falling to his knees, arms immediately chained behind his back. Ichi looks up to Ryo, drool spilling out of the open gag."}]