[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46995674, "type": "ic", "edited": "2017-12-14T09:32:37.420354", "format": null, "posted": "2017-12-14T09:32:37.420329", "text": "((18+ ONLY))\r\n\r\nOkay, so I need someone to indulge me in a few of my rarer kinks. These kinks are bitchsuits, cock milking, and mummification. If you could indulge me in at least one of those kinks as a Matsu in a noncon RP, I'd love that a lot!\r\n\r\nI have a few ideas for scenarios and pairings as well. They are:\r\n\r\n1. Oso/Choro: Oso gets fed up with Choro acting all high and mighty, so he ties him up, gags him, and humiliates him.\r\n\r\n2. Any/OCs: One or more Matsus get kidnapped and taken to a cock milking farm.\r\n\r\n3. Any/OCs: One or more Matsus get kidnapped and put into a petplay slave training program (bitchsuits required)\r\n\r\n4. Totty/OCs: Todomatsu gets invited to a mixer by a cute girl, but soon discovers it's a trap when he's trussed up, gagged, and taken to a strange place.\r\n\r\n5. Any/OC - That's Gakuen Musical AU - Matsu gets kidnapped by bullies and humiliated\r\n\r\n6. Any/Akumatsu - Akumatsu materializes in a new body and has his way with one of his \"brothers\"\r\n\r\n7. Oso/OC - Oso gets caught cheating at a casino and gets interrogated. After admitting to it, he basically becomes the casino's whore for paying customers.\r\n\r\nIf you have any other ideas, feel free to share!\r\n\r\nMy kinks include heavy bondage, shibari, struggling/thrashing, gags (!!!), bitchsuits (!!), suspension bondage, nipple clamps, begging, toys, double/triple penetration, humiliation, degradation, crying, recording, blindfolds, latex, public use, spanking, mummification bondage, orgasm denial, fucking machines, overstimulation, drool/saliva, electricity, cock milking, breathplay, and likely more! Hard no's are are anything unsanitary, gore, vore, pregnancy, bestiality, or death.\r\n\r\nI await your connection!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46995678, "type": "ooc", "edited": "2017-12-14T09:33:50.524395", "format": null, "posted": "2017-12-14T09:33:50.524395", "text": "Rare kinks be damned, I’d love to do anything involving bitch suits and mummification - cock milking is definitely an added bonus."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46997242, "type": "ooc", "edited": "2017-12-14T14:10:00.808993", "format": null, "posted": "2017-12-14T14:10:00.808993", "text": "(( hi there! glad to hear that, my friend!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46997905, "type": "ooc", "edited": "2017-12-14T15:38:19.551942", "format": null, "posted": "2017-12-14T15:38:19.551942", "text": "Two and three definitely have a lot of potential in my mind if I’m being perfectly honest - but I’d love to see either one mixed with five."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 46998834, "type": "ooc", "edited": "2017-12-14T16:57:42.650712", "format": null, "posted": "2017-12-14T16:57:42.650712", "text": "(( nice! we can try to do some pet play training stuff with the musical AU!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 46999296, "type": "ooc", "edited": "2017-12-14T17:33:30.101702", "format": null, "posted": "2017-12-14T17:33:30.101702", "text": "That sounds great!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 47000127, "type": "ooc", "edited": "2017-12-14T18:52:15.317765", "format": null, "posted": "2017-12-14T18:44:54.694213", "text": "(( glad to hear that! anything else to discuss? (( kinks, etc.?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47000574, "type": "ooc", "edited": "2017-12-14T19:22:59.512872", "format": null, "posted": "2017-12-14T19:22:59.512872", "text": "Well I definitely love the required bitchsuits for pet play and everything you have listed pretty much hits all my kinks"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47000935, "type": "ooc", "edited": "2017-12-14T19:51:32.595219", "format": null, "posted": "2017-12-14T19:51:32.595219", "text": "(( yay! glad to hear you're into all of that!\r\n\r\nso who would you want to play?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47002258, "type": "ooc", "edited": "2017-12-14T21:18:37.181427", "format": null, "posted": "2017-12-14T21:18:37.181427", "text": "How about Kara?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47002268, "type": "ooc", "edited": "2017-12-14T21:19:00.836171", "format": null, "posted": "2017-12-14T21:19:00.836171", "text": "(( sounds good to me!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47002382, "type": "ooc", "edited": "2017-12-14T21:24:45.582659", "format": null, "posted": "2017-12-14T21:24:45.582659", "text": "Awesome!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47003155, "type": "ooc", "edited": "2017-12-14T22:15:48.380787", "format": null, "posted": "2017-12-14T22:15:48.380787", "text": "(( anything else you want to discuss?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47003176, "type": "ooc", "edited": "2017-12-14T22:17:42.171873", "format": null, "posted": "2017-12-14T22:17:42.171873", "text": "I think we’re good to go actually"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47009829, "type": "ooc", "edited": "2017-12-15T04:03:26.750112", "format": null, "posted": "2017-12-15T04:03:21.066737", "text": "(( alright! I will write the starter asap"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47009928, "type": "ooc", "edited": "2017-12-15T04:07:45.697771", "format": null, "posted": "2017-12-15T04:07:45.697771", "text": "Sounds fun!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47010078, "type": "ic", "edited": "2017-12-15T04:14:42.096881", "format": null, "posted": "2017-12-15T04:14:42.096881", "text": "Karla Pinefield was a geek among geeks. Danny and his friends were fully aware of this, often spending their free time bullying the young man. Stuffing him in lockers, dumping food on him during lunch, tripping him in the hallway... those were just a few of the things they'd do to humiliate him.\r\n\r\nHowever, this was a new low for the group of three boys. Summer break was just about to start, and the three were looking forward to making sure Karla would never forget his little vacation.\r\n\r\nMaking sure no one was around, they snuck into the audio visual room, where Karla was playing his CDs. Two of Danny's cronies tiptoed over to him, one holding a large bag and a cloth. His headphones were in, so it'd be unlikely that he'd hear him.\r\n\r\nAs soon as he was close enough, the bully shoved the cloth into Karla's mouth, while the other pushed him into the bag and tied it closed. Escaping out the back of the building, the three threw Karla into the back of Danny's truck, driving off to his apartment."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47010275, "type": "ic", "edited": "2017-12-15T04:24:37.646010", "format": null, "posted": "2017-12-15T04:24:37.646010", "text": "Summer break was one of the longer vacations wherein Karla could enjoy a reprise from the ceaseless bullying he endured at the hands of Danny and his two cronies. And with it being the last day of school, he was perfectly content to squirrel himself away in the AV room until the final bell. Everyone knew it was his favorite hiding place, but even Danny wasn’t stupid enough to try anything when there was a possibility of a teacher catching him in the act.\r\n\r\nUnfortunately, the teacher had gone to get his lunch without telling Karla - who under normal circumstances would have found some place else to take cover until the school day came to an end. Leaving the geek unaware as he listens to his music through headphones before a cloth is shoved into his mouth. He’s in the bag before he can even properly panic, stunned left clueless to his future destination as he thrashes about in the back of the truck.\r\n\r\nSomething he ceases to do once the vehicle starts moving and he’s tossed from side to side - no use in giving himself a concussion trying to escape."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47010590, "type": "ic", "edited": "2017-12-15T04:38:28.027205", "format": null, "posted": "2017-12-15T04:38:28.027205", "text": "The three bullies soon reach Danny's apartment, the quick arrival helped by them speeding far above the limit. Danny stops the truck, his two buddies exiting the vehicle to pull Karla's writhing body from the back. He's still trapped tight in the bag, the two hoisting him up to the front door as Danny opens it, the door already unlocked.\r\n\r\nThe two throw Karla onto the floor, Danny grabbing a roll of tape while the two dump his body out of the bag. They don't even give him an option to squirm away before Danny grabs onto his arms, the other two keeping his legs spread open.\r\n\r\n\"Hey, Pinefield,\" he snarls in his ear. \"Enjoying summer break so far?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47010974, "type": "ic", "edited": "2017-12-15T04:58:57.352067", "format": null, "posted": "2017-12-15T04:58:57.352067", "text": "“I most certainly am not!” He insists loudly, trying and failing miserably to break out of their grasp. In all the commotion his glasses have gone askew, leaving his vision blurry as he glances around the apartment wildly. There’s not much that catches his eye, but that doesn’t mean much when he’s having trouble seeing anything that isn’t right in front of his face.\r\n\r\nHe’d argue more vehemently but after years of putting up with Danny, he’s fairly certain that he won’t be able to communicate the fact that kidnapping is definitely something you don’t want to do if you want to go anywhere in life."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47011166, "type": "ic", "edited": "2017-12-15T05:09:24.586188", "format": null, "posted": "2017-12-15T05:09:24.586188", "text": "\"Aw, such a shame...\" Danny laughs as his grip tightens around Karla. \"Well, Pinefield, if you're not going to enjoy it, then my buddies and I might as well.\"\r\n\r\nHe looks up to one of his friends, who's still holding open his legs. \"Hey, do you think you could get a pair of scissors and that latex suit in my room? I think Pinefield here needs to get used to his new position over the summer...\"\r\n\r\nThe crony gets up to leave, returning minutes later with the promised scissors and suit.\r\n\r\n\"That thing's called a bitchsuit, Pinefield,\" he explains. \"And this whole summer, you're going to be my little bitch. I got some more stuff in my basement I'd like you to see... but we'll get to that later.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47011339, "type": "ic", "edited": "2017-12-15T05:18:27.786298", "format": null, "posted": "2017-12-15T05:18:27.786298", "text": "Karla writhes in place once the number of jocks holding him down is reduced to two rather than three. He’s still unable to get himself free, but he can at least pride himself in giving it a shot when he knows that Danny would probably be more than capable of subduing him on his own if he really wanted to.\r\n\r\nLooking to the latex suit, the nerd’s brows furrow in confusion. He isn’t the tallest person by any means, but even whatever it is that Danny wants to put him in doesn’t look big enough to fit his frame properly. \r\n\r\n“How do you even think that this is going to work out for you when I turn up missing?” He asks quickly, clearly stalling for time in order to put off whatever was about to happen for as long as he possibly can. “Furthermore, I’m not going to be anyone’s bitch.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47011620, "type": "ic", "edited": "2017-12-15T05:31:02.757127", "format": null, "posted": "2017-12-15T05:31:02.757127", "text": "Danny rolls his eyes. \"Like anyone gives two shits about you, Pinefield,\" he taunts, his friend coming closer to him with the bitchsuit. \"Besides, we'll probably break you before anyone even notices you're missing.\"\r\n\r\nThe other goon is handed the pair of scissors, snipping away at Karla's clothes. His chest is barred to the three, followed by his stomach and boxers. With one final snip, his boxers are cut off, showing off his cock.\r\n\r\nThe suit is placed in front of Karla, the four slots for his arms and legs to slide into smaller than his limbs.\r\n\r\n\"Get in the fucking suit, Pinefield,\" Danny orders as he forces his arms into a folded position and shoves him towards it. \"Or you arent gonna like what I'll do with these scissors.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47011780, "type": "ic", "edited": "2017-12-15T05:38:05.735563", "format": null, "posted": "2017-12-15T05:38:05.735563", "text": "The thing is, Karla doesn’t doubt for a second that Danny could do something entirely cruel with just a pair of scissors - which should have been a good enough reason to keep the jock from anything remotely sharp in the first place. And once his arms are folded, elbows pointed towards the floor and hands secured against his shoulders, he can see exactly how he’s supposed to fit inside of the bitchsuit.\r\n\r\nAnd at this point it’s a better alternative to being completely naked in front of the three young men. \r\n\r\nDucking his head in shame, Karla crawls forward into the suit and puts himself into the proper position by lining up his knees and elbows. Judging by the material, it’s going to be a tight fit that’ll force him into all fours without any hope of stretching out his limbs."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012128, "type": "ic", "edited": "2017-12-15T05:55:45.877384", "format": null, "posted": "2017-12-15T05:55:45.877384", "text": "The three fasten him inside, keeping him sealed tight in the latex casing as it covers his body, sans his nipples and part of his ass.\r\n\r\n\"That's a good little bitch,\" Danny sneers, giving him a smack on the ass. \"You're going to be in there for a very long time, so let's see how well you can move around for us.\"\r\n\r\nHe gives him another smack to the ass, followed by another moments later. Danny hopes the pain will urge him to wiggle forward, effectively humiliating him."}]