[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012327, "type": "ic", "edited": "2017-12-15T06:05:07.640321", "format": null, "posted": "2017-12-15T06:05:07.640321", "text": "The parts of his skin that Karla can still feel air on don’t give the geek any hopes about his predicament. His nipples and ass are the only bared parts once he’s sealed inside the suit, a mask stretching tightly over his face and effectively cutting him off from the outside world and his cock pressed tightly against his abdomen.\r\n\r\nKarla can feel himself flushing with shame and humiliation, but he finds that the latex suit is capable of muffling the outside world - though he does yelp at the harsh smacks to his bare ass and stumble forward.\r\n\r\nIt’s an awkward process all in all, moving in the suit. But it’s better than getting spanked by his classmate and motivates him to crawl forward on his elbows and knees in a sort of wiggling motion that only propels him a few centimeters at a time."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012473, "type": "ic", "edited": "2017-12-15T06:15:36.000423", "format": null, "posted": "2017-12-15T06:14:59.747652", "text": "\"Aw, such a cute little slut...\" Danny teases as the rubber-covered Karla wiggles and squirms forward. \"I'll bet you can't even hear me, with that mask covering that loser face of yours.\"\r\n\r\nHe gives him another smack to the ass as he scoots along the floor, enjoying his new toy's humiliation. The other two push him onto his back as they begin playing with his nipples, rubbing his bulge against the rubber covering in an effort to tease him.\r\n\r\n\"So pathetic,\" Danny sneers as his nipples are yanked on and teased."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012551, "type": "ic", "edited": "2017-12-15T06:20:53.796891", "format": null, "posted": "2017-12-15T06:20:53.796891", "text": "If struggling was difficult before, Karla is loathe to admit that it’s worse now that his movement has been so severely restricted. There’s little he can do other than paw at the air with his shortened limbs and even then he’s no where close to making contact with the other males. Squirming turns into twitching as his nipples and trapped cock are toyed with mercilessly - Karla panting heavily from behind the rubbery mask."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012590, "type": "ooc", "edited": "2017-12-15T06:23:21.487875", "format": null, "posted": "2017-12-15T06:23:21.487875", "text": "What do you think of some public use where the boys take a trip to another town and have their new pup on display everywhere they go or even take him into a dog park to play with the other mutts?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012605, "type": "ooc", "edited": "2017-12-15T06:24:19.167613", "format": null, "posted": "2017-12-15T06:24:19.167613", "text": "(( I love that idea a lot!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012636, "type": "ooc", "edited": "2017-12-15T06:27:12.579206", "format": null, "posted": "2017-12-15T06:27:12.579206", "text": "His collar could even be under the name “Carla” just because he’s their bitch and whatnot"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012654, "type": "ooc", "edited": "2017-12-15T06:29:24.006585", "format": null, "posted": "2017-12-15T06:29:24.006585", "text": "(( yess!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012721, "type": "ic", "edited": "2017-12-15T06:35:54.868427", "format": null, "posted": "2017-12-15T06:35:54.868427", "text": "Danny watches on as his friends play with the new pet, taking in the sight of his twitches and heavy breathing.\r\n\r\n\"He wants to cum, doesn't he?\" One of the cronies asks as he rubs the bulge through the rubber.\r\n\r\n\"Probably, but there's no way we're letting him cum yet,\" Danny says, taking out his phone to snap a few pictures of Karla.\r\n\r\n\"How can he even breathe in there?\" The other guy asks, pinching the small holes on his mask. \"I wanna see how long he lasts without getting panicky.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012744, "type": "ic", "edited": "2017-12-15T06:39:16.885952", "format": null, "posted": "2017-12-15T06:39:16.885952", "text": "Not very long.\r\n\r\nKarla probably lasts less than a minute before he starts to thrash wildly. There isn’t a lot of air that’s capable of coming through the mask but what is there is too precious to waste by being deprived of air. It apparently isn’t enough to be humiliated by the three, he also needs to be tortured."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012891, "type": "ooc", "edited": "2017-12-15T06:55:37.709969", "format": null, "posted": "2017-12-15T06:55:37.709969", "text": "What do you think about this continuing on after summer vacation is over? The search for Karla goes dead after the first couple months and Danny and his pals are more than willing to provide the school with a new mascot"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47012897, "type": "ooc", "edited": "2017-12-15T06:56:18.818402", "format": null, "posted": "2017-12-15T06:56:18.818402", "text": "(( oh, I like that a lot!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47012928, "type": "ooc", "edited": "2017-12-15T07:00:52.372620", "format": null, "posted": "2017-12-15T07:00:52.372620", "text": "Thanks!\r\n\r\nAnd by that point Karla is probably a well trained pet for Danny and the school’s missing student is right under everyone’s noses."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47013041, "type": "ic", "edited": "2017-12-15T07:14:33.280578", "format": null, "posted": "2017-12-15T07:14:33.280578", "text": "The goon pulls away before too much time passes, laughing to himself.\r\n\r\n\"Fuck, that was hot...\" he sighs before going back to rubbing at the bulge in the latex. \"I think I'm gonna like our new pet, Danny.\"\r\n\r\nDanny chuckles as he watches his friends continue to humiliate Karla, their hands groping harder and more desperately around him.\r\n\r\n\"If you guys wanna fuck him, I've got some lube in my bedroom,\" Danny suggests, the two running to his room in a haze of lust.\r\n\r\nThey come back, positioning themselves in a line in front of Karla as they strip down and lube up, the one in front grabbing onto his folded legs and jamming his cock inside him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47013158, "type": "ic", "edited": "2017-12-15T07:31:38.204254", "format": null, "posted": "2017-12-15T07:31:38.204254", "text": "Not having an idea of his surroundings anymore is nearly as panic inducing as not being able to breath. Only muffled voices are able to penetrate the latex and even then there’s very little he can do to piece together what’s being said. The only relief he knows is when the hands move away from his bulge and stop the furious stroking as if he were a dog receiving belly rubs.\r\n\r\nAnd even that’s soon replaced by hands on his legs and a cock in his ass. He’s smart enough to not start moving away, knowing that he’d probably be more likely to impale himself further on whoever’s currently fucking him.\r\n\r\nNevertheless, his back does arch at the entrance, arms pawing at the air again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47025612, "type": "ic", "edited": "2017-12-16T03:13:43.797268", "format": null, "posted": "2017-12-16T03:13:43.797268", "text": "The three bullies laugh as Karla's arms wiggle in the air, the one currently fucking him giving him a few smacks to the ass. His thrusts soon pick up speed, desperate to cum inside of him and humiliate him further.\r\n\r\nAnd sure enough, he releases, flooding Karla's ass with his seed. He buries himself deeper inside, groaning before he pulls out, cum leaking out of his exposed hole.\r\n\r\n\"Such a slut,\" he taunts, giving Karla a quick pinch to his nipples. \"Hey Danny, is it okay if we use one of your vibrators on the new pet? I pulled one out of your room.\"\r\n\r\n\"Hell yes, let's do that.\" Danny watches as his friend nudges a small vibrator connected to a remote inside Karla's ass as it still leaks out cum. Pressing a few buttons, the vibrator whirs to life, buzzing and rubbing against Karla's anal walls."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47025771, "type": "ic", "edited": "2017-12-16T03:22:46.258112", "format": null, "posted": "2017-12-16T03:22:46.258112", "text": "If not for the mask, Karla’s muffled sobs would be going full force with every thrust and slap, and he can feel the tears running down his cheeks. This can’t be happening.\r\n\r\nBut it is, and there’s cum leaking out of his ass as soon as the other’s cock finally leaves him open. It’s a short relief though as the vibrator is left inside his hole.\r\n\r\nAt least with the cock their were brief moments of clarity brought on by thrusting and being treated so roughly. With the vibrator there’s only a constant thrum inside of him that leaves Karla blissed out and whining in a matter of seconds."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47026017, "type": "ic", "edited": "2017-12-16T03:34:57.874017", "format": null, "posted": "2017-12-16T03:34:57.874017", "text": "Danny records Karla with his phone as the vibrator buzzes inside of him, his friends turning it up to the highest setting.\r\n\r\n\"Fucking pathetic,\" Danny sneers. \"Just listen to those whines. You really are a little bitch, huh, Pinefield?\"\r\n\r\nHis friends continue to assault his nipples, leaning down to nibble and lap at his buds in-between their pinches.\r\n\r\n\"Hey, Danny,\" one of the goons says as he continues playing with Karla. \"What do you say we give our little bitch a yummy treat? I was thinking he'd like a taste of my cock.\"\r\n\r\n\"Sure thing. Just be sure to put the mask back on when you're done.\" Danny watches as his friend takes off the mask, lowering himself down into Karla's mouth.\r\n\r\n\"Don't even think for a second to bite, bitch,\" he says."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47026206, "type": "ic", "edited": "2017-12-16T03:44:50.322186", "format": null, "posted": "2017-12-16T03:44:50.322186", "text": "Even with spending such a short amount of time in the suit itself, Karla looks wrecked when the mask comes off. There are visible signs of crying and his hair is a matted mess that gives the total opposite impression of the put together geek that he usually is. And even if he had the presence of mind to bite - instead of being focused on the vibrator still going full force in his ass - Karla is just cognitive enough to know he’d probably be too afraid to do something so rash when he’s in such a helpless state.\r\n\r\nHis chest heaves as he breathes around the cock in his mouth, thankfully aided by his position on his back and reduced to minimal chocking as the length slides to the back of his throat. Still hoping for the best, he does what he can to quicken the process.\r\n\r\nLapping his tongue over the other’s cock, Karla sucks at a steady pace - hips occasionally bucking as the vibrator works away at his ass and brings no relief to his bulge of a cock within the suit."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47026445, "type": "ic", "edited": "2017-12-16T03:54:17.233352", "format": null, "posted": "2017-12-16T03:54:17.233352", "text": "The bully groans as Karla's tongue laps over his cock, thrusting down the geek's throat mercilessly.\r\n\r\n\"Aw, what's wrong, bitch?\" Danny teases as his friend fucks his throat. \"Suit too tight for you? You want to cum? You haven't earned it, Pinefield. Just be a good little bitch and let us use your holes.\"\r\n\r\nHis friend pants as he continues thrusting, tugging onto Karla's hair as he fucks his throat. Danny's phone records every thrust from his friend, and every heaving breath from their pet, before cum finally releases down Karla's throat and the bully pulls away."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47026719, "type": "ic", "edited": "2017-12-16T04:05:07.512166", "format": null, "posted": "2017-12-16T04:05:07.512166", "text": "Karla gives Danny a sideways glance as his throat’s fucked, drool spilling out of the corners of his mouth as the cock works its way in and out ruthlessly. It doesn’t carry any sort of particular expression other than the glazed over look of someone trying to mentally escape when physically isn’t possible.\r\n\r\nDazing off only results in him nearly choking on cum once the bully releases his load. Coughing weakly, some of the cum joins the saliva drying on his face before he swallows down the remainder.\r\n\r\n“P-please let me go,” he begs quietly, quickly coming to tears once again as he looks to the three jocks."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47027041, "type": "ic", "edited": "2017-12-16T04:21:00.381509", "format": null, "posted": "2017-12-16T04:21:00.381509", "text": "The trio only laughs as Karla quietly sobs, Danny approaching his latex-bound body with a smirk on his face.\r\n\r\n\"Nah, I don't think we're going to,\" he says as he wipes away the cum and drool off his face. \"It's what you get for being such a fucking loser, Pinefield. You're going to be our slut until we get bored of you.\"\r\n\r\nHe pats him on the cheek, wiping away a few tears as they trail down his cheek.\r\n\r\n\"Besides, we have a lot of plans for you,\" he continues. \"Tomorrow, my buddies and I are going out of town for a walk and we'd love to show you off. After that, well... we have the rest of the summer to decide what kind of fun we'll have.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47027221, "type": "ic", "edited": "2017-12-16T04:31:45.819311", "format": null, "posted": "2017-12-16T04:31:45.819311", "text": "A walk. That would mean going out in public where people could see him. It’s enough to induce another round of panic - though he doesn’t beg and plead like he wants to. They couldn’t possibly risk taking him outside if his identity wasn’t concealed given the fact that they’d kidnapped him so it was likely that he’d at least be granted anonymity if they took him for a walk.\r\n\r\nWorse is the thought of spending his entire summer as the boys’ plaything - something he doesn’t doubt to be true for even a second.\r\n\r\nKarla bites his lower lip and squeezes his eyes shut as he’s brought just to the edge of an orgasm by the vibrator, back arching before the feeling dies down again as the suit is too tight."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47027426, "type": "ic", "edited": "2017-12-16T04:41:58.420745", "format": null, "posted": "2017-12-16T04:41:58.420745", "text": "The bullies notice Karla's predicament as his back arches, not able to achieve orgasm due to the tightness of the suit on his cock.\r\n\r\n\"Aw, look at that. Little Karla can't cum. So sad...\" Danny doesn't feel the least bit of pity for the latex pet as his orgasm is denied, even stroking the bulge of his suit to mock him.\r\n\r\n\"You wanna cum, don't you, Pinefield? Go on, tell us how much you want it, and we might give it to you.\"\r\n\r\nThe rubbing on his bulge continues, Danny's friends giving him a few nipple pinches to humiliate him further."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47027501, "type": "ic", "edited": "2017-12-16T04:46:08.729813", "format": null, "posted": "2017-12-16T04:46:08.729813", "text": "Karla’s face flushes red with shame as he shivers with need - practically vibrating out of his skin once Danny starts to rub at the bulge and his nipples are toyed with.\r\n\r\nThat being said, he’s starting to get antsy as he pants and gasps with the vibrator still going at him with its highest setting.\r\n\r\n“Cum...p-please let me cum!” He states quickly, nearly tripping over his own tongue as he begs for release."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47035869, "type": "ic", "edited": "2017-12-16T20:07:05.316200", "format": null, "posted": "2017-12-16T20:07:05.316200", "text": "Despite the begging, Danny and his friends have no plans to let him cum yet, although they still want to see him humiliate himself.\r\n\r\n\"That's not good enough, Pinefield,\" Danny says with a cruel grin. \"You've gotta do better than that. Go on, tell us what you are to us and how much of a worthless slut you are, or you aren't gonna cum for the whole summer.\"\r\n\r\nThe rubbing at his bulge intensifies, along with the twists and pulls at his nipples."}]