[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47036282, "type": "ic", "edited": "2017-12-16T20:37:46.412323", "format": null, "posted": "2017-12-16T20:37:46.412323", "text": "Karla bites his lower lip, trying to resist the urge to break down crying right then and there. Submitting to their demands couldn’t lead to anything good, but all the attention on his sensitive areas were driving him to desperate measures as he starts to pant heavily. \r\n\r\n“P-please, please. I...I’m your bitch, a useless slut that no one is going to notice is gone,” he cries once his will breaks."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47036389, "type": "ic", "edited": "2017-12-16T20:44:51.102062", "format": null, "posted": "2017-12-16T20:44:51.102062", "text": "\"That's right... no one's going to notice you're missing, and if they do, they won't give a shit,\" Danny drives the point home by giving him a smack to the chest, the rubbing on his bulge not letting up for a second.\r\n\r\n\"And by the way... we're not going to let you cum until you can show us what a good little pup you are on our walk tomorrow. So stay still and let us play with you some more.\"\r\n\r\nHe kisses Karla on the lips, hands cupping his cheeks as his friend takes over the position of stroking the bulge."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47036492, "type": "ic", "edited": "2017-12-16T20:51:48.610024", "format": null, "posted": "2017-12-16T20:51:48.610024", "text": "Tears start streaming from his eyes again as he starts sniffling, squeezing them shut while he’s kissed and trying to ignore the hands on his bulge and the constant buzzing in his ass.\r\n\r\nThere’s not much he can do to mentally escape the situation with the vibrator acting as a constant distraction interrupting his thoughts as he’s toyed with by the three bullies."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47042631, "type": "ic", "edited": "2017-12-17T03:10:41.932981", "format": null, "posted": "2017-12-17T03:10:41.932981", "text": "After several minutes of toying with Karla's body, the three get bored, talking amongst themselves about what to do next.\r\n\r\n\"Hmm, maybe we should just leave him like this?\" One suggests as he rubs at the bulge in the latex.\r\n\r\n\"That works for me,\" Danny says, leaning into Karla's ear.\r\n\r\n\"My buddies and I are gonna go out for a bit,\" he growls. \"In the meantime, feel free to enjoy yourself.\"\r\n\r\nHe picks up the mask and adjusts it over Karla's head, muffling his hearing and blocking his sight once more. The three leave the apartment, driving off in Danny's car with some tasks in mind."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47045930, "type": "ic", "edited": "2017-12-17T05:54:49.224867", "format": null, "posted": "2017-12-17T05:54:49.224867", "text": "Karla opens his mouth to protest, but stops himself short when he decides that being left alone might be in his best interests. No need to make the bullies think that he actually wanted them around.\r\n\r\nThere would need to be a balance though, he thinks after a moment. They could just decide to leave him stranded like this with no possible way of freeing himself. And if he seemed too dependent...well, they could just keep him around to play with for as long as they wanted.\r\n\r\nAnd neither fate seemed too appealing.\r\n\r\nLeft to his own devices, Karla strains against the suit - still left at the mercy of the vibrator. At some point he’s able to rock himself over onto his stomach and get back to his knees and elbows. He doesn’t have it in him to try to escape when he’s blinded, but at the very least he can inch his way around his new environment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47054225, "type": "ic", "edited": "2017-12-17T20:30:40.570121", "format": null, "posted": "2017-12-17T20:30:40.570121", "text": "The three return around thirty minutes later, each carrying something that they bought for Karla. Danny holds onto a leash, while his two friends carry in two dog bowls, a water bottle, and a collar with the name \"Carla\" on it. They notice that Karla had managed to rock onto his knees and elbows, slowly inching his way around the room as the vibrator keeps on buzzing away.\r\n\r\n\"We're back, Pinefield,\" Danny announces before ripping off the mask, allowing him to hear once more. \"We got some stuff for your stay, and for the walk tomorrow.\"\r\n\r\nHis friends lay out the bowls on the floor, one pouring a bottle of water into one of the bowls.\r\n\r\n\"Wanna drink, Pinefield? You must be parched...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47057192, "type": "ic", "edited": "2017-12-17T22:52:54.960034", "format": null, "posted": "2017-12-17T22:52:54.960034", "text": "Karla blinks at the influx of light, adjusting to the quick change as he stares up at the trio with reddened eyes from crying. Choosing not to respond verbally, he crawls closer to the bowl well aware of how even simple things like drinking are going to play out from now on.\r\n\r\nOn his knees and elbows like a dog.\r\n\r\nDucking his head, Karla starts lapping at the water eagerly - quickly in an effort to sate his thirst."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47064774, "type": "ic", "edited": "2017-12-18T04:24:31.060610", "format": null, "posted": "2017-12-18T04:24:31.060610", "text": "The trio stifle a few laughs as Karla laps up at the water, just like a proper pup. When he's done, Danny clicks the collar around his neck, but not before showing his new pet the name printed on the tag. His friend is kind enough to turn off the vibrator, but it's more of a way to save battery rather than to show Karla mercy.\r\n\r\n\"God, you must want to cum so bad,\" Danny whispers into Karla's ear. \"We'll have to wait until tomorrow, won't we?\"\r\n\r\n\"Lots of people are going to see you, you know,\" one of his friends chimes in. \"They're going to see you crawling around in all fours like a little bitch, and you can't do anything about that.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47065572, "type": "ic", "edited": "2017-12-18T04:59:56.644991", "format": null, "posted": "2017-12-18T04:59:56.644991", "text": "Karla lets out a sigh of relief as the vibrator is turned off but still left inside him. No doubt he would feel surprisingly empty after having it in for such a long period of time. The collar makes him blush with embarrassment and humiliation - fearful of exactly how the walk tomorrow would go. \r\n\r\n“...How...how are you going to justify having a person on a leash in broad daylight? I can just call for help and say that I’ve been kidnapped.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47065777, "type": "ic", "edited": "2017-12-18T05:07:53.873288", "format": null, "posted": "2017-12-18T05:07:53.873288", "text": "\"You know that we can always gag you, right?\" Danny scoffs. \"And besides - people in the town we're visiting are a bit more... relaxed about this sort of thing, you could say. Don't worry your pretty little head about it.\"\r\n\r\nHe pats him on the cheek, moving behind to give him a smack on the ass.\r\n\r\n\"If you even think about trying to cause a fuss, we'll make you regret it. Don't try anything funny.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47069409, "type": "ic", "edited": "2017-12-18T10:13:53.962387", "format": null, "posted": "2017-12-18T10:13:53.962387", "text": "“Look, it’s only been a couple of hours. Please, let me go. It makes sense from any angle you look at it. The amount of trouble you’ll get in for kidnapping is practically insane,” he starts to bargain - tone creeping to the levels of patronizing fact giving that made Karla such an easy target for bullying.\r\n\r\nIt was fairly easy to hate a know it all.\r\n\r\nHis ass clenches at the slap, squeezing around the vibrator left in the poor hole."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47072012, "type": "ic", "edited": "2017-12-18T17:01:26.417637", "format": null, "posted": "2017-12-18T17:01:26.417637", "text": "\"Oh, shut the hell up, Pinefield,\" Danny snaps back. \"You think we've never broken the law before? We know what we're doing to make sure we won't get caught, so stop being such a goody two-shoes about this.\"\r\n\r\nHe gives another smack to his filled ass, running his hand over the bulge in the latex once more.\r\n\r\n\"Just think of how good it's going to feel when you finally cum tomorrow... all you gotta do is be a good little pup for us, and we'll reward you.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47081091, "type": "ic", "edited": "2017-12-19T01:40:26.563090", "format": null, "posted": "2017-12-19T01:40:26.563090", "text": "He tucks his head down, closing his eyes and trying to ignore the attention on the bulge. By nature, Karla wasn’t a very sexual person but every time he even thought about his cock now or it was stroked through the latex he felt the need to cum in a way he didn’t think he could. \r\n\r\n“Okay, okay, I’ll be good,” he whines pathetically."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47082091, "type": "ic", "edited": "2017-12-19T02:18:15.456346", "format": null, "posted": "2017-12-19T02:18:15.456346", "text": "Danny laughs. \"That's a good little bitch.\"\r\n\r\nHis hand pulls away from the bulge, tracing over to Karla's nipples and running over them teasingly.\r\n\r\n\"Nobody's going to even notice you're missing,\" he repeats, tugging at his buds. \"They might not even go looking for you. You're just a pathetic slut, belonging to the three of us.\"\r\n\r\nHe pulls away from Karla's nipples, giving him a few pats on the cheek.\r\n\r\n\"It's starting to get a little late, isn't it? We should be showing you to your cage soon.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47085017, "type": "ic", "edited": "2017-12-19T04:13:53.392797", "format": null, "posted": "2017-12-19T04:13:53.392797", "text": "Cage. He’d be caged like an actual animal during his captivity - just when he thought he couldn’t get any lower than crawling on the floor and eating out of bowl like a dog.\r\n\r\nBut he’s exhausted and protesting would only put off the inevitable. \r\n\r\nKarla pads forward, tag on his collar jingling with each movement. “Which way is it?” He asks defeatedly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47085428, "type": "ic", "edited": "2017-12-19T04:31:12.190207", "format": null, "posted": "2017-12-19T04:31:12.190207", "text": "Danny motions towards his bedroom across from them, opening the door wider to reveal a nicely sized room. Danny's bed is against the wall, while a cage sits nearby, only a few feet away.\r\n\r\nHis friend give Karla a smack on the ass in an attempt to urge him forward, Danny turning on the lights. The room is a bit plain, a few sports team posters decorating the room here and there.\r\n\r\nHe opens the door to the cage after unlocking it, giving Karla a cruel smile as he beckons him closer with his finger."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47085714, "type": "ic", "edited": "2017-12-19T04:43:59.221142", "format": null, "posted": "2017-12-19T04:43:59.221142", "text": "Karla clenches around the vibrator again at the slap, yelping and picking up his pace as he barrels into the room. Another benefit of the cage aside from a place to rest was the fact that the boys wouldn’t be able to have such direct access to his body.\r\n\r\nHe looks up to Danny expectantly before padding slowly into the cage and turning himself around."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47085918, "type": "ic", "edited": "2017-12-19T04:54:28.515930", "format": null, "posted": "2017-12-19T04:54:28.515930", "text": "With Karla in the cage, Danny closes the door, locking him up and placing the key on the night stand next to his bed.\r\n\r\n\"If you make too much noise while I'm trying to sleep, I'm putting on the mask and turning the vibrator back on. So don't even think about it.\" He kicks the cage, rattling it.\r\n\r\n\"My buddies are gonna stay the night, so they'll keep a watch on you.\" He nods to his friends, one holding the remote to the vibrator, the other holding the latex mask.\r\n\r\n\"If they want to do anything to you, I'm not going to stop them. So keep that in mind.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47088501, "type": "ic", "edited": "2017-12-19T08:09:27.084911", "format": null, "posted": "2017-12-19T08:09:27.084911", "text": "Karla regards Danny’s friends wearily. All in all, they were far more likely to do something outrageous when Danny was asleep - as much as he was loathe to admit it, the jock was a sensible leader that was able to keep his cronies in line as long as they were within range of one another.\r\n\r\nThey certainly don’t look like they’re going to bed.\r\n\r\nSettling onto his side, the nerd closes his eyes. If they were going to mess with him through the night he needed to grab as much sleep as he possibly could or risk being irritable in the morning. Being rewarded like a dog also meant he could be punished like a dog."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47098546, "type": "ic", "edited": "2017-12-20T00:18:24.637312", "format": null, "posted": "2017-12-20T00:18:24.637312", "text": "With the rules in place, Danny settles off to sleep within an hour, his friends playing video games in the next room over. After playing for a while, the jocks lurk quietly into Danny's room, one holding onto the vibrator's remote, tenother onto the mask. Then, without too much warning, they flip the switch, activating the vibrator still inside Karla's ass.\r\n\r\nCreeping closer to the cage, the two turn the vibrator up even higher, until it reaches as high as it can go.\r\n\r\nThen the cage is unlocked, the bully holding the mask inching it closer to Karla's head."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47124552, "type": "ooc", "edited": "2017-12-21T04:50:38.486113", "format": null, "posted": "2017-12-21T04:50:38.486113", "text": "(( how are you?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47317867, "type": "ooc", "edited": "2017-12-31T09:55:52.497602", "format": null, "posted": "2017-12-31T09:55:52.497602", "text": "Got sick sorry"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 47317900, "type": "ic", "edited": "2017-12-31T10:00:49.291275", "format": null, "posted": "2017-12-31T10:00:49.291275", "text": "For a while, Karla keeps a careful watch on the door until he can barely keep up the effort to hold his head up. It isn’t long before he dozing off into a short lived rest - jolted awake by the vibrations in his ass. He does his best to keep quite so as not to wake Danny, and is actually thankful for the mask to muffle the sounds once he’s able to inch towards the open door.\r\n\r\nThey wanted to play, fine. As much as he doesn’t want to, Karla figures playing into their expectations will get them to leave faster.\r\n\r\nWith this in mind, he lowers his head and raises his ass in the air - wiggling playfully on the floor like an excited puppy."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 47321436, "type": "ic", "edited": "2018-01-04T19:20:52.271394", "format": null, "posted": "2017-12-31T18:10:27.323496", "text": "The two bullies snicker as they watch Karla's movements. As one leads Karla out to the other room, the other prepares his phone to record him as he wiggles forward along the floor.\r\n\r\n\"Our pup's a little playful tonight,\" one chuckles, turning off the vibrator and removing it from Karla's hole once they've left Danny's room.\r\n\r\n\"I'll go first,\" the other says, slipping off his pants and applying lubricant to his dick. With a smack to the ass, he enters Karla, thrusting hard and as deep as he can go while the other records him with his phone."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47403023, "type": "ooc", "edited": "2018-01-04T19:16:05.792495", "format": null, "posted": "2018-01-04T19:16:05.792495", "text": "(( you doing alright?"}]