[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50806007, "type": "ic", "edited": "2018-07-05T17:15:06.038979", "format": "raw", "posted": "2018-07-05T17:15:06.038947", "text": "((18+ ONLY))\r\n \r\nHey, it's the person who's been posting all those ososan noncon prompts, and I'm back again with a masterpost of ideas that I've had! You will be playing the Matsu(s), while I'll be playing their captor(s).\r\n\r\n1. Osomatsu gets told by a stranger at a horse race that he lost a bet to that there's a secret to always winning at the horse races, but he has to sign a contract to learn in. Oso accepts without reading it, but soon finds out that may have not been the best choice. The secret to always winning at horse races? Become the horse! Oso becomes a slave to a group of strangers and is forced to race against other slaves, all while in pony bondage gear. Lots of \"training\" would be very fun!\r\n \r\n2. One or more of the brothers gets kidnapped by a group of men and is forced to be publically used and humiliated.\r\n \r\n3. One or more of the brothers gets kidnapped and kept as a group of men (or women's) personal sex slave(s).\r\n \r\n4. Choromatsu goes to a Nyaa-chan concert and gets jumped in the bathroom, forced to be used publically by a bunch of horny fanboys who want to humiliate other fans to prove they love Nyaa-chan more.\r\n\r\n5. A monster girl kidnaps one or more of the Matsus and keeps them as her pet(s). Would /love/ tentacle or slime stuff.\r\n\r\nMore ideas will likely be added! My kinks include heavy bondage, shibari, struggling/thrashing, gags (!!!), bitchsuits (!!), suspension bondage, nipple clamps, begging, toys, double/triple penetration, humiliation, degradation, crying, recording, blindfolds, latex, public use, spanking, mummification bondage, orgasm denial, fucking machines, overstimulation, drool/saliva, forced exercise (like being forced to walk on a treadmill), and maybe more! Hard no's are anything unsanitary, gore, vore, pregnancy, bestiality, or death. If you would rather not include a specific kink or have other ideas, let me know!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50806018, "type": "ooc", "edited": "2018-07-05T17:16:14.514370", "format": "raw", "posted": "2018-07-05T17:16:14.514370", "text": "Hey! I’m up for us doing the Choromatsu at the concert"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50807433, "type": "ooc", "edited": "2018-07-05T19:09:41.935906", "format": "raw", "posted": "2018-07-05T19:09:41.935906", "text": "(( alright, awesome!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50807624, "type": "ooc", "edited": "2018-07-05T19:22:10.053531", "format": "raw", "posted": "2018-07-05T19:22:10.053531", "text": "Also you probably already knew but I’m the one that usually connects with you. At least to my knowledge"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809306, "type": "ooc", "edited": "2018-07-05T21:16:54.492144", "format": "raw", "posted": "2018-07-05T21:16:54.492144", "text": "((Yep, I had a feeling! Welcome back!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809366, "type": "ooc", "edited": "2018-07-05T21:20:30.600882", "format": "raw", "posted": "2018-07-05T21:20:30.600882", "text": "Thanks!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809519, "type": "ooc", "edited": "2018-07-05T21:30:06.323341", "format": "raw", "posted": "2018-07-05T21:30:06.323341", "text": "(( did you have any ideas for this one? I was thinking one of the fanboys could put him up for sale/rent once the concert's over. I was also hoping they could write embarrassing things on his body in marker to humiliate him"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809572, "type": "ooc", "edited": "2018-07-05T21:33:23.500639", "format": "raw", "posted": "2018-07-05T21:33:23.500639", "text": "I was thinking something like that too actually. And even afterwards maybe Choro is actually made the toy of the fan club or something and he’s brought to conventions and other concerts"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809694, "type": "ooc", "edited": "2018-07-05T21:40:54.530548", "format": "raw", "posted": "2018-07-05T21:40:54.530548", "text": "(( that's a great idea! there could be special occasions and events with themes, like one day he's in a bitchsuit, the next day he's isolated and mummified in a rubber suit with a toy inside him.\r\n\r\nthey could even make him the center of a panel at a convention, where participants can play a game and spin a wheel to earn prizes. each prize involves Choro getting bound tighter, humiliated, played with, or fucked."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50809748, "type": "ooc", "edited": "2018-07-05T21:44:07.655000", "format": "raw", "posted": "2018-07-05T21:44:07.655000", "text": "And later on if we wanted to include the others maybe another Matsu passes by one of the fan club members and they’re wondering how Choro escaped before they figure out that they’re sextuplets."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50809902, "type": "ooc", "edited": "2018-07-05T21:53:45.660793", "format": "raw", "posted": "2018-07-05T21:53:45.660793", "text": "(( oh, nice idea! get them together and torment them till they're broken!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50810288, "type": "ooc", "edited": "2018-07-05T22:19:20.160663", "format": "raw", "posted": "2018-07-05T22:19:20.160663", "text": "Plus the lines won’t be as long."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50810307, "type": "ooc", "edited": "2018-07-05T22:20:36.190894", "format": "raw", "posted": "2018-07-05T22:20:36.190894", "text": "(( true!\r\n\r\nanything else to discuss?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50810456, "type": "ooc", "edited": "2018-07-05T22:30:00.235782", "format": "raw", "posted": "2018-07-05T22:30:00.235782", "text": "I think we’re good! We tend to shoot ideas we have in the middle of things most times anyway"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50817113, "type": "ooc", "edited": "2018-07-06T04:31:52.379405", "format": "raw", "posted": "2018-07-06T04:31:52.379405", "text": "(( good point! I'll write the starter soon"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50817177, "type": "ooc", "edited": "2018-07-06T04:35:38.114374", "format": "raw", "posted": "2018-07-06T04:35:38.114374", "text": "Sounds good!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50817613, "type": "ic", "edited": "2018-07-06T05:00:52.639328", "format": "raw", "posted": "2018-07-06T05:00:52.639328", "text": "To her fanboys, Nyaa-chan was perfect. She was cute, pure, and incredibly kind to all of her fans, especially the ones who paid big bucks to meet her. Thousands adored her, but one group in particular took their love a bit too far.\r\n\r\nIdols often had to deal with creepy fans, but it wasn't often when the fans had issues with each other. The Nyaa-chan Protection Brigade, on the other hand, was utterly devoted to Nyaa, sworn to defame anyone that dared to ruin her pure image.\r\n\r\nThe Brigade was especially focused on Choromatsu Matsuno, having stalked his social media accounts. They found his love of Nyaa \"unclean\", determined to humiliate him at the next concert.\r\n\r\nThe Brigade had followed him into the bathroom, casually as to not make it look like they were stalking him. One of the bigger members stood in front of the bathroom door, three others approaching Choromatsu after he finished using one of the urinals.\r\n\r\n\"You're Choromatsu Matsuno, right?\" One of them asked, the other two holding a pair of scissors and duct tape."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50818569, "type": "ic", "edited": "2018-07-06T05:54:39.171319", "format": "raw", "posted": "2018-07-06T05:54:39.171319", "text": "The concert was fantastic. Nyaa-Chan was perfect, as always. And Choro was enjoying himself immensely, taking advantage at one of the brief breaks to leave his seat and visit the bathroom. Not entirely expecting to be followed in by fellow fans of the idol.\r\n\r\nHe doesn’t even know that they’ve followed him at all until he’s confronted in the middle of washing his hands. And even then...well, Choro gives a nervous smile as he reaches for a paper towel and formulates the best possible plan to weasel himself out of whatever this group is planning to do with duct tape and scissors.\r\n\r\nTurning off the faucet, Choro reaches out for a paper towel. “Uh...no?” Nailed it."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50818820, "type": "ic", "edited": "2018-07-06T06:09:23.795975", "format": "raw", "posted": "2018-07-06T06:09:23.795975", "text": "The three glance to each other, clearly unamused. The big guy guarding the door can't help but laugh, shaking his head in disbelief.\r\n\r\nThe man without anything in his hands grabs onto Choro's wrist as he reaches for the towels, yanking him towards the group. He holds him in a tight grip, the NEET's back forced against his chest and his mouth covered by the man's hand.\r\n\r\n\"Nice try, Matsuno,\" he sneers, the other two surrounding Choro with the items in their hands. \"You think we're just a couple of dumbasses, huh? No, we're the Nyaa-chan Protection Brigade, and we won't rest until Nyaa-chan's impure fans are kept as far away from her as possible.\"\r\n\r\nThe fan holding the scissors begins to cut off Choro's top, the other undoing his pants and letting them fall to the floor. Now the NEET is only in his underwear, which is soon cut off and dangled in front of his face.\r\n\r\nChoro's nose is held as the fanboy presses the boxers against his mouth, waiting for the perfect moment to stuff them in."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50823111, "type": "ic", "edited": "2018-07-06T16:17:19.526764", "format": "raw", "posted": "2018-07-06T16:17:19.526764", "text": "Choro lets out a startled shout as he’s yanked forward, struggling in the man’s grip and quickly tiring himself out in the process. He’d really like an opportunity to explain himself but that doesn’t seem like something that’s going to be happening any time soon when things have already escalated to stripping him of his clothes.\r\n\r\nWorse still is when his nose is held with his face practically stuffed into his own boxers. It wouldn’t take a genius to piece out where this is going. Still, he can only prolong it for so long before he absolutely needs to breathe and he’s forced to gasp for air - giving ample opportunity for the boxers to be shoved into his mouth to function as a gag that makes his cheeks bulge out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50834318, "type": "ic", "edited": "2018-07-07T05:07:14.840328", "format": "raw", "posted": "2018-07-07T05:07:14.840328", "text": "The men snicker as the boxers are forced into Choro's mouth, taking great pleasure in seeing his cheeks bulge from the cottony fabric. Still holding him in a steel grip, the man behind Choro gives him a few pats on the cheek, ruffling his hair afterwards.\r\n\r\n\"There, that suits you much better.\" He yanks his hair back as he leans into his ear, whispering threateningly.\r\n\r\n\"How would you feel about being a pathetic fuck toy for tonight?\" He asks, his grip tightening onto his dark hair. \"Filthy trash like you deserves to be used like this. You probably actually like this, don't you, you pig?\"\r\n\r\nThe man with the duct tape give Choro's nipple a quick pinch, hoping to get a reaction out of him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50834440, "type": "ic", "edited": "2018-07-07T05:15:36.025897", "format": "raw", "posted": "2018-07-07T05:15:36.025897", "text": "Choro isn’t made for a one on one fight, much less three against one when he’s already been put at a disadvantage - stripped and gagged. Still, he can’t stop squirming in the man’s grip until his head is forcibly and painfully yanked back by his hair. \r\n\r\nHis cock twitches embarrassingly when his nipple is pinched, Choro letting out a muffled grunt. Just a natural reaction, nothing he would normally be ashamed of but no doubt one that this group would capitalize on.\r\n\r\nWhat was it that the man had called him? A pig. Alongside the rhetorical question about being a fuck toy. No doubt about it, he’d found himself in a bad situation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50834678, "type": "ic", "edited": "2018-07-07T05:30:26.828114", "format": "raw", "posted": "2018-07-07T05:30:26.828114", "text": "The group notices Choro's cock twitching, quickly taking the opportunity to mock him about it.\r\n\r\n\"Fuck, you really /are/ a pig.\" The man continues to pinch his nipples, giving his chest a rough slap afterwards. \"Getting hard off of being abused... you really are pathetic.\"\r\n\r\nThe member holding him in his grip nods towards one of the stalls, the other fanboys getting the message as he yanks Choro towards the stall door.\r\n\r\nThey waste no time in strapping him in, taping his legs wide apart to the walls as he's forced to sit uncomfortably on the toilet. His arms are also taped behind his back, leaving him no way to resist as his body is bared to his captors."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50834768, "type": "ic", "edited": "2018-07-07T05:36:19.740440", "format": "raw", "posted": "2018-07-07T05:36:19.740440", "text": "Choro tosses his head back, struggling with the extra attention to his nipples until his chest is slapped and he’s brought out of whatever haze he’d started to enter. Was he really turned on by this kind of thing? And if so, what a horrible time to figure out. \r\n\r\nThe struggling resumes as he’s forced into a stall, twisting and grunting until he’s finally in a precarious but secure position. With his legs spread and taped it’s impossible to hide his cock and balls or even the round globes of his ass. And the same could be said of his arms."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835139, "type": "ic", "edited": "2018-07-07T05:59:06.298221", "format": "raw", "posted": "2018-07-07T05:59:06.298221", "text": "The men aren't done yet, one of them taking out a sharpie marker and popping the lid off before scribbling lewd phrases on his thighs and ass. Several humiliating phrases are scrawled across his skin, such as \"PIG\", \"SLUT\", \"CUMDUMP\", and even an arrow pointing to his asshole with the phrase \"FREE TO USE\".\r\n\r\n\"That should do it,\" he says, giving his round cheeks a few harsh smacks. \"We'll start getting some folks in here to play with you. I can't wait to see that body of yours covered in everyone's cum.\"\r\n\r\nHe gives him a final smack to the ass, leaving the stall door wide open as the group goes out to advertise their service."}]