[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50835248, "type": "ic", "edited": "2018-07-07T06:05:44.054995", "format": "raw", "posted": "2018-07-07T06:05:44.054995", "text": "Choro grunts, eyes narrowing with muffled laughter because the marker tickles as it makes contact with his skin. Though it doesn’t last long when the stall door is left open and he’s able to catch his own reflection in the mirror.\r\n\r\nHe’s a mess. Ass cheeks red from the brief spanking he’d received, nipples hard and thrust out with his arms bound behind his back, the hurtful writing that litters his ass and thighs. \r\n\r\nNow alone, Choro moans as his cock twitches again and again as he attempts futilely to free himself."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50835934, "type": "ic", "edited": "2018-07-07T06:57:16.130885", "format": "raw", "posted": "2018-07-07T06:57:16.130885", "text": "The group comes back some time later, but this time, they have several other concert-goers with them. Hungry eyes are aimed at Choro as they all form a line, waiting patiently for their turn to use him.\r\n\r\n\"Looks like this little pig is enjoying the attention,\" one of the Brigade members chuckles, eyeing his twitching cock. \"Feel free to abuse and use him like the little slut he is.\"\r\n\r\nThe line is long, going out all the way outside the bathroom. The first man in line is eager as he spreads a dollop of lube on his cock, gripping onto Choro's thighs before thrusting fast and hard."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50837790, "type": "ic", "edited": "2018-07-07T12:02:16.513052", "format": "raw", "posted": "2018-07-07T12:02:16.513052", "text": "Choro hangs his head in same. He shouldn’t be reacting this way to this kind of treatment but for whatever reason he is. And it doesn’t help him figure that the rest of the night is going to be a long one when he can see a part of the line reflected in the mirror.\r\n\r\nThough the brief distraction doesn’t last long. Not when he’s immediately jolted back to reality when the man’s cock enters his ass and starts to thrust."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50841731, "type": "ic", "edited": "2018-07-07T19:49:44.305932", "format": "raw", "posted": "2018-07-07T19:49:44.305932", "text": "The man slaps Choro's ass as he thrusts, deepening the shade of the red marks from the earlier spanking. The rest of the line waits eagerly, patiently waiting for their turns as the man fucking Choro cums inside him.\r\n\r\nCum leaks from his ass as the man pulls out, taking the marker handed to him and drawing a single tally mark on his thigh. The next man in line takes his place, stroking himself to an erection in front of the bound NEET. When he's fully hard, he enters his hole as it still leaks cum, thrusting at a steady pace.\r\n\r\n\"You know,\" he grunts, grip tightening around Choro's thighs. \"You're pretty cute. I'll have to go in line for seconds, but I'm sure it'll be worth the wait.\"\r\n\r\nHe cums minutes later, pulling out and coating Choro's face with his sticky mess."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50841827, "type": "ic", "edited": "2018-07-07T19:58:37.773536", "format": "raw", "posted": "2018-07-07T19:58:37.773536", "text": "The NEET moans and whimpers through the boxer gag stuffed in his mouth, precum leaking from his cock as he’s slapped and fucked. Only two men have used him so far at the concert but there’s plenty of cum leaking from his ass and now covering and drying on his face - forcing him to shut one eye.\r\n\r\nBefore the third man comes in he catches sight of the tally marks and resigns himself to a long night of humiliation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50848769, "type": "ic", "edited": "2018-07-08T03:31:53.116977", "format": "raw", "posted": "2018-07-08T03:31:53.116977", "text": "Hours pass, each person in line taking their time to abuse Choro in any way they saw fit. There's little the NEET can do to stop it, and by the end of it all he's covered in cum and tally marks. His asscheeks and thighs are marked heavily with the constant slaps from his assailants, cum leaking out of his ass.\r\n\r\nChoro's captors usher everyone out of the bathroom, one of them ripping the tape off of his legs and using a fresh roll to bind them together. He yanks him up to a standing position, guiding him into a bag that another Brigade member has ready for him.\r\n\r\nThey zip him inside before transporting him out of the building, shoving him into the back of their car before driving away to their headquarters."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50848927, "type": "ic", "edited": "2018-07-08T03:38:20.054546", "format": "raw", "posted": "2018-07-08T03:38:20.054546", "text": "When the remainder of the men standing in line are ushered away, Choro feels a flood of relief. By this point only the newest loads of cum on his body are still glistening while the rest has dried in place, oozing out of his abused ass. But it’s over. Finally. And he’s exhausted, head slumped into his chest as he’s finally freed from the exposed position in the stall. All he wants to do is go home and forget this ever happened.\r\n\r\nBut he’s not that lucky. Not when his legs are taped together and he’s secured into a thick sack. He wants to panic and struggle but all Choro can really manage is a feeble squirm before the muffled sound of the car engine lures him to sleep. \r\n\r\nWherever he’s being taken...he really doesn’t want to face the reality of it."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50849296, "type": "ic", "edited": "2018-07-08T03:54:15.491306", "format": "raw", "posted": "2018-07-08T03:54:15.491306", "text": "The men reach their apartment around half an hour later. It's not an impressive building by any means, run-down with weeds growing everywhere, but it got the job done. The four of them exit the vehicle, three carrying the bag holding Choro up to the door as the other opens it for them.\r\n\r\nUnzipping the sack, they see their victim sleeping soundly, the boxers still stuffed in his mouth. They want to torment Choro one last time before heading off to bed, unzipping the sack all the way and taping a vibrating wand to his cock.\r\n\r\nThe men prepare one last object - a rubber mask that would isolate Choro completely for the night. They slide it on, the material stretching tightly around his face. One of the Brigade members flicks and pinches his nipples, even leaning down to softly nibble."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50849492, "type": "ic", "edited": "2018-07-08T04:04:02.970523", "format": "raw", "posted": "2018-07-08T04:04:02.970523", "text": "Naturally, Choro wakes up as soon as the vibrating wand is pressed to his cock and securely taped. Another round of moans come from the now damp boxers acting as a gag now that his cock is being stimulated and he’s not just being fucked mercilessly by numerous men in a public restroom. \r\n\r\nIt takes a little more time for him to realize that his eyes are open but he’s unable to see anything around him. Some sort of rubber mask had been placed on him while he slept and now he’d pay the price.\r\n\r\nSome of the men had already pinched and tugged his nipples in the bathroom but now unable to see, his poor buds feel so much more sensitive. Choro is almost glad he can’t see the spectacle. Arms still taped behind his back, legs taped up to his thighs with a vibrator on his cock, hooded and gagged, and still bearing the impressive amount of tallies."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50849896, "type": "ic", "edited": "2018-07-08T04:24:31.490817", "format": "raw", "posted": "2018-07-08T04:20:40.402472", "text": "After several minutes of playing with Choro, the four choose to place a cock ring on him before zipping up the bag, leaving just a little bit of space open for the NEET to breathe. Heading off to bed, they discuss their plans to torture him in the morning, already taking notes on their phones.\r\n\r\nThe four settle into their sleeping bags, the faint sound of the vibrator fading as they fall asleep."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50850007, "type": "ic", "edited": "2018-07-08T04:25:22.108737", "format": "raw", "posted": "2018-07-08T04:25:22.108737", "text": "If not for the cock ring, Choro would have no doubt spent the night cumming again and again with no relief. This is almost worse. What fitful sleep he does get is interrupted by the painful ache in his cock as he moans in need. It doesn’t help that the mask just barely lets him get enough air and he’s a panting mess trapped in the latex sleepsack."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50850218, "type": "ic", "edited": "2018-07-08T04:33:07.645787", "format": "raw", "posted": "2018-07-08T04:33:07.645787", "text": "When morning cums, the four go to check on their new pet, pleased to hear the vibrator still faintly buzzing inside the sack. Unzipping the sack, they're able to see Choro's hooded face, his cock still erect and aching.\r\n\r\nTurning off the vibrator, the men soon remove the cock ring, followed by the latex mask.\r\n\r\n\"How was your night, piggie?\" One of them snickers, giving him a few ruffles of his hair. \"Did you sleep well? I doubt it.\"\r\n\r\nHe takes the boxers out of his mouth, finally ungagging him after spending the whole night with it bulging his cheeks."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50850486, "type": "ic", "edited": "2018-07-08T04:42:59.041014", "format": "raw", "posted": "2018-07-08T04:42:59.041014", "text": "The night has done some serious work to Choro, blissed out with glassy eyes even after he’s been woken up. As soon as the cock ring is removed he cums, load shooting up his chest and leaving him breathing heavily as he stares up at his captors. \r\n\r\nHe can barely formulate words even when the hood and gag are removed, gaze sliding around the room as if someone would be able to help him. \r\n\r\n“Ah...ahna,” he slurs weakly, cock beginning to twitch again even after cumming once."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50850834, "type": "ic", "edited": "2018-07-08T04:58:25.606588", "format": "raw", "posted": "2018-07-08T04:58:25.606588", "text": "The four laugh at Choro's pathetic voice, taking note of his twitching cock even after he came.\r\n\r\n\"Damn dirty pig,\" one of the men taunt, scooping up the cum on his chest with two fingers before pressing it against Choro's tongue. \"Clean up your mess, will you?\"\r\n\r\n\"Fuck, he still wants more?\" One of the men asks, bewildered. \"I think we should put him on the milker, if you ask me.\"\r\n\r\nThe other three murmur and nod in agreement, lifting Choro out of the sack before one slings him over his shoulder.\r\n\r\n\"You'll get to cum as much as you want, pig. Sound good?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50850898, "type": "ic", "edited": "2018-07-08T05:01:10.607552", "format": "raw", "posted": "2018-07-08T05:01:10.607552", "text": "The taste of his own cum brings Choro somewhat back to reality, gagging on the taste and grunting as his hefted over one of his captor’s shoulders. \r\n\r\nWhatever this milker is, he has a distinct feeling that he wants to be as far from it as possible. But the shaking of his head is ignored as he’s carried into another room."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50851336, "type": "ic", "edited": "2018-07-08T05:21:24.635823", "format": "raw", "posted": "2018-07-08T05:21:24.635823", "text": "Waiting for Choro in the other room is a large chair, leather straps attached to several parts of it. The men waste no time strapping him in, looping the straps around his arms, neck, chest, and legs. A tube hangs from a nearby machine, which the captors fit around Choro's aching cock.\r\n\r\nA dildo gag is soon stuffed into Choro's mouth, straps tightening behind his head to keep it in place. Attached to the other end of the gag is another tube connecting to the machine.\r\n\r\nThe machine is turned on shortly after, the tube sucking and vibrating around Choro's cock without mercy. Currently, it's set to a slow setting, but the captors plan to turn it up throughout the next few hours."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50851447, "type": "ic", "edited": "2018-07-08T05:26:51.061059", "format": "raw", "posted": "2018-07-08T05:26:51.061059", "text": "Choro squirms uselessly. His arms are finally untaped from behind his back only to be strapped into the chair at key points to ensure minimal movement on his part.\r\n\r\nHe can barely even rock his hips when the milker starts on his cock, moaning loudly until the dildo gag muffles the noise. He takes in all the tubing and shakes right before cumming again, sending the substance through the tube before he starts to work on another orgasm."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50852366, "type": "ic", "edited": "2018-07-08T06:18:23.894358", "format": "raw", "posted": "2018-07-08T06:18:23.894358", "text": "The captors wait patiently for the machine to do its job, the cum sent through the tube up to Choro's mouth. The sticky substance is squirted inside, filling his mouth and coating his tongue.\r\n\r\n\"You better suck on that gag if you don't want to choke,\" one of the captors laughs, turning up the tube's vibrations to a higher setting. \"Think of this as oral training, pig.\"\r\n\r\n\"Feel free to cum as much as you want,\" another says, taking out his phone to record the torture in front of him. \"We've got all day to make sure you're satisfied.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852476, "type": "ic", "edited": "2018-07-08T06:25:23.989381", "format": "raw", "posted": "2018-07-08T06:25:23.989381", "text": "Oh. Now Choro realizes just how devious this set up is. He’d be forced to swallow his own cum for as long as he was strapped into the milker - with a day already being thrown around as the time frame. \r\n\r\nChoro gags on the taste again but his throat bobs quickly as he finishes it down as another load is recycled from his cock to his mouth within mere seconds.\r\n\r\nIt really is a training exercise of sorts with the pace he has to keep up with as the vibrations and pumping become stronger and stronger. He doesn’t even have time to let out a pitiful moan."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50852598, "type": "ic", "edited": "2018-07-08T06:33:07.689473", "format": "raw", "posted": "2018-07-08T06:33:07.689473", "text": "Five minutes later, the machine goes up to the highest setting, buzzing madly around Choro's cock as more of his own cum is forced into his mouth.\r\n\r\n\"Such a good little piggie,\" one of the men snickers, reaching for a blindfold off to the side. \"We're going to go out to run a few errands, but we'll be back before the day is over, most likely.\"\r\n\r\nHe fastens the blindfold around Choro's eyes, giving him a smack to the chest before the four leave him alone to suffer underneath the \"training\"."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852686, "type": "ic", "edited": "2018-07-08T06:38:52.896315", "format": "raw", "posted": "2018-07-08T06:38:52.896315", "text": "With the blindfold, Choro has no way of knowing how much time has gone past. And it’s easier still to lose himself in the cycle. Cum and swallow, cum and swallow, cum and swallow. It’s the only thing he can focus on unless he wants to choke himself up on his own cum. It’s so painfully mundane after a while that it becomes second nature.\r\n\r\nHe no longer struggles in the seat, throat pulsing with every movement he makes to swallow load after load of his own cum. The pace is relentless on its highest setting, bringing him to orgasm more times than he can count."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887690, "type": "ic", "edited": "2018-07-10T04:40:24.548349", "format": "raw", "posted": "2018-07-10T04:40:24.548349", "text": "The group comes back several hours later, the sun just starting to set in the horizon. All four of them are eager to see the state their pet is in, having gone out of their way to spend as much time as possible away from Choro.\r\n\r\nOne of the men takes off the blindfold covering Choro's eyes, giving him a few pats to the cheek in mock comfort.\r\n\r\n\"We have something to tell you, pig,\" he says as he turns off the machine, the humming coming to a halt. \"So listen up.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50887791, "type": "ic", "edited": "2018-07-10T04:45:33.167031", "format": "raw", "posted": "2018-07-10T04:45:33.167031", "text": "Choro’s eyes are glassy again once the blindfold is removed, hours on the milker and swallowing his own cum doing an excellent job of breaking him down. Even after the device is turned off, he continues to suck on the dildo gag.\r\n\r\nHe blinks heavily, staring at his captors and listening attentively as he’s brought out of his haze."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50888263, "type": "ic", "edited": "2018-07-10T05:07:07.836043", "format": "raw", "posted": "2018-07-10T05:07:07.836043", "text": "\"Still sucking on that gag, huh? God, you're such a disgusting pig.\" The man shakes his head in disgust. \"Anyway, we just wanted to let you know a few things.\r\n\r\n\"First of all, we bought you a bitchsuit. You're gonna wear it a lot, along with a nose hook we got with it.\"\r\n\r\nOne of the men behind him shows the latex suit off, another holding onto the nose hook.\r\n\r\n\"The second thing we wanted to tell you is that we have plans to bring you to a convention at the end of the month. You're going to be a fucktoy for people to use how they see fit. Sound good?\"\r\n\r\nThe man removes the gag, drool connecting the dildo to Choro's mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50888388, "type": "ic", "edited": "2018-07-10T05:12:49.719647", "format": "raw", "posted": "2018-07-10T05:12:49.719647", "text": "Choro flinches at the statement, feeling a flush of embarrassment that had mostly been milked out of him with so much time spent downing his own cum. Arguably, it was a deserved statement. If he wasn’t so disgusting he probably wouldn’t have been cumming the entire time and becoming used to the taste of his own fluids.\r\n\r\nHe stares at the bitchsuit and nose hook incredulously for a moment before the dildo gag is removed. And damn, he’s really been broken in with the way that he cranes his neck in an effort to follow it and have it in his mouth again.\r\n\r\n“Please...please let me go. I don’t want to be used by a convention full of people.”"}]