[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50888537, "type": "ic", "edited": "2018-07-10T05:20:23.700285", "format": "raw", "posted": "2018-07-10T05:20:23.700285", "text": "The four only laugh at Choro's plea, the one in front shaking his head.\r\n\r\n\"I don't think so, pig. Don't worry, a dumb slut like you will learn to love the attention. Just look at the way you were sucking on that gag!\"\r\n\r\nOne of the members approaches Choro with a collar, strapping it tight around his neck. The nose hook is applied shortly after, the other end attaching to the back of the collar and forcing Choro's mouth open.\r\n\r\n\"There, much more fitting of a pig,\" the man chuckles, unstrapping him from the chair. Any freedom is quickly lost as he yanks him towards the bitchsuit, folding and shoving his limbs inside the rubbery latex."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50888640, "type": "ic", "edited": "2018-07-10T05:26:30.730106", "format": "raw", "posted": "2018-07-10T05:26:30.730106", "text": "Choro struggles uselessly against the restraints keeping him in the chair as the collar is cinched around his neck. He can’t see it well enough to make out what it says but he has no doubts that it probably isn’t his actual name.\r\n\r\nThe nose hook is even more humiliating than the collar itself, tethered to the back and forcing his nose to turn upwards - just like a pig’s snout. It doesn’t force his mouth open very far, but it’s enough to make him look like a complete idiot. \r\n\r\n“Aathp!” He pleads as he’s forced into the confines of the bitchsuit."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50888896, "type": "ic", "edited": "2018-07-10T05:37:37.262291", "format": "raw", "posted": "2018-07-10T05:37:37.262291", "text": "Choro's slurred pleas are ignored entirely, the four working together to fasten him completely into the bitchsuit. Once he's inside, the group steps back to admire their work, taking note of the exposed areas for his nipples and ass.\r\n\r\n\"There we go, all suited up!\" One of them snickers, unbuttoning his pants and getting on his knees in front of his mouth. \"Does our little pig want cocks down his throat and in his ass?\"\r\n\r\nAnother Brigade member slips his pants off, positioning himself behind Choro as he lubes himself up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50889020, "type": "ic", "edited": "2018-07-10T05:44:07.366927", "format": "raw", "posted": "2018-07-10T05:44:07.366927", "text": "The one advantage that Choro finds in the bitchsuit is the guarantee that his cock will be left alone, forming a bulge in the tight latex. It’s almost a relief until he remembers spending the night with the cock ring on and realizes that this is the exact same scenarios ten times over.\r\n\r\nIt isn’t something that the NEET can worry about for long when the brigade members have surrounded him with every intention to use his mouth and ass as they see fit. \r\n\r\n“Ahn, ahn. Pwef, nhhnnn!” He slurs, completely incomprehensible. Saliva starts to coat his chin and slide down the latex bodysuit with his mouth open the way it is."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50889178, "type": "ic", "edited": "2018-07-10T05:54:32.825679", "format": "raw", "posted": "2018-07-10T05:54:32.825679", "text": "The four laugh at their toy's pathetic pleas, his slurred speech only making them harder.\r\n\r\n\"Shut up, will you?\" The one in front says, immediately shoving his cock down his throat. \"You're making a fool out of yourself, you know.\"\r\n\r\nThe one behind him enters his ass seconds later, both men thrusting at an alternating rhythm. The one in front cums first after some time, the look on Choro's face spurring his orgasm. Pulling out, the captor coats his face in the sticky mess, paying special attention to his tongue.\r\n\r\nThe man behind him cums minutes later, pulling out and letting his cum drip out of his ass and onto the floor.\r\n\r\n\"How about a toy in that cute little ass, next?\" He asks."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50889249, "type": "ic", "edited": "2018-07-10T06:00:18.540840", "format": "raw", "posted": "2018-07-10T06:00:18.540840", "text": "Once again, Choro’s face flushed with shame and humiliation, wanting to hang his head but unable to do so with the nose hook - and then the cock rammed down his throat, impaled further when the other man’s cock enters his ass. \r\n\r\nIt isn’t at all like being worked on by the milker, the man mercilessly thrusting down his throat before covering his face in cum and coating his tongue. With minutes, there’s more cum dripping from his ass and onto the floor.\r\n\r\n“Saathn!” Comes another cry. He doesn’t want anything from them. Not when it’ll only mean more humiliation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50927017, "type": "ic", "edited": "2018-07-12T07:51:00.715009", "format": "raw", "posted": "2018-07-12T07:51:00.715009", "text": "Choro's cries are once again ignored as the Brigade prepares the next phase of his torture. They waste no time in retrieving a vibrator, lubricating it before inching it into his ass. They don't even let him get used to it before turning it on, the toy faintly buzzing inside him.\r\n\r\n\"Come on, piggy,\" one of them urges. \"Crawl around for us. And feel free to squeal like the filthy pig you are.\"\r\n\r\nHe gives Choro a quick smack to the ass, rubbing at his bulge trapped in the suit."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50928291, "type": "ic", "edited": "2018-07-12T12:06:54.716263", "format": "raw", "posted": "2018-07-12T12:06:54.716263", "text": "At least he’s been given permission to move away. And the slap to his ass does little more than jolt the vibrator inside of him and spurs him forward with a yelp. If not for the confines of the suit, he’d be a complete mess with his overly sensitive cock. As is, there’s discomfort in the bulge but he can’t be bothered to focus much on that as he crawls around the room wildly.\r\n\r\nEscape isn’t a possibility in this state, but Choro settles for keeping as wide a berth from the brigade members as he can in the room."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50959819, "type": "ic", "edited": "2018-07-14T05:02:28.487206", "format": "raw", "posted": "2018-07-14T05:02:28.487206", "text": "The group laughs and hollers as Choro crawls around the room, following him around despite him trying to keep distance. One of them even pulls out his phone to record the humiliating spectacle.\r\n\r\n\"This'll be good advertising for our event at the convention,\" he snickers. \"A disgusting, impure 'fan' of Nyaa-chan deserves this sort of treatment.\"\r\n\r\nThey turn up the vibrator, the buzzing in Choro's ass increasing in volume."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50963071, "type": "ic", "edited": "2018-07-14T08:52:15.375715", "format": "raw", "posted": "2018-07-14T08:52:15.375715", "text": "Choro would love nothing more than to find someplace in the apartment to hunker down and hide. It’d be possible, he thinks, if he were a little faster or if the brigade members weren’t so keen on keeping an eye on him for the moment. Escape isn’t really feasible in his current state but hiding is as soon as he gets an opportunity.\r\n\r\nHe didn’t deserve this, no matter what they said. The hurtful words couldn’t be more untrue. He wasn’t an impure fan of Nyaa-Chan. \r\n\r\nThe NEET squeals as the vibrator’s power increases. And as much as he wants to hate it, he can’t deny that it doesn’t feel good. It’s the shame and humiliation that come with it that make the experience wholly unpleasant."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51399186, "type": "ic", "edited": "2018-08-07T04:19:45.966779", "format": "raw", "posted": "2018-08-07T04:19:45.966779", "text": "One of the Brigade members reaches Choro, picking him up and placing him on his stumpy legs as the camera keeps rolling. He's soon faced towards the camera, his idiotic, distorted face on display for anyone who would see the finished video.\r\n\r\n\"This little piggie can't wait to service you like the dumb slut he is!\" One member snickers as he pulls at Choro's nipples. \"Look at all that drool running down his chin... he's practically drooling at the thought of cock after cock down his throat!\"\r\n\r\n\"Say something to the camera, pig. Let your new fans know how much fun you're having,\" the one filming the spectacle jeers."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51399381, "type": "ic", "edited": "2018-08-07T04:28:19.058377", "format": "raw", "posted": "2018-08-07T04:28:19.058377", "text": "Choro can’t help but squeal as he’s picked up and positioned like some kind of housepet. And not even that. A dog would receive better treatment than what he was currently getting. No, they’d said it multiple times by this point. He was nothing but a disgusting pig.\r\n\r\nThe NEET sobs into the camera, tears rolling down his cheeks and joining the saliva pouring from his mouth. It’s hardly an attractive site but he can only imagine that it’s the point.\r\n\r\n“Pweh pweh!” He begs through the tears. Not that it would be met with any responses other than laughter and more belittlement."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51562913, "type": "ic", "edited": "2018-08-16T05:28:34.567111", "format": "raw", "posted": "2018-08-16T05:28:34.567111", "text": "Predictably, the men all laugh at Choromatsu's slurred pleas as the camera keeps rolling. The recording catches every twitch and tear as Choromatsu drools and cries through the gag. When the phone stops recording, the group places Choro on his back, rubbing at his trapped bulge and tugging at his nipples as the vibrator keeps humming.\r\n\r\n\"You must be exhausted, pig,\" the one rubbing his bulge snickers. \"We'll let you rest for now, but tomorrow is going to be even tougher.\"\r\n\r\nHe removes the vibrator, but Choro isn't completely free once a latex mask is placed over his head and he's shoved into a rubber sleepsack.\r\n\r\n\"Good night, piggie,\" he snickers before zipping it up to allow only a small bit of air in."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51607137, "type": "ic", "edited": "2018-08-19T02:29:23.031858", "format": "raw", "posted": "2018-08-19T02:29:23.031858", "text": "The only thing that Choro has to be thankful for is that the group has settled for just having him cry and beg on video. He’d be utterly destroyed if what they do to him after was sent out to be watched by hundreds of people. It’s not like he can help himself. They don’t stop no matter how much he cries and all the stimulation drives him to the point of nearly passing out. The attention to his nipples and ass wouldn’t be so bad if he could find any release other than having the bulge of latex his cock is under rubbed. And all the twitching and squirming in search of friction leaves him exhausted, panting and sticking his tongue out to catch his breath.\r\n\r\nThe reprieve from the vibrator is a welcome one up until he realizes that there’s a trade off. One torture for another it seems as he feebly attempts to stop the man from applying the mask. It cuts off all sight and practically all sound, leaving him in terrified confusion as he’s placed inside the sleep sack."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51677029, "type": "ic", "edited": "2018-08-23T04:01:51.215840", "format": "raw", "posted": "2018-08-23T04:01:51.215840", "text": "The men leave Choromatsu inside the sleepsack all night. They're allowed to sleep in warm beds while Choro is forced to suffer inside the sack, but the Brigade isn't bothered by this. The thought of their plaything thrashing and squirming in agony is the last thing that fills their heads before they fall asleep.\r\n\r\nWhen they wake up the next morning, they don't immediately take Choro out of the sack. Instead, they leave the building to do some shopping. \r\n\r\nAnd who should they run into but Osomatsu, the eldest sextuplet.\r\n\r\nThinking that Choro has escaped, the brigade wastes no time in nabbing him, dragging him over to an alley and wrapping him up with a roll of tape from their car. After gagging him, the men throw him into the trunk, driving until they reach their hideout.\r\n\r\nWhen they take Oso out of the trunk and into the living room, the men take time to fondle his taped body before threatening him.\r\n\r\n\"I don't know how the hell you got out, but your punishments are only going to get worse now,\" one of them sneers."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51814662, "type": "ooc", "edited": "2018-08-31T19:40:24.124348", "format": "raw", "posted": "2018-08-31T19:40:24.124348", "text": "(( you doing alright?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52242121, "type": "ooc", "edited": "2018-09-25T23:28:00.656111", "format": "raw", "posted": "2018-09-25T23:28:00.656111", "text": "Sorry that was another my bad. I got really busy with school. I’ll get to responses right away!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52242378, "type": "ic", "edited": "2018-09-25T23:44:29.211773", "format": "raw", "posted": "2018-09-25T23:44:29.211773", "text": "Choro sweats and struggles the whole night through. Exhaustion eventually sets in, in the form of a fitful but otherwise deep sleep. He hardly even notices that he’s been spared a morning of torture when the Brigade members leave - though he has entered the state between waking and sleeping, occasionally drifting off once his nerves finally get to him. It makes the time pass quickly, only being conscious for short bursts. But it does put Choro on edge being cut off from the outside world.\r\n\r\nAre they just watching him? They couldn’t keep their hands off of him last night, so he can’t imagine the second day being allowed to pass without some of the humiliation as the day previous. Are they waiting for him to do something? He’s lapsed into silence for fear of doing something he shouldn’t and receiving punishment.\r\n\r\nHe’s completely unaware that the answer lies in his brother Oso.\r\n\r\nCoincidentally in the same area as where the Brigade were shopping - the perfect mirror image to Choro, and by extension their four other brothers. Confusion and panic set in all at once when he’s sheparded into a side street and set upon by the small group.\r\n\r\nNo time at all to explain himself or ask any questions. \r\n\r\nBut the chance presents itself readily when Oso is finally retrieved from the trunk of the car and taken into the apartment. The strange man is talking about escape and punishment and that paints part of the picture that the eldest Matsu needs to figure out what’s going on. Only problem is that the gag muffles his protests and questions."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52247401, "type": "ic", "edited": "2018-09-26T04:08:08.330577", "format": "raw", "posted": "2018-09-26T04:08:08.330577", "text": "The men snicker as Oso tries to protest through the gag, their hands exploring his bound body. The group is still convinced that it's Choro they're dealing with; unable to hear his muffled questions.\r\n\r\n\"That's right, you fucking pig,\" one of the men taunts as he pulls out a pair of scissors and begins to cut away the tape and fabric covering his crotch. \"I could have sworn we locked you up nice and tight inside that sack, but it looks like you're smarter than we thought, huh?\"\r\n\r\n\"I wonder what a suitable punishment would be? What do you think, Choro-chan?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52248610, "type": "ic", "edited": "2018-09-26T05:17:58.022783", "format": "raw", "posted": "2018-09-26T05:17:58.022783", "text": "Oso’s bewildered expression is the most he can manage in response aside from his muffled protests that go completely ignored. He’s been thrust into this situation without any facts to explain why what’s happening is happening.\r\n\r\nAnd...there. The mention of his brother’s name is what truly catches his attention. Choro hadn’t come home the night before, which was strange but not worrying at the time. Now it would seem that his brother had gotten himself involved in...something.\r\n\r\nOso shakes his head vehemently, with no other way to communicate that he isn’t the right Matsu."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52248704, "type": "ic", "edited": "2018-09-26T05:28:33.052488", "format": "raw", "posted": "2018-09-26T05:28:33.052488", "text": "The Brigade completely ignores Oso's protests and head shaking as the last of the fabric is cut away, revealing his limp cock. The group chuckles, one hand reaching towards his length to stroke him off.\r\n\r\n\"How about we make you so desperate to cum all day, but never letting you finish?\" The stroking around his cock grows more intense as the Brigade member speaks. \"We can squeeze you inside a hot sleep sack like we did last night, with a cock ring on you the whole time. Sound good?\"\r\n\r\nOne of the members passes him a cock ring, which he slides onto Oso's cock to rest at the base."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52250057, "type": "ic", "edited": "2018-09-26T08:42:10.056653", "format": "raw", "posted": "2018-09-26T08:42:10.056653", "text": "At this point, Oso really can’t help himself. He starts up a mantra in his mind that he can’t help getting hard in this position, a hand on his cock delivering swift pumps that shoot straight to his core. It’s a natural reaction. But the feeling isn’t so intense that he doesn’t follow the conversation.\r\n\r\nThese people had nabbed Choro for whatever reason and ended the night by putting him in a sleep sack - presumeably where he still was. Their now shared captors had likely not checked on Choro before leaving the apartment and confused him for his younger brother. Understandable if you didn’t know that interacting with any Matsu meant dealing with five more identical faces - differing only in personality and a favorite color scheme.\r\n\r\nAgain, Oso shakes his head - trying and failing to communicate the mistake. Though he doesn’t know where the situation would go from there. Set him free but keep Choro? Unlikely. It probably comes off as him not wanting to be fitted with the cock ring, also true. Doesn’t stop it from happening - Oso’s protests changing intention as the tension builds in his abdomen. No release for his cock, now hard and begging for attention."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52264180, "type": "ic", "edited": "2018-09-27T03:55:43.960797", "format": "raw", "posted": "2018-09-27T03:55:43.960797", "text": "Oso's muffled refusals are once again ignored once he's fitted with the cock ring. It isn't long after until a collar is strapped around his neck as well, a nose hook applied to him as it's tethered to the back of the collar.\r\n\r\nHis gag is removed seconds later, allowing the Brigade members to catch an eyeful of his distorted expression.\r\n\r\n\"Fucking dirty pig,\" one member of the group taunts as he lifts Oso up bridal-style. \"Let's take you back to the sleepsack so you can think about what you've done.\"\r\n\r\nThey walk towards the room, eager to begin the torture once more.\r\n\r\nWhat they don't expect is to see the only sack already occupied."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52264338, "type": "ic", "edited": "2018-09-27T04:04:17.719135", "format": "raw", "posted": "2018-09-27T04:04:17.719135", "text": "By this point Choro has completely woken, wiggling blindly in the sleepsack and caught in a strange state. Being left alone for a while was a blessing but now he’s waiting for the other shoe to drop. And patience wasn’t one of his strong suits.\r\n\r\nOso’s distorted face - mouth partially open and drooling, nose pulled into a snout - practically lights up at the sight. Poor circumstances, but at least Choro wasn’t missing."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52264499, "type": "ic", "edited": "2018-09-27T04:14:07.265092", "format": "raw", "posted": "2018-09-27T04:14:07.265092", "text": "It dawns on the Brigade as Oso's face lights up that they've hit it big. The two were brothers - twins no less. And nothing quite attracted horny convention goers as much as more than one toy to play with.\r\n\r\nThey remove Choro from the sack, his body still fitted with the bitchsuit and mask as they place him on all fours. The mask is yanked off, revealing his similarly distorted face to his eldest brother.\r\n\r\n\"Anything you wanna say to your pig brother?\" One member says to Oso as the sleep sack is brought closer to him."}]