[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52264830, "type": "ic", "edited": "2018-09-27T04:35:24.982215", "format": "raw", "posted": "2018-09-27T04:35:24.982215", "text": "Choro whines at the sudden change from dark to light - though he should be grateful that it’s the only thing he’s whining about currently. The last two days have put him through the ringer. Drool spills from his own mouth as he finally makes out Oso.\r\n\r\nSince when had he been here?\r\n\r\nOso’s expression falls almost immediately, torn between looking to his brother and the sleep sack that’s looming closer and closer to his own body. “Ee worriah abou yoa,” he manages to get out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52288040, "type": "ic", "edited": "2018-09-28T18:49:19.958380", "format": "raw", "posted": "2018-09-28T18:49:19.958380", "text": "\"Aw, isn't that sweet? Such a good brother to share your role as a pig with,\" one of the Brigade members snickers as they force Oso's body into the sack. They use several of the zippers to seal him inside, leaving his erect cock out in the open.\r\n\r\n\"Your brother seems like a nice guy,\" one says to Choro as he attaches a vibrator to Oso's cock. \"I wonder how long it'll be before we corrupt him into being a slutty plaything?\"\r\n\r\nHe rotates the toy's dial to the highest setting before lying Oso down on the floor, quickly approaching Choro's bitchsuited form."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52289730, "type": "ooc", "edited": "2018-09-28T21:21:32.049040", "format": "raw", "posted": "2018-09-28T21:21:32.049040", "text": "So I know we just talked about Choro and Oso with this but I’m also thinking it would be interesting to have the other brothers involved too?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52294006, "type": "ooc", "edited": "2018-09-29T02:21:40.606004", "format": "raw", "posted": "2018-09-29T02:21:40.606004", "text": "(( I agree, I'd love that!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52294947, "type": "ooc", "edited": "2018-09-29T03:28:45.913173", "format": "raw", "posted": "2018-09-29T03:28:45.913173", "text": "Neat!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52296239, "type": "ooc", "edited": "2018-09-29T05:00:43.938167", "format": "raw", "posted": "2018-09-29T05:00:43.938167", "text": "(( yeah!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52297316, "type": "ic", "edited": "2018-09-29T06:23:26.193120", "format": "raw", "posted": "2018-09-29T06:23:26.193120", "text": "Oso’s muffled grunts renew themselves as the vibrator is attached to his cock. The sleep sack rocks with his movements but he’s quick to discover that escape is completely impossible.\r\n\r\nChoro stumbles back, nearly tumbling over himself as he drools onto the floor. “Nees to go ‘ome,” he tries to explain. “Brothers nees him.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52311966, "type": "ic", "edited": "2018-09-30T04:34:22.535249", "format": "raw", "posted": "2018-09-30T04:34:22.535249", "text": "The Brigade laughs at Choro as he tries to communicate through slurred speech, but that fades into silence when his message sinks in. Brothers need him? If that was the case, then they weren't the only siblings. Perhaps they were even quadruplets? The thought alone is enough to send them into a gleeful frenzy.\r\n\r\n\"Is that so?\" One member snickers as he approaches Choro. \"How many brothers do you have, anyway? Are they as big of pigs as you and your brother here?\"\r\n\r\nHis hand trails below Choro and rests on his bulge, giving it a few light strokes.\r\n\r\n\"Care to tell us how we can get ahold of them?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52312112, "type": "ic", "edited": "2018-09-30T04:40:57.747297", "format": "raw", "posted": "2018-09-30T04:40:57.747297", "text": "Choro’s eyes widen as the attention on him heightens. That and the realization of what he’s allowed to slip out and what it probably means for the other four Matsu brothers. \r\n\r\nHe whines pitifully in response, guilt rising from the pit of his stomach. He doesn’t even get that feeling for very long before someone’s hand is moving on his trapped cock. It’s clear that even the previous day on the milker hadn’t taught him any permanent lessons as he rubs himself onto the hand almost immediately - distracted by trying to find any source of friction for his cock.\r\n\r\nHe might really be a pig, but that didn’t mean his brothers deserved the same fate.\r\n\r\nChoro shakes his head, distorted expression taking on a look of determination. He couldn’t sell out the other four."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52312420, "type": "ic", "edited": "2018-09-30T04:54:24.995568", "format": "raw", "posted": "2018-09-30T04:54:24.995568", "text": "The man shakes his head in disapproval, soon maneuvering Choro so he's resting on his shortened legs. The rubbing on his bulge doesn't let up, even intensifying as the others surround him.\r\n\r\n\"I saw the way you were rubbing yourself on my hand,\" he says with a disgusted look. \"If you tell me where your brothers are, I might let you cum. Pigs like you don't deserve it, but I'm willing to compromise.\"\r\n\r\n\"So what'll it be, piggie?\" He asks with a smirk. \"How badly do you want to cum?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52312496, "type": "ic", "edited": "2018-09-30T04:58:03.837049", "format": "raw", "posted": "2018-09-30T04:58:03.837049", "text": "Something inside him has to be broken. It’s the only possible explanation for the terrible thing that Choro can feel himself about to do. He’s more than aware that the members of the Idol Brigade wouldn’t care if he ever cummed again. And he wants to. \r\n\r\nChoro wants to cum again so badly that he’s more than willing to slur out their home address and sell out his brothers on the small chance that he’ll be rewarded."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52312719, "type": "ic", "edited": "2018-09-30T05:09:09.685952", "format": "raw", "posted": "2018-09-30T05:09:09.685952", "text": "The Brigade gives Choro a round of applause to mock him, one ruffling his hair in praise.\r\n\r\n\"That's a good little pig,\" he says before pulling away. \"Such a shame you'll never get rewarded.\"\r\n\r\nThe rest of the Brigade laughs, one of them grabbing for a vibrator and leaning it against Choro's poor bulge.\r\n\r\n\"Two of us will stay behind, while my buddy and I are going to get your brothers.\" He grabs for a mask and shows it off to Choro. \"I'll be sure to tell them that it's all your fault.\"\r\n\r\nHe forces the mask over his head, leaving with his friend while the others torment Choro as he's leaned on his back."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52312809, "type": "ic", "edited": "2018-09-30T05:14:52.356766", "format": "raw", "posted": "2018-09-30T05:14:52.356766", "text": "Choro can only stare in shock at the statement - in a state of disbelief that he believed for a second that they might be telling the truth. What an idiot.\r\n\r\nOne that was responsible for the horrible things about to happen to his other brothers while he squirms pathetically on the floor with vibrator pressed to the bulge that used to be his cock.\r\n\r\nOso isn’t much better off, but other the vibrator on his already ringed cock he’s been fortunately neglected and escaped most notice.\r\n\r\nOnly Ichi, Kara, Jyushi, and Totty are in the worst position. Not knowing what’s about to happen to them."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52312937, "type": "ic", "edited": "2018-09-30T05:22:53.970013", "format": "raw", "posted": "2018-09-30T05:22:53.970013", "text": "The two Brigade members waste no time in tracking down the address Choro gave them - where they happen to stumble upon four brothers, identical to each other and their captives.\r\n\r\nThe capture is over before they know it, the Matsus' limbs tied with tape before they're gagged and stuffed into the back of the car. On the drive to their hideout, one messages the others to tell them the kidnapping was successful.\r\n\r\nWhen they get back, the captors each carry two Matsus from the back and into their hideout, forcefully pulling them through the building until they reach the room where Choro and Oso are trapped.\r\n\r\n\"Welcome to your new home, pigs,\" one says as they're shoved to the floor."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52312980, "type": "ic", "edited": "2018-09-30T05:26:15.280065", "format": "raw", "posted": "2018-09-30T05:26:15.280065", "text": "The four newest Matsus are a wriggling mess by the time they’re dumped on the floor. Even between them they have no concrete idea of what exactly isn’t going on other than the fact that they’ve been kidnapped.\r\n\r\nOso and Choro are in so much bondage that they can’t even discern who the people in the sleepsack and bitchsuit might be. Though they all have a feeling that they’re about to share a similar fate with the way that they’ve been taped and gagged."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313107, "type": "ic", "edited": "2018-09-30T05:35:04.406220", "format": "raw", "posted": "2018-09-30T05:35:04.406220", "text": "The gags are torn off by the Brigade as they prepare the nose hooks and collars, attaching the devices to each Matsu. Now every Matsu's face is distorted, noses lifted up and collars spelling out their new role - \"Piggie\".\r\n\r\nChoro's mask is torn off, allowing him to catch an eyeful of his brothers in their new humiliating roles. One of the Brigade retrieves a pair of scissors, snipping off the Matsus' clothing piece by piece until there's nothing left.\r\n\r\n\"See that, little pigs?\" One whispers as he points towards Choro. \"Your disgusting brother over there sold you out.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313217, "type": "ic", "edited": "2018-09-30T05:42:00.228695", "format": "raw", "posted": "2018-09-30T05:42:00.228695", "text": "Tears begin to stream from the youngest two brothers’ eyes as they’re collared. Ichi and Kara don’t look entirely okay with their predicament either but seem to be holding themselves together well enough to lean against Totty and Jyushi in a vain act of comfort. \r\n\r\nAll four look utterly ridiculous with their upturned noses and already drooling mouths. And they don’t look any less comical when they voice their surprise at Choro being unmasked.\r\n\r\nAt least the first pig has the decency to look ashamed."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313359, "type": "ic", "edited": "2018-09-30T05:57:10.419028", "format": "raw", "posted": "2018-09-30T05:57:10.419028", "text": "\"Aw, regretting that decision, piggie?\" The same man laughs as another member pulls out four bitchsuits. \"The damage is already done, you know.\"\r\n\r\nThe two had went out shopping for more suits after they kidnapped the four remaining Matsus, one left over for Oso. They begin by cutting off Totty's tape bondage, forcing him inside the hot latex suit before he can squirm very far. And just like Choro, his cock is a useless lump underneath the rubbery material, nipples and asshole on display.\r\n\r\n\"Your hoodie was already pink, so you're pretty much perfect in a role as a pig,\" one taunts as he rubs his bulge. \"Bit of a crybaby, too...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313417, "type": "ic", "edited": "2018-09-30T06:02:47.413469", "format": "raw", "posted": "2018-09-30T06:02:47.413469", "text": "Something in Totty’s brain must be short circuiting because his only response is to cry some more, though the quiet hiccups soon turn into strangled squeals of pleasure as his new bulge is teased until he’s hard and helpless inside the suit."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313507, "type": "ic", "edited": "2018-09-30T06:11:54.712088", "format": "raw", "posted": "2018-09-30T06:11:54.712088", "text": "\"You're really squealing like a pig now!\" The man laughs as he keeps teasing Totty. \"How loud can you get, piggie? Let's find out!\"\r\n\r\nHe's handed a pair of weighted nipple clamps, quickly attaching them to the helpless NEET's buds. Then he's back to rubbing at his bulge again, tugging on the clamps from time to time.\r\n\r\nThe other members grab onto Ichi, snipping off his bonds and suiting him up to match Totty. Another pair of clamps are attached to his nipples, yanked on repeatedly as his bulge is stroked aggressively."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313557, "type": "ic", "edited": "2018-09-30T06:16:48.110115", "format": "raw", "posted": "2018-09-30T06:16:48.110115", "text": "Ichi and Totty both are quick to make the Brigade’s day. Neither NEET had an extremely high pain tolerance and the rough yanking of their clamped nipples has them screaming in pain. \r\n\r\nThe worst part is that they can feel themselves finding the whole event as a turning point in their lives. There shouldn’t be anything but pain in their torment but the combination made with stroking their bulges adds a layer of confusion as they find themselves keening and whining with pleasure.\r\n\r\nTheir reactions are so strong that even the other Matsus look a little perturbed while their brothers are turned into pain sluts."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52313755, "type": "ic", "edited": "2018-09-30T06:44:27.614008", "format": "raw", "posted": "2018-09-30T06:44:27.614008", "text": "Kara and Jyushi are next to follow, forced into bitchsuits and fitted with nipple clamps while their bulges are rubbed. It's a pathetic, ridiculous sight to the Brigade, who are having the time of their lives as they torment and tease their slaves.\r\n\r\n\"That's it, make more noise...\" one chuckles as he rubs Kara's bulge. \"Then we can start more fun training sessions.\"\r\n\r\n\"You'll all be going to a convention at the end of the month,\" he explains as he yanks on Kara's clamps. \"You'll be forced to please our booth visitors in any way they please. And you better believe we'll be recording it.\"\r\n\r\n\"Six identical brothers, all forced into bondage and made to please others... I can hardly wait.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52313792, "type": "ic", "edited": "2018-09-30T06:50:08.063536", "format": "raw", "posted": "2018-09-30T06:50:08.063536", "text": "The clamps are hell for the brothers, stretching their poor buds towards the floor and sending shooting pains straight to their chests. It’s no wonder that all Kara, Ichi, Totty, and Jyushi can do is squeal in pain and try what they can to alleviate the sensation. Admittedly, they can’t do much in their new bitchsuits.\r\n\r\nKara’s screams rise in volume as the Brigade’s attention is shifted onto him. His eyes are nearly rolling back in his head from the mixture of pleasure and pain.\r\n\r\nChoro whines apologetically to his brothers, drool spilling down his chin while he watches them be subjected to such cruel methods."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52328181, "type": "ic", "edited": "2018-10-01T04:04:57.997329", "format": "raw", "posted": "2018-10-01T04:04:57.997329", "text": "The room is filled with the whines and screams of the Matsus as they're treated like objects. It's clear that the Brigade doesn't care at all for their wellbeing, tugging on the clamps and furiously rubbing their bulges. The humiliation only adds to the group's arousal, evident by the growing erections in their pants.\r\n\r\n\"I wonder if this pig can take cock as well as Choro-chan?\" One of the group asks while gesturing to Kara. \"His eyes are rolling back like some kind of slut... how fitting.\"\r\n\r\nTwo of the Brigade members begin to slide their pants off, revealing their cocks and taking their positions behind and in front of Kara.\r\n\r\n\"Are you ready to begin your training, pig?\" The one in front asks as he strokes himself off."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52328843, "type": "ic", "edited": "2018-10-01T04:49:23.240636", "format": "raw", "posted": "2018-10-01T04:49:23.240636", "text": "Kara pants heavily in response, unable to quite meet the man’s eyes. \r\n\r\nHe isn’t completely stupid. He knows exactly what’s about to happen. He just can’t do anything about it.\r\n\r\nTotty is still crying as he’s tormented by one of the members and Jyushi seems to have taken the complete opposite approach as his brothers by doing exactly what his current tormentor asks of him."}]