[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52373124, "type": "ic", "edited": "2018-10-04T04:08:13.119500", "format": "raw", "posted": "2018-10-04T04:08:13.119500", "text": "It doesn't take long before the two Brigade members stuff Kara's face and ass and begin thrusting with wild fervor, shoving themselves as deeply as they can. The man in front grips onto his hair as he fucks his throat, while the one behind him digs his nails into his cheeks.\r\n\r\nTotty's tormentor finds great pleasure in his tears as he mockingly kisses them away, his lips and tongue pressing into his forced-open mouth while yanking at the clamps. Meanwhile, Jyushi's tormentor rubs at his bulge as he kisses him, playing with his shortened limbs."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52373328, "type": "ic", "edited": "2018-10-04T04:19:25.454442", "format": "raw", "posted": "2018-10-04T04:19:25.454442", "text": "A virgin much the same as his brothers, Kara squeals into the cock shoved into his mouth - partially in pain as his hair is pulled and there’s a sharp scraping on his ass. Their erratic rhythms cause the Matsu to be thrown into a wild game of tug-of-war with him as the heavily bound rope as he’s pushed between them in different intervals.\r\n\r\nTotty’s eyes light up at the kisses, thinking that he’s found some small amount of mercy and completely missing the point entirely until the man’s tongue is invading his mouth and pressing roughly against his own. His cries increase in volume when the clamps are pulled and subject his poor nipples to even more torment.\r\n\r\nJyushi is more than happy to play along with his own captor, flailing his limbs like a dog on its back begging for tummy rubs that he instead receives on his trapped cock. He’s not any happier to be captured than his brothers but he’s more than capable of taking the easy route if it means avoiding tougher treatment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52373471, "type": "ic", "edited": "2018-10-04T04:27:08.289355", "format": "raw", "posted": "2018-10-04T04:27:08.289355", "text": "\"That's it, squeal like the pig you are,\" the member in front taunts Kara as he continues to shove himself down his throat. \"Show me how much of a slut you can be.\"\r\n\r\nIt doesn't take too long before cum fills Kara's ass - the tormentor pulling out before smacking his cheeks. It's a pathetic sight, really. Cum leaking out of his ass and muffled squealing as his throat continues to be fucked, he's truly been made into a plaything.\r\n\r\nNow finished with Kara, the tormentor takes Oso out of his sleepsack - allowing him to see his brothers for the first time since he was kidnapped.\r\n\r\n\"Take a good look, piggie,\" he says as he runs his thumb along Oso's drooling bottom lip. \"The gang's all here.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52373568, "type": "ic", "edited": "2018-10-04T04:33:04.500232", "format": "raw", "posted": "2018-10-04T04:33:04.500232", "text": "Kara can only grunt in response around the man’s cock, tensing up when he feels the other man leave his ass full of cum. It’s not entirely a pleasant feeling to be fucked and be left empty and Kara hates that it’s one of his first thoughts.\r\n\r\nOso’s first reaction when he’s taken out of the sack is to take the deepest breath that he’s been able to manage since being trapped inside. As is, he’s the only one left of his brothers that isn’t yet inside a bitchsuit - yet he imagines that it will change soon. \r\n\r\nHis second reaction is to shoot Choro a glare. None of this would have happened to them if Choro hadn’t gotten involved."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52373728, "type": "ic", "edited": "2018-10-04T04:42:59.208871", "format": "raw", "posted": "2018-10-04T04:42:59.208871", "text": "\"Mm, this little pig looks mad,\" the man toying with Oso chuckles as he slips off his cock ring. \"I'm sure Choro-chan feels awful about what he's done. Isn't that right, piggie?\"\r\n\r\nHe gives a cruel smirk towards Choro before taking Oso out of his bindings. Two other members give him a hand as he's forced inside a bitchsuit to match his brothers, cock now a permanent bulge alongside them.\r\n\r\n\"Choro-chan is the biggest pig of them all, don't you agree?\" He pats Oso on the head in mock comfort. \"Selling out his brothers just so he can cum... such a despicable thing to do.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52373799, "type": "ic", "edited": "2018-10-04T04:47:22.684149", "format": "raw", "posted": "2018-10-04T04:47:22.684149", "text": "Choro watches the transformation much as he had his brothers, a flood of guilt running through him as he tries to apologize - drool spilling onto his chin. It’s easier to sink down onto his shortened limbs and try to cover his head with his arms in all honesty, as close to hiding as he can get in this state.\r\n\r\nOso really doesn’t look too impressed by his brother’s reaction as he’s crammed into the suit either, eyes narrowed with contempt."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52402566, "type": "ic", "edited": "2018-10-06T05:01:35.370093", "format": "raw", "posted": "2018-10-06T05:01:35.370093", "text": "The Brigade laughs as they watch Choro attempt to apologize. His nose hook only slurs his words and causes drool to spill from his open mouth, filling the Brigade with sadistic glee.\r\n\r\n\"The damage is already done, piggie,\" one of them teases as he rubs at Oso's bulge and pinches one of his nipples. \"Now all of your brothers have to suffer the consequences too.\"\r\n\r\nThe man fucking Kara's throat finishes inside his mouth, emptying himself as he yanks back on his hair. Pulling away, he ruffles his hair before focusing attention on Choro.\r\n\r\n\"Now beg and plead like the disgusting slut you are,\" he says with a cruel smirk. \"Or else we'll stuff your pig brothers full of toys and cocks.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52402948, "type": "ic", "edited": "2018-10-06T05:31:58.532556", "format": "raw", "posted": "2018-10-06T05:31:58.532556", "text": "Kara’s throat pulses as he’s made to swallow a large portion of the cum, the rest left to join the drool spilling onto the floor in front of him - eyes darting towards Choro as the man begins to speak.\r\n\r\nHe isn’t the only Matsu to show a vested interest into how their brother responds to the command. They already know that Choro sold them out once, that’s not going to change no matter how much he apologizes. \r\n\r\nEven Jyushi stops his playful movements with his own “tormentor” to watch the action unfold, on his back and too afraid to move in case breaking the tension put focus on him.\r\n\r\nChoro whimpers and whines, pushing at his shortened limbs until he’s able to force himself into a sort of sitting position to flail his arms in the universal gesture for begging, complete with sticking his tongue out and panting heavily."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52403211, "type": "ic", "edited": "2018-10-06T05:55:21.607898", "format": "raw", "posted": "2018-10-06T05:55:21.607898", "text": "Choro's humiliating spectacle pleases the Brigade as they move in closer to him. His heavy panting is silenced with a kiss, tongue shoved down his mouth as his bulge is furiously stroked.\r\n\r\n\"Looks like we'll have to stuff you full in their place,\" one snickers as he pulls out a vibrator and adjusts Choro on his elbows and knees. \"That cock of yours must be so desperate to cum... not that you're going to ever again.\"\r\n\r\nLubing up the vibrator, he presses it into Choro's ass, allowing it to rest against his anal walls. The peace doesn't last as it soon activates, buzzing inside him and filling him up.\r\n\r\nHis mouth is next to follow, stuffed fullwoth a Brigade member's cock as he thrusts wildly."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52491913, "type": "ic", "edited": "2018-10-12T00:38:04.629372", "format": "raw", "posted": "2018-10-12T00:38:04.629372", "text": "Choro drools into the kiss, unable to help himself until the brigade member pulls away - saliva still hanging between their mouths. The bulge is driving him crazy. Throughout all the torment Choro thinks that he could possibly handle all of it if he was only allowed to have his cock out and cum as much as he wanted. The need was the entire reason that he sold out his brothers to begin with. \r\n\r\nTears prick the corners of his eyes as he listens to the man speak, frustration reaching its fever point when he says that he won’t get to cum again. He’d even take another day on the milker in place of never getting to cum, and the thought causes Choro’s face to flush.\r\n\r\nIt also doesn’t help that the thought crosses his mind at the same time the vibrator is slipped into his ass and turned on. He gags on the cock that follows, immediately slipping out of his thoughts and trying to adjust to having a cock fucking his throat."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52525252, "type": "ooc", "edited": "2018-10-14T04:41:46.343898", "format": "raw", "posted": "2018-10-14T04:41:46.343898", "text": "(( hi, I'll try to reply to the RPs tomorrow. I've had a busy couple of days"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52526923, "type": "ooc", "edited": "2018-10-14T06:07:06.265969", "format": "raw", "posted": "2018-10-14T06:07:06.265969", "text": "Same here! Don’t worry about it and take your time"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52541008, "type": "ic", "edited": "2018-10-15T03:13:19.299213", "format": "raw", "posted": "2018-10-15T03:13:19.299213", "text": "The rest of the Brigade watches on as one of the members fucks Choro's throat and waits for he inevitable moment when he cums. His hair is pulled back as the man thrusts as hard as he can, cock eventually releasing down his throat. All the while, he grips onto the back of Choro's head to keep him in place and force him to swallow all of it.\r\n\r\nPulling back and panting, the man chuckles as he pinches one of Choro's nipples. A self-satisfied smirk lights his face at the Matsu's humiliating position, filled with an inhuman amount of sadistic glee.\r\n\r\n\"You're gonna have to get used to taking cock after cock once the convention comes around,\" he explains as he rubs his permanently trapped cock. \"We're gonna give you and your pig brothers lots of training over these next few days, got it?\"\r\n\r\nHe pays him on the head before standing up, turning to Oso in his new bitchsuit.\r\n\r\n\"You wanna say something to Choro-chan before we stuff him in that sack for a few hours?\" He asks, the other members lifting Choro towards the sleepsack Oso had been stuffed in prior."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52543132, "type": "ic", "edited": "2018-10-15T04:47:29.353833", "format": "raw", "posted": "2018-10-15T04:47:29.353833", "text": "Already trained to swallow by the milker, Choro doesn’t make much of a fuss when he has to take the other man’s cum. It’s more embarrassing that he welcomes the taste more than anything else. It was more difficult for him when it was only the one if anything. With the milker he’d practically been in a trance when it came to methodically swallowing his own cum.\r\n\r\nOso’s eyes narrow as he looks at Choro. He can’t believe that he just sold out their other brothers so quickly - especially now that he can see what humiliating and inescapable positions they’ve been put into. Huffing with disdain, he turns his head away from Choro."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52859109, "type": "ic", "edited": "2018-11-04T20:01:37.329196", "format": "raw", "posted": "2018-11-04T20:01:37.329196", "text": "The Brigade snickers at Oso's angry reaction, remembering his initial worry for Choro's wellbeing when he was first captured. All of that seems to be gone now as his brother is brought closer to the sleepsack, where he'll stay for a few hours. At least, that was the plan until one of the captors gets a new idea.\r\n\r\n\"These little pigs should get along, don't you think? Maybe we should put them both inside a sack so they can talk out their problems.\"\r\n\r\nThe rest of the Brigade agrees as another sack is brought out - a big transparent bag that could hold up to two people and be hung from hooks on the ceiling. Oso is lifted up from his position on the floor and is placed inside along with his brother, upturned noses and open mouths pressed together in a humiliating spectacle.\r\n\r\nThe bag keeps their bodies pressed tightly together, bulges touching and mouths forced into a sloppy kiss. When the bag is attached to the ceiling, the two are on full display for everyone to gawk at with no chance of escape.\r\n\r\n\"We'll leave you pigs up there for two hours,\" one member says as he advances in on the remaining sextuplets. \"If you're good boys, we might let you down a little early.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52933414, "type": "ooc", "edited": "2018-11-09T06:32:08.384493", "format": "raw", "posted": "2018-11-09T06:32:08.384493", "text": "Sorry I haven’t responded yet, I’m working on some stuff to prepare for finals"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52938376, "type": "ooc", "edited": "2018-11-09T17:48:52.429179", "format": "raw", "posted": "2018-11-09T17:48:52.429179", "text": "(( it's fine, I understand! I'm in no rush"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53034934, "type": "ic", "edited": "2018-11-15T05:06:23.888875", "format": "raw", "posted": "2018-11-15T05:06:23.888875", "text": "Choro and Oso share a similar reaction when the transparent bag is brought out. Namely surprise and stammered protests as they’re both manhandled inside and hung from the ceiling.\r\n\r\nThe remaining Matsus are momentarily distracted by the display, eyes wide as they watch their brothers moan and writhe against once another.\r\n\r\nIn the positions that they’re in, every movement causes their bulges to rub against one another while they kiss. Struggling does nothing except cause the two to hump against one another uselessly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53035759, "type": "ic", "edited": "2018-11-15T05:54:09.142854", "format": "raw", "posted": "2018-11-15T05:54:09.142854", "text": "The Brigade members laugh as the quiet squeaking of the rubber suits can be heard within the bag. Oso and Choro are completely trapped, forced to \"talk out their problems\" through forced kissing.\r\n\r\n\"Now, which little pig should we torture next?\" One says, eyes aimed at Ichi. \"What about the one with the messy hair?\"\r\n\r\nHe bends down to look him in the eyes, hands reaching up to cup and squish his cheeks. Another Brigade member rubs his bulge, the final one pulling on his nipples.\r\n\r\n\"You wanna beg for mercy, piggie? Or do you want us to treat you like the trash you are?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53036317, "type": "ic", "edited": "2018-11-15T06:37:31.315944", "format": "raw", "posted": "2018-11-15T06:37:31.315944", "text": "Ichi swallows nervously when the attention turns to him. He’d been hoping that his propensity to fade into the background would aid him in his current situation. At least in the sense that the brigade members would cycle through the rest of his brothers before landing their eyes on him.\r\n\r\nNo such luck apparently.\r\n\r\nHe tries to move away but can’t get a lot of distance between himself and his captors, unused to moving quickly on his knees and elbows. Ichi whines when his cheeks are squished, forcing his mouth open even more than the nose hooks were already. \r\n\r\nSquirming and wiggling, Ichi starts panting when his bulge is rubbed - interspersed with pained yelps.\r\n\r\n“Pweah, pweah!”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53044495, "type": "ic", "edited": "2018-11-15T22:40:08.138780", "format": "raw", "posted": "2018-11-15T22:40:08.138780", "text": "The Brigade snickers at Ichi's pathetic pleading, the one squishing his cheeks giving him a deep kiss. His tongue forcibly presses against Ichi's and before long he pulls away, excess saliva to falling from their parted lips.\r\n\r\n\"Poor little pig,\" he taunts with a pat on the cheek. \"Aren't you just the most miserable little thing... I want to hear more.\"\r\n\r\nOne member lifts Ichi up onto a sitting position on his legs before tugging at the clamps. The group surrounds him with impure intentions, one having grabbed a dildo and another with a taser.\r\n\r\n\"How about we make an example out of you for your pig brothers?\" The one with the taser asks as he approaches him. \"Or would you rather us do it to someone else? Just say something and we'll consider it.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53114508, "type": "ooc", "edited": "2018-11-20T04:28:35.742491", "format": "raw", "posted": "2018-11-20T04:28:35.742491", "text": "(( I apologize for taking a while in responding to the other RPs as I've been a little busy. I hope you're doing well!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53140425, "type": "ooc", "edited": "2018-11-22T01:20:57.006914", "format": "raw", "posted": "2018-11-22T01:20:57.006914", "text": "It’s no problem!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53140430, "type": "ooc", "edited": "2018-11-22T01:21:17.683241", "format": "raw", "posted": "2018-11-22T01:21:17.683241", "text": "Happy Thanksgiving"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53145969, "type": "ooc", "edited": "2018-11-22T07:56:41.447851", "format": "raw", "posted": "2018-11-22T07:56:41.447851", "text": "(( thanks so much! hope you have a good one"}]