[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56390793, "type": "ic", "edited": "2019-05-24T08:32:19.510327", "format": "raw", "posted": "2019-05-24T08:32:19.510327", "text": "\"Ah, pig number one wins this time,\" one man laughs as he drags Choro to the vats with difficulty. The other Matsus are rolled on their backs, their bulges stroked as the punishment is carefully repeated.\r\n\r\n\"Dumb little piggies get their useless little bulges tortured,\" one explains as Choro's throat is fitted with the feeding tube. \"This will go on for ten minutes, while your disgusting brother that sold you out will get the reward.\"\r\n\r\nVibrators are each pressed against their bulges, administering endless frustration while they can do nothing but take it.\r\n\r\nThe Brigade member watching over Choro leans in his ear as he slurps down the slop, voice low and threatening.\r\n\r\n\"Don't you feel any shame at all? To think you were so unwilling to be tied up and fucked in that bathroom... now you're just a broken, chubby little pig.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56390828, "type": "ic", "edited": "2019-05-24T08:38:11.039817", "format": "raw", "posted": "2019-05-24T08:38:11.039817", "text": "Each of their cocks strain against their latex prison, causing the Matsus to jump the vibrators in search of any friction they can get. It almost pains them with how much they want to cum, oinking for mercy as their hips buck in the air.\r\n\r\nChoro sucks greedily on the tube of slop, hardly registering that he’s being spoken to at first. \r\n\r\nHe glances at the man as he continues to way, a far cry from the sniveling coward that had been fucked into submission in the bathroom. Now he’s just a broken pig living for his next meal."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56440262, "type": "ic", "edited": "2019-05-27T08:03:19.852551", "format": "raw", "posted": "2019-05-27T08:03:19.852551", "text": "The desperate oinking from the remaining sextuplets is music to their captors' ears. From the way they've been begging for food it's clear that they've all been broken down from the harsh training. Of course, the Brigade doesn't care as they continue to torture the pigs with the vibrators, rubbing their chubby stomachs as they strain against the latex.\r\n\r\n\"There, there,\" the one near Oso coos as he presses the toy harder into his bulge. \"You'll be fed again... you just didn't get rewarded is all.\"\r\n\r\nHe gives him a kiss to the cheek, then leans in his ear after giving it a nibble.\r\n\r\n\"I can tell you what won't happen though... and that's you ever cumming again.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56474995, "type": "ic", "edited": "2019-05-29T03:47:13.427572", "format": "raw", "posted": "2019-05-29T03:47:13.427572", "text": "Five minutes ago Oso likely would have felt a chill run up his spine at the comment. For someone who until just recently had been a virgin NEET, he was well acquainted with cumming with his hand alone - and quite often when he could find the time. The thought of never cumming again would have terrified him. Presently, the eldest continues to oink and wiggle his chubby body in search for the mind numbing pleasure the vibrator brings as it’s pressed into his bulge.\r\n\r\nHis brothers find themselves in a similar state of mind, drooling as they think about their next serving of the addictive slop. Just about anything could be said or done to them and they’d probably not even notice - their intelligence and resistance leaving them to further fulfill their roles as docile fuck pigs. \r\n\r\nAny previous issues they may have had with Choro for selling them out have completely disappeared - though it doesn’t stop any new problems from rearing their heads. Five sets of narrowed eyes look at Choro in jealousy as he slobbers and drools around the tube in his mouth and sucks down the contents of the vats. They don’t even seem to care that they’re being punished, only that Choro gets to eat when they don’t."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56476954, "type": "ic", "edited": "2019-05-29T06:13:13.085563", "format": "raw", "posted": "2019-05-29T06:13:13.085563", "text": "The man snickers as Oso ruts against the vibrator, pleased with his transformation from an unwilling and humiliated victim into a greedy, horny, chubby little pig. The other Brigade members are just as amused by the sextuplets' change in attitude, erections forming in their pants as they watch them flail and squeal.\r\n\r\nWhen Choro's vat is empty, the Brigade pulls out the tube lodged in his mouth, pressing down on his tongue and poking his chubby cheeks.\r\n\r\n\"Such a disgusting little piggy,\" one teases as he rubs his bulge. \"We could do anything to you and you'd be fine with it as long as you got fed. Isn't that right?\"\r\n\r\nHe notices the other envious glares from Choro's brothers and turns to them with a grin.\r\n\r\n\"Don't worry, you'll get plenty of opportunities to be rewarded,\" he says as the other members ease off the vibes. \"In fact, why don't we have another competition?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56476994, "type": "ic", "edited": "2019-05-29T06:18:40.316273", "format": "raw", "posted": "2019-05-29T06:18:40.316273", "text": "The level of comprehension between the Matsus is significantly lower now that they’ve been broken into more desirable forms by the Brigade but even in a state where all they care about is food and pleasure, they understand what a competition means.\r\n\r\nWinner gets more food.\r\n\r\nThey’re able to think a little more clearly with the vibrators are taken away and the prospect of being rewarded with more food is enough to get the six brothers squealing with excitement all over again. Even Choro whose just finished a meal of hedonistic proportions looks excited to compete, nodding along to the member who rubs his bulge."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56477100, "type": "ic", "edited": "2019-05-29T06:28:34.804954", "format": "raw", "posted": "2019-05-29T06:28:34.804954", "text": "The member rubbing Choro smirks as the sextuplets' faces light up, standing up to explain the rules to them.\r\n\r\n\"This time, the six of you will be pleasuring your masters by giving us blowjobs. The winner gets to be fed, the losers receive electric shocks. Whoever gets a master to cum first is the winner.\"\r\n\r\nThe Brigade gets on their knees in front of their slaves, taking off their pants and freeing their cocks in front of their mouths.\r\n\r\n\"Put those mouths to good use, you hear? Ready... go!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56477208, "type": "ic", "edited": "2019-05-29T06:38:27.518986", "format": "raw", "posted": "2019-05-29T06:38:27.518986", "text": "Once given the starting signal, the Matsus are off, lurching forward and crawling towards their new masters’ cocks as quickly as they can manage with the new weight that they’ve gained.\r\n\r\nThey each have the benefit of not being able to close their mouths with the severity of the nose hooks that keep them pulled open, drooling on their cocks as they determine the best way to go about winning.\r\n\r\nTwo strategies seem to be the most popular. Oso, Totty, and Kara have started to drag their tongues along the cocks first and even work to lap at their balls with their new master’s cocks laid across their chubby faces. Choro and Jyushi decide just to go in and take the cocks as far as they can and start sucking like they would on one of the feeding tubes. \r\n\r\nIchi on the other hand seems to have taken a different approach. He crawls a little further up into his master’s lap, straining himself to plant a sloppy kiss on his lips before sinking back down. He works the member’s cock between his forelegs, dipping his head low to start bobbing up and down."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56477340, "type": "ic", "edited": "2019-05-29T06:51:49.754001", "format": "raw", "posted": "2019-05-29T06:51:49.754001", "text": "The room is filled with the groans of the Brigade members as their pig slaves work on their cocks, each one pleased with the attention. Ichi's tormentor in particular seems to be enjoying his method, even giving him a kiss back. When he starts sucking, he starts to moan as he bucks his hips, enjoying the sight of the all the pigs desperately slobbering and sucking on cocks.\r\n\r\nThe sight combined with the pleasure sends him over the edge, cumming just seconds before Jyushi's tormentor. As he cums, he holds Ichi's head in place to force him to choke on it.\r\n\r\nWhen he pulls back, he gives him a pat and kiss to the cheek, dragging him over to the vats with difficulty.\r\n\r\n\"You know this means the rest of you will get shocked, right?\" He snickers as he shoves the tube in Ichi's mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56479178, "type": "ic", "edited": "2019-05-29T12:46:47.825138", "format": "raw", "posted": "2019-05-29T12:46:47.825138", "text": "Jyushi squeals happily when he swallow’s down his master’s cum, think that he’s won when he sees that his brothers are still sucking cock. It takes a moment for him to realize that he must have lost by only a few seconds to Ichi, still choking on cock and cum as his head is forced down.\r\n\r\nThe Matsus watch as Ichi is dragged over to what has arguably become their favorite area of the room, their brother hooked up and ready to guzzle down his next meal.\r\n\r\n“Hacond palash,” Jyushi gargles hopefully, not wanting to get shocked. He oinks after finishing speaking, drool coating his chin.\r\n\r\nThe other Matsus hardly even react. Those that had experienced the painful shocks before could hardly care now they’ve been broken into pig slaves. Pain and pleasure were one and the same to them."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56655755, "type": "ic", "edited": "2019-06-08T21:22:00.959007", "format": "raw", "posted": "2019-06-08T21:22:00.959007", "text": "Snickering fills the room as Jyushi gargles his slurred plea. Being broken down and abused had done wonders for the six, transforming them into perfect pig slaves that wanted nothing more than to eat their slop.\r\n\r\n\"No can do, piggy,\" one member says as he squats down to pinch Jyushi's cheek. \"You have to earn the extra servings, just like your brothers. Try harder next time, okay?\"\r\n\r\nThe Matsus with the exception of Ichi are all rolled on their backs as the tasers are prepared. Shocks are given all over their chubby bodies, from their stomachs to their permanently trapped bulges.\r\n\r\nMeanwhile, Ichi has the honor of having more food pumped into his stomach as his reward. The member in charge of him rubs his bulge and pinches his cheek, an erection growing in his own pants as he watches Ichi slurp down the food."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56660925, "type": "ic", "edited": "2019-06-09T02:57:42.400468", "format": "raw", "posted": "2019-06-09T02:57:42.400468", "text": "The training room is soon filled with the sound of five squealing Matsus. Even those that had already endured the tasers seem unused to the electricity as the current travels through the latex. The worse shocks are delivered to their trapped bulges, making Oso, Kara, and Totty break down into tears.\r\n\r\nNo matter how much they squirm, there’s no longer any possibility of them being capable of rolling themselves over. The Brigade’s slop did its job perfectly, turning each brother into chubby pig slaves that would be incapable of taking care of themselves - their bitchsuits (which were fitted more to their smaller, original selves) would no longer be able to be taken off unless they were cut away. \r\n\r\nThe latex stretches further and further the more they’re fed, Ichi’s suit straining to contain him as he downs his reward as greedily as he possibly can. His throat pulses as he swallows, and he would be done far faster than it would take his brothers to be punished.\r\n\r\nNot that he cares. And really, in switched positions, neither would any of the other Matsus. In this situation, it was a lot easier to be selfish and only look out for themselves."}]