[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54937674, "type": "ic", "edited": "2019-03-01T04:42:11.856342", "format": "raw", "posted": "2019-03-01T04:42:11.856342", "text": "Both tentacles stuffed into Ichi's ass and throat thrust in tandem, the goopy substance that encases Ichi squeezing tighter and forcing each tendril further down. It's as if Ichi is in a transparent vacbed with how tight and form-fitting the slime enveloping him is.\r\n\r\nThe slime wiggles in pleasure in response to Ichi's screams and moans, the sound waves vibrating against its gelatinous body sending pleasant shudders all around.\r\n\r\nNo humans or monsters can be spotted for miles, leaving the slime to do whatever it likes to its new plaything. It spends close to two hours sending vibrations to Ichi's trapped cock, tentacles thrusting at different speeds as it slowly slides along the ground and deep into the forest."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 54937970, "type": "ic", "edited": "2019-03-01T05:02:54.895070", "format": "raw", "posted": "2019-03-01T05:02:54.895070", "text": "Ichi gargles helplessly as the slime moves deeper and deeper into the forest. With the vacbed like consistency it becomes completely impossible for him to move, trapped within the monster and shuddering when the vibrations start around his cock.\r\n\r\nWhen they start to thrust at different speeds, he tries to let out a muffled whine, choking on the tentacle down his throat as tears come to his eyes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54976529, "type": "ic", "edited": "2019-03-03T07:41:59.895970", "format": "raw", "posted": "2019-03-03T07:41:59.895970", "text": "After a total of three hours traveling through the forest and molesting Ichi, the slime finally reaches a giant cave. It slips inside, still holding Ichi in its gooey grip.\r\n\r\nIt takes a short while before the slime reaches an area surrounded by other slimes, each one showing interest and making curious noises as they gather around Ichi. They can't do much but observe as the slimy vacbed squeezes him tighter, the tentacles finally disappearing and leaving his throat and ass empty.\r\n\r\nNow he's just on display for any nearby monsters to see his humiliating position, completely trapped and unable to move."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 54998157, "type": "ic", "edited": "2019-03-04T08:29:09.110220", "format": "raw", "posted": "2019-03-04T08:29:09.110220", "text": "Three hours inside of the slime and Ichi looks like a complete mess. He’s unable to move and free himself but somehow in the process of being fucked his position inside has changed a little bit. Ichi still looks horrified, but by the time that the tentacles disappear he’s ended up with his mouth open and tongue hanging out wantingly with pleading eyes.\r\n\r\nThere’s a barely audible whimper that escapes his throat when the slime continues to squeeze him to a point that almost hurts. \r\n\r\nLooking at the other slimes, Ichi becomes nervous that he’s so vulnerable while on display for them to watch. He finds himself retracting his silent request for help with the knowledge that he’s likely just end up with another slime."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55018290, "type": "ic", "edited": "2019-03-05T07:06:09.571154", "format": "raw", "posted": "2019-03-05T07:06:09.571154", "text": "The other slimes all watch Ichi as the slime containing him loosens its grip and lets him drop to the floor. They all surround him, leaving no room for escape unless he wanted to step in one and become trapped again.\r\n\r\nIt takes a few minutes for another monster to notice the guest, this one much more feminine and humanoid-looking - spider legs and eyes defining her as a drider. Peering inside, she can't help but feel enamored by how helpless the human looks, surrounded by slimes and completely naked.\r\n\r\nThe slimes clear a path for her as she shoos them aside, crawling towards Ichi and shooting her silk towards him to wrap his body up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 55019862, "type": "ic", "edited": "2019-03-05T10:16:34.544718", "format": "raw", "posted": "2019-03-05T10:16:34.544718", "text": "Ichi gasps, taking in huge gulps of air the moment that he’s released. It was surprising that he even lasted as long as he did without passing out even though he almost wished that he had. He has no doubts that he would if he were snatched up again - making him weary of touching one of the ones surrounding him once he’s let go.\r\n\r\nWhat even were these creatures? He hadn’t heard or seen anything like them on the island resort but they looked like slimes from one of Jyushi’s video games. \r\n\r\n“Oh thank goodness,” he sighs in relief when he sees the drider, only making out the top half of her body initially and going wide eyed when he sees the bottom. It gives her the perfect opportunity to web him up in a cocoon that prevents him from escaping the cave."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55035498, "type": "ic", "edited": "2019-03-06T05:54:15.321162", "format": "raw", "posted": "2019-03-06T05:54:06.318858", "text": "The drider giggles as the silk constricts around Ichi, leaving him all wrapped up save for his head. The slimes continue to form a path between her and her captive until there's not a single slime separating the two.\r\n\r\n\"I haven't seen your face around here,\" she says, reaching down to stroke Ichi's cheek. \"I hope you realize that there's no escape once you've been brought to this cave. You're nothing but a plaything now.\"\r\n\r\nThe drider uses more silk to wrap up Ichi, this time focusing on his head and mouth as she transforms him into a silk mummy. With him all wrapped up with no chance of escape, the drider lifts him up and places him on her back, moving out to travel to another area of the cave - where many driders await."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 55144984, "type": "ic", "edited": "2019-03-12T04:16:47.634622", "format": "raw", "posted": "2019-03-12T04:16:47.634622", "text": "Ichi struggles the best he can in his mummified form, doing little more than to rock back and forth on the floor of the cave. Thankfully, the slimes have been backing off since the drider’s arrival and he didn’t manage to get himself sucked back into one of the translucent masses. \r\n\r\n“I’m o-on vacation,” he manages to stammer out. He feels extremely stupid too. There’s no way that the pitiful explanation would get him any mercy. “Listen, you don’t have to do this, I can leave and you won’t see me around here ever aga-“\r\n\r\nThe poor Matsu is cut off by the new webbing that fills his mouth before wrapping around his head and completing his look to be a mummy. Now he’s blind and deaf to the world around him, oblivious to the group of driders."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55147190, "type": "ic", "edited": "2019-03-12T06:26:50.517820", "format": "raw", "posted": "2019-03-12T06:26:50.517820", "text": "The driders notice the Ichi mummy right away. They all wait patiently as the drider climbs up, gently placing the new plaything on the webbing. They all surround him, cooing about how cute he looks all wrapped up and helpless.\r\n\r\nBut they aren't satisfied with just admiring him. A few driders approach Ichi and rip off the silk covering his cock, putting it on display for them to mock and toy with.\r\n\r\nOne drider lifts up Ichi's form as the other strokes him off, the former occasionally plugging his nose to torture him further."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 55147278, "type": "ic", "edited": "2019-03-12T06:36:01.852153", "format": "raw", "posted": "2019-03-12T06:36:01.852153", "text": "He can’t help the feeling of dread that shoots up his spine when he feels air on his cock, knowing that it meant it was freed from the rest of the webbing. Ichi’s entire mummified form vibrates as he tries to escape, though his efforts are completely futile. \r\n\r\nHe jerks more when his nose is pinched shut, cutting off his only supply of air. In his current position he’s so easy to toy with.\r\n\r\nIt doesn’t take long before his form goes limp as he passes out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55313934, "type": "ic", "edited": "2019-03-22T06:47:40.409808", "format": "raw", "posted": "2019-03-22T06:47:40.409808", "text": "The driders all leave Ichi alone after he passes out, allowing him to rest on the webbing. However, word spreads fast in the cave, and it eventually reaches the strongest monster that dwells inside.\r\n\r\nLarge and beast-like, the monster easily towers over humans by several feet. Upon hearing that a new and cute plaything was captured, he decides he wants to see him for himself.\r\n\r\nThe driders reluctantly hand him over, knowing that the large beast's word is final. He leaves Ichi tied up in the silk webbing, locking him away in the heated area of the cave in which he resided.\r\n\r\nHe just had to wait for him to wake up, then the real fun could begin."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 55314528, "type": "ic", "edited": "2019-03-22T08:32:18.656110", "format": "raw", "posted": "2019-03-22T08:32:18.656110", "text": "Ichi’s head hangs low in his unconscious state, webbed up with only his cock on display in the cool cave air when the large beast makes his appearance. He’s completely oblivious to another monster showing up with the express intent of using him like a toy. All he needed to do was wake up.\r\n\r\nAnd Ichi does. Sweating profusely underneath all the webbing once he comes around, head bobbing jerkily as he fights against the heat making him even groggier than he already is.\r\n\r\nHe doesn’t even need to see to know that he’s in another part of the cave and by now Ichi’s discovered that it typically meant he’d been moved and surrounded by a different type of monster."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56211423, "type": "ic", "edited": "2019-05-13T16:44:05.018123", "format": "raw", "posted": "2019-05-13T16:44:05.018123", "text": "The beast has been keeping a close eye on Ichi's mummified form, so he notices almost right away when he jerks his head to signal he's awake. Towering over him, he rips off the webbing covering his eyes, wanting to see the fear in his expression.\r\n\r\n\"Such a pretty little plaything,\" he coos, his face in front of Ichi's. \"The heat must really be getting to you... too bad you'll be staying like this for the rest of the night.\"\r\n\r\nThe monster's tongue lolls out of his mouth and wraps around Ichi's cock, stroking it with its prehensile abilities. While he strokes him off, a slime crawls in in the form of a gelatinous snake-like creature. It inches towards Ichi before wrapping around his neck and squeezing to cut off his air."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 56218997, "type": "ic", "edited": "2019-05-14T01:32:05.549187", "format": "raw", "posted": "2019-05-14T01:32:05.549187", "text": "Ichi can only blink as he stares at the monster’s much larger form. This wasn’t going to end well for him at all, he knew it. There’s certainly fear in his eyes as they dart around and try to catalogue just how big the strongest monster in the cave is. For the rest of the night! He couldn’t do this, not after being used by the other monsters in the cavern.\r\n\r\nStill staring into the monster’s eyes, Ichi blanches when he feels the wet tongue wrap around his cock and start to stroke him off. He squirms futile, panting through the layers of silk as his member starts to harden with the attention and leak pre. \r\n\r\n‘Nnnnh!” He grunts just before the slime wraps around his neck and he starts to wheeze shallowly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56302668, "type": "ic", "edited": "2019-05-19T05:22:30.477669", "format": "raw", "posted": "2019-05-19T05:22:30.477669", "text": "The sudden appearance of the slime doesn't bother the larger monster at all, despite him wanting Ichi all to himself tonight. Hearing him wheeze for breath only turns him on more as he continues to lap feverishly at his erect cock.\r\n\r\nThe slime lossens for a second to allow him to breathe, but it's shortlived as it wraps around once more to choke him. It only loosens up to prevent him from passing out, eager to see him suffer at the hands and tongue of the larger monster.\r\n\r\nThe beast digs his claws into the ground as he pants, not wanting to tear open the webbing covering most of Ichi's body."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 56303160, "type": "ic", "edited": "2019-05-19T06:04:58.833225", "format": "raw", "posted": "2019-05-19T06:04:58.833225", "text": "Ichi doesn’t know what to do in this situation. Not that there’s much he can do in the first place. With all the webbing still in place all he can really do is lay through the torment and hope that he provides enough entertainment like this. His cock twitches in the monter’s tongue, spurred on by the lack of air and the warm wetness provided by the much larger monster. The edges of his vision are ringed with black even though the slime won’t let him pass out, relinquishing it’s grip each time that Ichi feels as though he’s about to pass out.\r\n\r\nIt doesn’t take much more of this treatment before he starts choking up, cock twitching before spurting his cum all over the prehensile tongue. His eyes even nearly roll back in his head as he does so, breathing shallowly with the slime still wrapped around his neck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 56303435, "type": "ic", "edited": "2019-05-19T06:31:29.209510", "format": "raw", "posted": "2019-05-19T06:31:29.209510", "text": "Retracting his tongue into his mouth, the monster swallows Ichi's cum eagerly. The eyes rolling to the back of his head makes his own cock hard, along with the shallow breaths he took while the slime choked him. Even now, the slime still clings to his neck, making quiet noises as the larger monster runs his hands along Ichi's sides.\r\n\r\n\"It's only fair that you get me off, after I was so kind to help you,\" he says as he leans him upwards and shoves his face in front of his huge cock. \"I want to see how well you can take this down your throat.\"\r\n\r\nRipping off the webbing filling Ichi's mouth, the monster runs his index finger along his bottom lip before shoving his cock down his throat and thrusting madly."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "6A006A", "show_edited": false, "id": 56303499, "type": "ic", "edited": "2019-05-19T06:38:10.790790", "format": "raw", "posted": "2019-05-19T06:38:10.790790", "text": "There’s only one way Ichi can see this going and he’s proved correctly when the webbing is ripped off his mouth and the monster thrusts in with little care for whether or not Ichi was ready. His throat is tight around the monster’s cock as the slime continues to choke him, and Ichi’s chest heaves as he struggles to breath around the monstrous appendage.\r\n\r\nWith no way to move or help himself in any way, he can only lie there and let the monster fuck his throat with no restrictions."}]