[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48742419, "type": "ooc", "edited": "2018-03-14T22:08:50.634557", "format": null, "posted": "2018-03-14T22:08:50.634557", "text": "(( right! and Kara tries to fight it but eventually he falls under the soothing voice as he continues being put into heavier restraints"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 48744647, "type": "ooc", "edited": "2018-03-15T00:16:25.274504", "format": null, "posted": "2018-03-15T00:16:25.274504", "text": "Yup yup!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48749570, "type": "ooc", "edited": "2018-03-15T04:47:53.104751", "format": null, "posted": "2018-03-15T04:47:53.104751", "text": "(( could you post something in the directory possibly? I'd love to do this idea"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 48749950, "type": "ooc", "edited": "2018-03-15T05:14:03.372217", "format": null, "posted": "2018-03-15T05:14:03.372217", "text": "Definitely! I’ll put up here in a bit"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48750024, "type": "ooc", "edited": "2018-03-15T05:19:53.329773", "format": null, "posted": "2018-03-15T05:19:53.329773", "text": "(( sounds good!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 48750078, "type": "ooc", "edited": "2018-03-15T05:25:49.725224", "format": null, "posted": "2018-03-15T05:25:49.725224", "text": "It’s up!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 48750138, "type": "ic", "edited": "2018-03-15T05:29:05.438731", "format": null, "posted": "2018-03-15T05:29:05.438731", "text": "Karla squirms in his seat as he’s toyed with. His nipples are sore and the bulge of his cock makes him restless - panting heavily around the gag and through the mask. He doesn’t know how long the ride takes, but the nerd is thankful when he’s put on the ground again.\r\n\r\nEven if he spends most of it loping after the group blindly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48765839, "type": "ic", "edited": "2018-03-16T04:01:36.925125", "format": null, "posted": "2018-03-16T04:01:36.925125", "text": "The bullies continue to tug the leash until they reach the park, sitting on a bench and tying their pup to a pole. They sit in silence, taking in the nice summer breeze and the sounds of chirping birds. Occasionally, they toy with Karla, rubbing at his bulge and pinching his nipples.\r\n\r\nA few people walk up to Karla, admiring him and even placing him on his back to give him belly rubs, with permission from his owners. Some of the pedestrians even get handsy with him, groping at his bulge and pulling at his nipples.\r\n\r\nAll in all, no one in this town seems shocked that a human is on a leash, even embracing it and contributing to his torment."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "005682", "show_edited": false, "id": 48767840, "type": "ic", "edited": "2018-03-16T05:54:52.458004", "format": null, "posted": "2018-03-16T05:54:52.458004", "text": "I’m in too deep, Karla decides about an hour into their visit.\r\n\r\nIt’s so easy to forget the predicament he’s in when he’s not being berated. The mask cuts off the outside world and practically provides a safe cocoon for him to drift into if he lets his thoughts wander far enough away. \r\n\r\nThe weather is just pleasant enough to not make the suit uncomfortable, and Karla’s chest rises and falls peacefully as he basks in the summer sun - wriggling appropriately when he’s given belly and bulge rubs, whining when his nipples are pinched."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48774843, "type": "ic", "edited": "2018-03-16T21:10:35.832587", "format": null, "posted": "2018-03-16T21:10:35.832587", "text": "After spending quite some time in the park, Danny gets another idea to torture their pet, untying his leash and tugging him out of the park and towards what appeared to be an abandoned building.\r\n\r\nHe and his friends had seen the types of men to go in there, not to mention the noises that came out of it. Their little pup would never see it coming, unless one of the clients paid to take off the mask.\r\n\r\nAfter paying a fee, the bullies start to set up in an empty bedroom, lying Karla down on his back on the mattress. The room is a bit hot, no air conditioning to be found. After making a price list of services, they soon get a few interested clients. The first man to fuck Karla lubes up before sliding in, several men outside the room waiting for their turns as he pounds away."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48961556, "type": "ooc", "edited": "2018-03-27T04:42:50.178149", "format": null, "posted": "2018-03-27T04:42:50.178149", "text": "(( got more ideas for RPs!\r\n\r\n• Matsus get kidnapped by a drider clan, wrapped up in silk cocoons and kept as live toys\r\n\r\n• The Matsus are kidnapped by a mafia and are forced to work for their cafe/brothel\r\n\r\n• A teacher Matsu gets kidnapped by a group of students/other teachers and made into a sex slave for the whole school to enjoy\r\n\r\n• A Matsu is kidnapped and made into a toy, a latex creature enveloping his body as his captors work to make him an obedient sex doll to eventually sell away"}]