[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939041, "type": "ic", "edited": "2019-03-01T06:08:48.348846", "format": "raw", "posted": "2019-03-01T06:08:48.348826", "text": "You know who you are!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939045, "type": "ooc", "edited": "2019-03-01T06:08:55.643870", "format": "raw", "posted": "2019-03-01T06:08:55.643870", "text": "I do know who I am!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939051, "type": "ooc", "edited": "2019-03-01T06:09:17.207204", "format": "raw", "posted": "2019-03-01T06:09:17.207204", "text": "(( nice! anything else to discuss?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939058, "type": "ooc", "edited": "2019-03-01T06:09:34.959557", "format": "raw", "posted": "2019-03-01T06:09:34.959557", "text": "I think we covered our bases"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939071, "type": "ooc", "edited": "2019-03-01T06:10:25.170235", "format": "raw", "posted": "2019-03-01T06:10:25.170235", "text": "(( alright sweet! would you be okay with starting with oso waking up in his cast?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939193, "type": "ooc", "edited": "2019-03-01T06:17:56.232890", "format": "raw", "posted": "2019-03-01T06:17:56.232890", "text": "Yeah no problem!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939319, "type": "ic", "edited": "2019-03-01T06:25:51.195584", "format": "raw", "posted": "2019-03-01T06:25:51.195584", "text": "Oso came to slowly, blinking away a heavy sleep and feeling even groggier the longer he stayed conscious. Odd, that wasn’t usually how he felt when he got up in the morning. And upon closer inspection he wasn’t even in his bedroom. Had he and his brothers gone out drinking last night and now he couldn’t remember where he ended up? It sounded unlikely.\r\n\r\nDisregarding his confusion, he moves to get up and frowns worriedly when he can’t. The position he was in was strange too. Completely on all fours with his back straightened out and his head held almost uncomfortably high. That’s when he notices the mirror and the panic inducing image that he strikes. He’s in a cast made for broken bones in a hospital that seems to cover every inch of his body from the very top of his neck down with the exception of his cock.\r\n\r\nUnbeknownst to Oso underneath the cast, there are two bullet vibrators attached to his nipples and if he tried to move he’d be quick to notice the tail plug that was stuck in his ass too. In his mouth is a strange gag that forced him to hold his tongue out and drool, with a clothes pin clipped to his painted black nose to force him to pant heavily through his mouth and a pair of dog ears sat on a headband in his hair."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939512, "type": "ic", "edited": "2019-03-01T06:40:05.435532", "format": "raw", "posted": "2019-03-01T06:40:05.435532", "text": "It takes only a minute or two before the \"doctor\" steps inside, closing the door behind him and examining Oso with fascination. In his hand is a clipboard, notes written down on what he was going to reveal to the new captive.\r\n\r\n\"Good morning, Osomatsu,\" the faux doctor snickers. \"You're probably pretty confused as to why you aren't wrapped up in your blanket with your brothers at home. The answer is simple: that place is no longer home to you.\r\n\r\n\"You see, I've found myself in dire need of some sexual gratification. Not just any toy will do. No, I need a few cuties like you and your brothers to be completely at my mercy.\"\r\n\r\nThe doctor ruffles Oso's hair with one hand, the other pressing down on his tongue with its thumb.\r\n\r\n\"You probably think you're in one hell of a bad predicament. Well, your brothers have it worse. When they wake up, they'll find themselves almost completely immobile, isolated from the world around them. You should consider yourself lucky; you actually get to move and see like normal.\"\r\n\r\nHe gives him a pat on the cheek before continuing.\r\n\r\n\"Don't worry, they aren't actually sealed away quite yet. I'll let you see their demises before their senses are cut off forever, so you can whine your goodbyes if you like.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939650, "type": "ic", "edited": "2019-03-01T06:51:59.401131", "format": "raw", "posted": "2019-03-01T06:51:59.401131", "text": "Oso jolts when he hears the door slam to the right of him, not quite able to turn his neck enough to be able to see who came inside. If he wanted any semblance of a normal life now he’d have to learn to adapt to his new body quickly.\r\n\r\nHe tries and fails to pull his head away when the doctor ruffles his hair, gagging when the man presses on his tongue. The two rods on top and bottom are too long to fit inside his mouth, with straps cinched tightly around his head so there was no hope of it falling off.\r\n\r\nHe was horrified to think of his younger brothers in the same situation. How could anything be worse than his current position on the floor like a dog?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939734, "type": "ic", "edited": "2019-03-01T07:00:29.320288", "format": "raw", "posted": "2019-03-01T07:00:29.320288", "text": "The doctor smirks as Oso gags on his fingers, pulling away and standing up to retrieve something from another room. When he returns, he's pushing a rolling platform with an almost entirely encased Karamatsu on top. Only his head pokes out of the cast, the rest of his body crammed inside the tight material. An open mouth gag keeps his mouth wide open, the plug hanging off the side in case the doctor wanted to keep him quiet.\r\n\r\n\"He'll wake up soon,\" he assures Oso as he grabs for a rubber covering. \"When he does, well... it'll be the last time you see his face properly.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939782, "type": "ic", "edited": "2019-03-01T07:04:14.085867", "format": "raw", "posted": "2019-03-01T07:04:14.085867", "text": "Oso releases a pathetic whine when he watches the doctor leave, not wanting to be left alone in such a vulnerable state, even if his company would be the man who made him this way to begin with. He cries louder when he sees Kara struggling with his own cast.\r\n\r\nKara’s been put into an almost sitting position with his arms folded like wings, drooling from his gag and sounding surprised when he sees Oso."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939885, "type": "ic", "edited": "2019-03-01T07:14:50.442242", "format": "raw", "posted": "2019-03-01T07:14:50.442242", "text": "The doctor works quickly to cover Kara with the layer of rubber, the shiny material stretching over his body and yanking his head back. His facial features such as the outline of his nose and mouth are faintly visible against the tight rubber as he's completely encased inside. He's given several other rubber layers over his body, squeezing him tightly and making him completely immobile. The final layer of rubber is placed on him several minutes later, his final form revealed to everyone but the isolated Kara: a shiny black rubber duck.\r\n\r\n\"It'll be fairly hard for him to breathe in there, but it's impossible for him to die,\" he explains. \"I'll administer your brothers daily medicine to make sure they're healthy and live long lives as my playthings.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939927, "type": "ic", "edited": "2019-03-01T07:19:42.755150", "format": "raw", "posted": "2019-03-01T07:19:42.755150", "text": "Kara is helpless to resist being put inside layer after layer of clinging latex that gives shape to his new form. He has no idea that there are cartoonish eyes drawn over the outline of his real ones or that part of the latex on one of the outer layers forms his new beak that’s still capable of being filled with the plug. The only difference between him and Oso now is that his cock is trapped under all the latex but his ass is still open to be plugged.\r\n\r\nOso cries as he watches, smudging some of the painted spots on his face as he watches his brother’s transformation and listens to the doctor. At least they’d be taken care of."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54940007, "type": "ic", "edited": "2019-03-01T07:28:36.099661", "format": "raw", "posted": "2019-03-01T07:28:36.099661", "text": "\"Don't worry, Osomatsu,\" the doctor coos as he plugs Kara's mouth with the plug gag. \"Your brother will adjust to his new life as a rubber duck eventually.\"\r\n\r\nHe grabs for a vibrator shaped like a toy fish before lubricating it, sliding it inside Kara's ass. He doesn't turn it on quite yet, lifting up Kara and placing him in a large sink that he fills with water. The new rubber duck floats to the top, and it's at this point that he turns on the switch to the vibe.\r\n\r\n\"Let's see how loud we can make this duckie squeak,\" he chuckles as he turns the vibe up higher and takes out the plug gagging him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54940064, "type": "ic", "edited": "2019-03-01T07:35:14.278935", "format": "raw", "posted": "2019-03-01T07:35:14.278935", "text": "Blinded, Kara panics initially when he feels something enter his ass and feels even worse when he’s placed in the sink and feels the rise and fall of water around him. Oso’s surprised to see that he actually floats in the sink, whining when Kara starts to moan when the toy fish starts to vibrate inside him.\r\n\r\nThe sound becomes louder when the beak is unplugged, quickly turning into squeals of pleasure that become desperate when Kara realizes that he’s unable to cum with his cock trapped between his legs underneath all the latex."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54940125, "type": "ic", "edited": "2019-03-01T07:43:40.458461", "format": "raw", "posted": "2019-03-01T07:43:40.458461", "text": "\"Poor little thing... doomed to a permanent life of chastity.\" The doctor doesn't feel any shame as Kara squeals through his rubber beak. \"Maybe I should just leave him like this, forever pleasured but never able to cum?\"\r\n\r\nHe turns to Oso with a sadistic smirk, tapping on his clipboard.\r\n\r\n\"Up next is Choromatsu. He'll provide you with food and water once you've gotten settled in your new life.\"\r\n\r\nHe leaves the room, only to come back a minute later with Choro. He's wrapped up fairly tight, cock and mouth uncovered as the latter is forced open with a gag.\r\n\r\n\"If you want food, you'll eat from his mouth. If you want water, you'll drink the cum from his cock. Sounds simple, right?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54940181, "type": "ic", "edited": "2019-03-01T07:50:04.618747", "format": "raw", "posted": "2019-03-01T07:50:04.618747", "text": "Oso listens to Kara’s squealing as the doctor speaks, and would be shivering with fear if he were capable of moving inside the cast. Left alone with Kara, he manages to drag himself forward a few centimeters trying to get closer to his brother even though he knew that there was no way for him to communicate that he wasn’t alone.\r\n\r\nHe can’t even decide if Choro is worse off. He’s in a similar looking cast to his own but his arms and legs are forced into an awkward backwards crab position that couldn’t be comfortable- especially with his head wrapped up as well as the rest of his body.\r\n\r\nOso whines when he’s told of Choro’s new life as his food and water dish. Sucking his brother’s cock? He didn’t think he could do it. Eating would be awkward but it didn’t sound nearly as bad."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54946833, "type": "ic", "edited": "2019-03-01T21:25:01.190165", "format": "raw", "posted": "2019-03-01T21:25:01.190165", "text": "The doctor gives Oso a few ruffles of his hair before focusing attention on Choro - placing two fingers into his mouth and against his tongue.\r\n\r\n\"Don't worry, your brother has no idea it's you who will be using him. He's completely blind and deaf, and he'll stay that way forever. At least we can still listen to him moan and cry through the gag, so you know he's still alive.\"\r\n\r\nHe takes his saliva-coated fingers out of Choro's mouth, wiping it on his outermost layer.\r\n\r\n\"In fact, let's hear some of those noises right now.\" The doctor smirks as he strokes Choro off, ready to pull away when he becomes hard."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54957192, "type": "ic", "edited": "2019-03-02T07:04:45.366128", "format": "raw", "posted": "2019-03-02T07:04:45.366128", "text": "Choro gags on the fingers in his throat, caught off guard by the sudden intrusion. The doctor wasn’t lying when he said that the Matsu was blind and deaf, he couldn’t even hear his own cries.\r\n\r\nOso watches, feeling sorry for his poor brother as his moans pick up in volume with the doctor’s hand on his cock. The saddest part is watching Choro’s dick react, precum leaking from the tip."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54957308, "type": "ic", "edited": "2019-03-02T07:13:41.386274", "format": "raw", "posted": "2019-03-02T07:13:41.386274", "text": "Once the doctor is satisfied, he pulls away, leaving Choro hard and on the edge. But he doesn't plan to leave him like that as he picks up Oso and places his mouth in front of his erection.\r\n\r\n\"You two have to get used to your new lives, so go ahead and suck him off. If you don't, I'll punish you both. So be a good boy and have a drink...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54957384, "type": "ic", "edited": "2019-03-02T07:20:35.230531", "format": "raw", "posted": "2019-03-02T07:20:35.230531", "text": "If the cast wasn’t supporting his weight, there’s no way that Choro would have been capable of maintaining his position on his hands and feet for so long. It was exhausting just barely putting work in now and uncomfortable as hell, made even worse when each touch to his uncovered cock is a surprise.\r\n\r\nOso whines, drooling onto Choro’s cock when it’s put in front of him. He really doesn’t want to but doesn’t see what getting punished met - especially for his brother. Hesitantly, he takes Choro’s cock into his mouth with his tongue pressed against the underside as he bobs his head up and down.\r\n\r\nHis younger brother moans through his open gag, oblivious to the fact that it was Oso sucking his cock. It only took a minute for him to cum and Oso swallows as much as he can with his own open mouth, the rest dribbling down his chin."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54957534, "type": "ic", "edited": "2019-03-02T07:36:55.694731", "format": "raw", "posted": "2019-03-02T07:36:55.694731", "text": "The sadistic doctor doesn't bother to clean up the mess on Oso's chin, deciding it's a good and fitting look. However, he does give him a few pats to the cheek - pleased as he watches the cum and saliva drip down his chin.\r\n\r\n\"Good boy,\" he coos, giving his painted forehead a kiss. \"You and your brother are safe from punishment, for now at least.\"\r\n\r\nHe leaves the room to retrieve the materials for the next encasement, coming back with not one, but two Matsus on a rolling examination tray. Ichi and Totty are the next set of victims, both blindfolded and tied tightly together in a 69 position. Their heads remain uncovered for now, effectively gagged by each other's cocks their mouths.\r\n\r\n\"Hope these two learn to get used to the taste, because they're never getting those cocks out of their mouths,\" the doctor laughs as he presses their heads closer to the other's crotch to take each other deeper."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54957584, "type": "ic", "edited": "2019-03-02T07:42:07.321530", "format": "raw", "posted": "2019-03-02T07:42:07.321530", "text": "Oso pants, having lost his breath sucking off Choro with his nose still plugged by the clothespin. If this was really how he wanted to get a drink he’d have to work quickly and effeciently or he’d end up passing out with his mouth around his brother’s cock.\r\n\r\nWhich looks to be the exact predicament that Ichi and Totty found themselves in. They’re both moaning and wiggling against one another as much as they’re able, both pleased with their situation and completely unaware of just who was sucking their cock. If they found out they probably wouldn’t be moaning so much.\r\n\r\nOso whines as he watches their trapped forms, the doctor pushing their heads further down."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54957721, "type": "ic", "edited": "2019-03-02T07:56:42.934815", "format": "raw", "posted": "2019-03-02T07:56:42.934815", "text": "Despite their already tight bindings, the doctor isn't completely satisfied with either Matsu's ability to move. He wouldn't be satisfied unless they were completely immobile and isolated, just like Kara and Choro. So he doesn't hesitate to use tape to tie their heads to the other's cock, leaving them with no way to jerk their heads away. To finish the head part off, he places earplugs into both Matsu's ears before using tape to seal them shut.\r\n\r\nThe tape wraps against the rest of their forms, until they're unrecognizable. He then uses a layer of latex to stretch over their bodies, followed by a final cast casing. The only openings are two holes for their asses for toys and anything else that was necessary.\r\n\r\nNot satisfied yet, he lubricates two vibrators and shoves them inside the brothers, turning both on to a high setting."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54957794, "type": "ic", "edited": "2019-03-02T08:03:13.272058", "format": "raw", "posted": "2019-03-02T08:03:13.272058", "text": "Ichi and Totty both grunt in confusion when the ear plugs are put in, deafening them completely once the tape secured their heads. Based on sound alone it would seem that they were both conflicted - pleased that there was a mouth on their cock but not wanting a cock to be in their mouths. But their bindings give them little choice as they become tighter and tighter. \r\n\r\nOso watches as their forms slowly disappear behind latex and then the same material used to make the cast the rest of the Matsus were in. He was the only one free to see all their torment. And he winces when he watches their new owner shove in the vibrators and turn them up to a setting that even he can hear, their muffled moans mixing with the higher pitched squeals of Kara still floating in the sink.\r\n\r\nChoro gargles the saliva building in his mouth, nearly gagging as he’s forced to swallow his own drool."}]