[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54995768, "type": "ic", "edited": "2019-03-04T05:36:21.283555", "format": "raw", "posted": "2019-03-04T05:36:21.283555", "text": "An erection forms in the doctor's pants as he watches his playthings' torment. With Kara's humiliating new life as a goofy-looking rubber toy, Choro's new and only purpose as a bowl, and Ichi and Totty forced to suck each other off for the rest of their lives, the doctor finds himself pleased with how everything is going, having only dreamed of owning slaves in forced isolation before today.\r\n\r\nHis attention soon focuses on Choro and his pathetic gurgling, reaching for a funnel and stuffing it in his mouth. He then fills the funnel with a snack food for Oso to eat, the pieces big enough so it wouldn't slide down the funnel and into Choro's throat.\r\n\r\n\"Feel free to have a bite,\" he says, failing to mention that he laced the treats with an aphrodisiac."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54997886, "type": "ic", "edited": "2019-03-04T08:03:58.682272", "format": "raw", "posted": "2019-03-04T08:03:58.682272", "text": "Choro whines through his open gag in confusion once the funnel is put in, trying to figure out what the new intrusion was without having his sight. The funnel adds the benefit of making his moaning a little louder but that’s soon muffled by the food placed inside.\r\n\r\nOso watches curiously, not completely sure what’s going on until the funnel is already in. Right, Choro was supposed to be his food and water bowl. Thing is, he is hungry, so he doesn’t have much of a choice to do anything but slowly inch his cast even closer to Choro and crane his neck as much as he can to eat some of the food.\r\n\r\nIt’s a fast acting aphrodisiac, and Oso wants to shudder when he feels it take effect. His panting becomes heavier as his cock hardens."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55109802, "type": "ic", "edited": "2019-03-10T08:02:52.332687", "format": "raw", "posted": "2019-03-10T08:02:52.332687", "text": "The doctor laughs as Oso's panting grows heavy, pleased with the quickness of the drug's effect. He wants nothing more than to tease and humiliate him, evident when he flips him on his back and starts to rub his cock.\r\n\r\n\"Does my doggie want a treat?\" He taunts, pulling away from his cock to grab a few devices from a nearby drawer. Namely, a cock ring and a dildo.\r\n\r\n\"I want nothing more than to see you suffer,\" he explains as he slides the ring on. \"The dildo will be used to train your gag reflex and to deprive you of air. I'll be ecstatic to see your fearful face in a few seconds.\"\r\n\r\nHe shoves in the dildo in Oso's mouth without letting him warm up, thrusting it back and forth against his throat."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55144860, "type": "ic", "edited": "2019-03-12T04:09:18.996521", "format": "raw", "posted": "2019-03-12T04:09:18.996521", "text": "Oso continues to pant, pupils dilated with arousal and panic when he’s flipped onto his back. He’d known he was vulnerable before, but now on his back he realizes that he won’t be able to flip back onto his knees and elbows without the doctor’s help. Like his brothers, he’s completely helpless even with his minor allowance to move.\r\n\r\nHe twitches inside the cast when the cock ring is applied, not wanting the constriction around his erection. This was one of the most unbearable experiences when it was combined with the aphrodisiacs he’d eaten. Cumming is almost all he can think about.\r\n\r\nOso’s tongue is pressed down by the dildo as it’s shoved in his open mouth. He chokes at the immediate intrusion, trying to swallow the drool that’s pooled in the back of his throat. With the clip on his nose it doesn’t take long before he starts to whine in fear."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55147079, "type": "ic", "edited": "2019-03-12T06:19:38.567966", "format": "raw", "posted": "2019-03-12T06:19:38.567966", "text": "\"That's it, take that cock down your throat,\" the sadistic doctor taunts as Oso whines fearfully. \"Can't breathe at all, can you? Must be awful for such a pathetic little puppy.\"\r\n\r\nHe pulls the dildo out of his throat when he senses he's on the verge of passing out, giving him only a few seconds before shoving it in as deeply as it can go.\r\n\r\n\"Worthless cum dumps like you don't deserve the privilege of breathing. You deserve to fight for it and earn it. From now on, everything is a privilege. Breathing, sleeping, moving... all of it is up to me.\"\r\n\r\nHe yanks back on the dildo at the last second before giving Oso a slap to the face.\r\n\r\n\"You'll soon learn to see my punishments and trainings as mercy. You'll want to be disciplined, to be a good pup for your master. Anything to prevent the fate I gave to your brothers.\"\r\n\r\nHe stands up, hand reaching for the doorknob.\r\n\r\n\"Speaking of which... I forgot to show you Jyushimatsu's fate. Would you like to see how helpless he's become?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55147249, "type": "ic", "edited": "2019-03-12T06:32:39.889700", "format": "raw", "posted": "2019-03-12T06:32:39.889700", "text": "The poor puppy Matsu sobs around the dildo, using up even more of his air and energy as he exhausts himself to the point of almost passing out. He gasps when the dildo is removed, sucking in as much air as he can before the cycle repeats itself. \r\n\r\nHe’s nearly on the verge of passing out again when the doctor slaps him and the pain that shoots through his cheek brings him out of it. \r\n\r\nStill on his back and looking at the door upside down, Oso hesitantly barks - trying to get on the doctor’s good side when he asks if he’d like to see his remaining brother."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55147382, "type": "ic", "edited": "2019-03-12T06:45:06.619625", "format": "raw", "posted": "2019-03-12T06:45:06.619625", "text": "The doctor smiles, lifting him up in his arms before opening the door. Leading him down a hallway, he eventually stops in front of the wall - where Jyushi is trapped inside.\r\n\r\nBlinded by a latex mask and gagged with a ring gag, Jyushi is forced into a uncomfortable position with his back against the wall, his feet, cock, nipples and ass on full display as if he were a mounted hunter's trophy. His hands are trapped behind bondage mitts, with no way to grab onto anything. Only very small twitches of his hands or feet are possible, but everything else is doomed to immobility.\r\n\r\n\"No worries, he's still alive,\" the doctor assures as he gives him a harsh pinch to the nipples. \"He's just doomed to a life of a humiliated decoration.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55147469, "type": "ic", "edited": "2019-03-12T06:52:55.622737", "format": "raw", "posted": "2019-03-12T06:52:55.622737", "text": "Jyushi seems to be in nearly as much distress as Oso is, unable to see how far he is off the ground and only able to feel a few parts of his body as the rest of him is inside the wall the doctor has taken Oso to.\r\n\r\nThere’s a small puddle of drool on the floor below him, saliva dripping from his open mouth as his hands and feet twitch. He moans in confusion when he hears approaching footsteps, yelping when his nipple is pinched."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55147613, "type": "ic", "edited": "2019-03-12T07:05:31.287546", "format": "raw", "posted": "2019-03-12T07:05:31.287546", "text": "The doctor continues to pinch at his nipples, humming to himself he enjoys Jyushi's futile squirms. His fingers run over every exposed part of his body before he gently presses his finger against his anus.\r\n\r\n\"Seeing all of you so helpless has really taken its effect on me,\" he says as he unzips his pants. \"Jyushi is more or less a stress reliever.\"\r\n\r\nHe lathers up his cock with lubricant attached right next to Jyushi on the wall before sliding in, panting as he thrusts inside him.\r\n\r\n\"Jyushi here doesn't have a choice but to be used as a cum dumpster,\" he groans as he continues his ministrations. \"He's going to be taking a lot of cock in both holes, whether he likes it or not.\"\r\n\r\nA few minutes later, the doctor cums inside Jyushi, pulling away as he allows his release to fall to the floor to join the puddle of saliva.\r\n\r\n\"I hope he likes the feeling of being penetrated,\" he laughs before smacking him on the ass."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55147703, "type": "ic", "edited": "2019-03-12T07:13:49.454300", "format": "raw", "posted": "2019-03-12T07:13:49.454300", "text": "Oso whimpers as he watches his brother be fucked, the younger Matsu groaning through his gag as his cock twitches and begins to harden in response. It’s fully erect by the time the doctor pulls away and his cum starts to leak back to the floor.\r\n\r\nSeeing that none of his brothers have escaped a horrible fate as one of the doctor’s playthings leaves Oso feeling hopeless, hanging his head as far as the cast allows and jingling the collar around his neck. \r\n\r\nJyushi continues to drool, unable to stop himself."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55155493, "type": "ic", "edited": "2019-03-12T22:12:01.690714", "format": "raw", "posted": "2019-03-12T22:12:01.690714", "text": "While the Matsus no doubt feel hopeless, the doctor only feels lust as he sticks two fingers inside Jyushi's mouth. He pulls away after a few seconds, reaching into his pocket to pull out his keys.\r\n\r\n\"He isn't just a cum dumpster. He also has more practical uses.\" He demonstrates by attaching nipple clamps with chains dangling down, then attaching his keys to one of them.\r\n\r\n\"There we go,\" he says with a smirk. \"Such a good little decoration, isn't he?\" He gives one of his clamps a rug before focusing his attention back on Oso.\r\n\r\n\"By the way... I don't plan on letting you cum anytime soon. If you're a good pup, I might make an exception, but don't count on it.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55162187, "type": "ic", "edited": "2019-03-13T04:14:13.411382", "format": "raw", "posted": "2019-03-13T04:14:13.411382", "text": "Jyushi sticks his tongue out, groaning around the fingers in his mouth as he nearly chokes and it causes him to drool more. With only certain aspects of him showing through the wall he really was reduced to a simple wall decoration with holes to use. He yelps at the pinches to his nipples when the clamps are applied, gurgling when the keys are hung from one of the chains like a weight. \r\n\r\nThey sway with his breathing and tug the nipple down lower than the other, causing a constant ache in his chest. The rough treatment seems to do it for his erection, cock still hard and nearly pressed up against the wall.\r\n\r\nOso flinches for his brother’s sake from his position on the floor before turning his attention back to the doctor. He was still reeling from the effects of the aphrodisiacs but with the cock ring and all the excitement with Jyushi, he’d nearly been able to ignore his own desire to cum.\r\n\r\nAnd now here he was being told that he wouldn’t get to cum except for as a treat if he was good."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55313831, "type": "ic", "edited": "2019-03-22T06:37:42.574895", "format": "raw", "posted": "2019-03-22T06:37:42.574895", "text": "The doctor grins down at Oso's distressed face. With Oso forced on all fours, there's not much he can do to save any of his brothers. All six are stuck in humiliating positions, and it was impossible to know for certain who had it worst.\r\n\r\n\"It's okay, my little pup,\" the doctor says as he ruffles his hair. \"You've got it lucky... being able to move while your brothers are permanently encased. So don't complain about not cumming, okay?\"\r\n\r\nPatting Oso's face, the doctor faces towards Jyushi again, squishing his cheeks together through the latex mask before he attaches a leash to his remaining nipple clamp. He tugs it towards Oso's collar, the leash putting more pressure on Jyushi's poor nipples.\r\n\r\n\"I'm going to give your brothers their 'meals' now,\" he says, standing and walking towards the door. \"Stay put for me, okay?\"\r\n\r\nWith that, he exits to the room where the others are stationed, leaving Oso and Jyushi alone."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55314502, "type": "ic", "edited": "2019-03-22T08:26:41.694827", "format": "raw", "posted": "2019-03-22T08:26:41.694827", "text": "Oso squirms forward a few inches after the doctor before he’s reminded by the tug around his neck and a whine from the wall that he’s now connected to his brother via a leash. Oso turns a little to look at the strap connecting them, Jyushi’s feet wiggling with the need for something to do. One nipple is stretched down by the clamp weighted by the keys while the other is pulled out by Oso on the leash. And would continue to do so even if Oso moved closer given their height difference.\r\n\r\nThe two Matsus will be forced to hang around with one another until the doctor came to retrieve Oso again. \r\n\r\nBut even they weren’t as poorly off as Ichi and Totty being stuck together and forced to suck one another’s cock. Since being left alone both brothers had cum several times and had forced the other to swallow it down before the cycle repeated itself.\r\n\r\nChoro remained in position, bent over backwards with his cock on display and the funnel still tucked into the ring gag. \r\n\r\nAnd Kara bobbed along in the sink, still squeaking as the fish vibrator buzzed inside of him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55396710, "type": "ic", "edited": "2019-03-27T05:57:59.801543", "format": "raw", "posted": "2019-03-27T05:57:59.801543", "text": "The doctor takes his time to admire his confined slaves, all in the same room and unable to move on their own. Although they were his immobile sex objects, they still needed to be kept alive like regular humans with food and nutrients. He knows just the thing to remedy this without having to remove them from their bindings.\r\n\r\nLong, transparent tubes connect to a machine on the wall, with a glass container for pouring food or medicine inside. The tube would shoot the food into their mouth or the medicine up their ass, giving them nutrients in an uncomfortable way.\r\n\r\nThe first slave he focuses on is Kara, still squeaking in the sink from the fish toy in his ass. His mouth is unplugged, giving the doctor the opportunity to shove the tube into his mouth. He pours some wet food inside the machine, watching it as it shoots through the tube and down into Kara's throat."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55396767, "type": "ic", "edited": "2019-03-27T06:03:08.504676", "format": "raw", "posted": "2019-03-27T06:03:08.504676", "text": "Kara gags when something new is inserted into his mouth. Really he was the most aware of the situation other than Oso, having been put into his bondage in front of his brother - so he knew the basic information pretty well. They’d been kidnapped and transformed to be this doctor’s playthings, now he couldn’t move, and something was shoved down his throat who knows how long after the fish toy was put in his ass. \r\n\r\nHe squeals in confusion seconds before the food shoots down the tube, forced to swallow it all down as quickly as he can."}]