[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50940037, "type": "ooc", "edited": "2018-07-13T03:21:10.823718", "format": "raw", "posted": "2018-07-13T03:21:10.823718", "text": "Hmm...we should. I’m trying to think of what would be good. Also as I watch more of it should we include other characters?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50940051, "type": "ooc", "edited": "2018-07-13T03:21:49.009604", "format": "raw", "posted": "2018-07-13T03:21:49.009604", "text": "(( sure, we can include more characters as time goes on!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50940131, "type": "ooc", "edited": "2018-07-13T03:24:41.828195", "format": "raw", "posted": "2018-07-13T03:24:41.828195", "text": "Cool cool! Oh? Maybe instead of waking up in bondage, Tenya wakes up handcuffed and collared to the treadmill and starts with having to run himself to exhaustion?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50940197, "type": "ooc", "edited": "2018-07-13T03:26:59.902913", "format": "raw", "posted": "2018-07-13T03:26:59.902913", "text": "(( sounds good to me! he'd have to run or risk getting choked!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50940298, "type": "ooc", "edited": "2018-07-13T03:31:12.600266", "format": "raw", "posted": "2018-07-13T03:31:12.600266", "text": "(( should any toys or other instruments be used on him while he runs?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50940327, "type": "ooc", "edited": "2018-07-13T03:33:05.831189", "format": "raw", "posted": "2018-07-13T03:33:05.831189", "text": "Maybe not the first time to keep him wondering what’s happening? Probably a gag at the very most"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50940397, "type": "ooc", "edited": "2018-07-13T03:36:39.870645", "format": "raw", "posted": "2018-07-13T03:36:39.870645", "text": "(( alright, I'm good with the gag! would you be alright with writing the starter to this, by the way?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50940601, "type": "ooc", "edited": "2018-07-13T03:46:35.214938", "format": "raw", "posted": "2018-07-13T03:46:35.214938", "text": "Sure can! I should really write more starters for when we do things but I always have a hard time with it at first. Give me a little time and I’ll whip something up"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50940831, "type": "ooc", "edited": "2018-07-13T03:58:40.466561", "format": "raw", "posted": "2018-07-13T03:58:40.466561", "text": "(( awesome!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50940836, "type": "ic", "edited": "2018-07-13T03:58:50.925848", "format": "raw", "posted": "2018-07-13T03:58:50.925848", "text": "Everything is blurry when Tenya comes to. His glasses have to be somewhere nearby. It takes a moment for him to realize that he’s not waking up in his own room - though he doesn’t remember making it home from school either. After that, the panic sets in though he manages to tamper it down and keep his wits about him. Calling for help only results in a muffled groan being released from the ball gag cinched tightly into place. Solidifying further that whenever he is, it can’t be good.\r\n\r\nHe’s standing too. And looking around shows him that he’s standing on a treadmill of all things, wrists cuffed to the bars and a collar with a short chain connected to the very front. Tenya barely has time to ponder what could possibly be going on before the machine starts up and takes him by surprise. \r\n\r\nHe can’t exactly fall off with the way he’s restrained to it, but the taunt chain does cause him to choke as the collar digs into his neck. There was no other option but to start running and keep pace with the machine until his stamina ran out."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50941130, "type": "ic", "edited": "2018-07-13T04:13:13.219854", "format": "raw", "posted": "2018-07-13T04:13:13.219854", "text": "Tenya Iida had amassed a nicely-sized fanbase after being featured at the UA Sports Festival, but with that came stalkers who didn't see him as a person. Rather, they saw him as some sort of object they were entitled to. The cult-like behavior evolved into something darker, and eventually lead to them tracking down and kidnapping the young man.\r\n\r\nThe group of five observe Tenya from another room, a camera recording his movements as he's forced to run on the treadmill. With his strong legs, it would take a while for his stamina to run out, but they were patient. They had plenty of time to play with him, after all.\r\n\r\nAfter a while of watching, one of them presses a button, his voice sounding loud and clear through a speaker in the room Tenya's trapped in.\r\n\r\n\"Hope you have some energy left, because we aren't quite done yet.\"\r\n\r\nThe speed to the treadmill goes even higher, the stalkers awaiting Tenya's exhaustion."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50941274, "type": "ic", "edited": "2018-07-13T04:19:55.146952", "format": "raw", "posted": "2018-07-13T04:19:55.146952", "text": "Drool pools from around the gag as Tenya continues his long strides, keeping an easy pace with the treadmill. He spent enough time training on the machines that if not for the restraints, this wouldn’t be much different from his usual work outs. As is, it’s still familiar enough that after a while at the same steady pace it turns into a monotonous sort of exercise that erases any questions he might have had straight from his mind.\r\n\r\nHe’s so focused that the voice coming through the speakers so suddenly nearly startled him into slipping up again. \r\n\r\nSo there were people responsible for his current predicament, waiting outside the room but likely able to monitor his progress if they were able to comment on his situation. Tenya doesn’t have much time to dwell on the information he’s gathered when the treadmill picks up speed and he has to put his attention into running with the proper form so as to not quickly tire himself out."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50941463, "type": "ic", "edited": "2018-07-13T04:28:44.214339", "format": "raw", "posted": "2018-07-13T04:28:44.214339", "text": "The group snickers as they watch Tenya run faster, taking note of the drool pouring down his chin. The hero in-training didn't look like he was going to run out of energy anytime soon, one of the five not patient enough to deal with this.\r\n\r\nFiddling with the buttons controlling the treadmill, he turns it up even higher, the whirring of the machine audible through the camera. But it's still not enough. Sadism washes over the stalker as he presses a few buttons dealing with the collar - delivering a very quick shock to Tenya's neck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50941711, "type": "ic", "edited": "2018-07-13T04:40:34.943700", "format": "raw", "posted": "2018-07-13T04:40:34.943700", "text": "Tenya manages to keep up with the quickly changing pace of the treadmill’s speed. It was something he worked on in his own time to aid with quick starts and stops. The only difference being that he wasn’t in control of this machine in the slightest.\r\n\r\nThat and the nasty shock the collar gives him. Tenya grunts in pain, teeth digging into the gag as the electricity courses through his body. It’s sudden and painful, enough to make him lose his focus and trip himself up. Which causes more pain as the collar begins to choke him, and Tenya has to grip the handrails and pull himself back into position and start again."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50941864, "type": "ic", "edited": "2018-07-13T04:48:07.165488", "format": "raw", "posted": "2018-07-13T04:48:07.165488", "text": "With the sight of Tenya tripping on the treadmill and getting choked, the group is having the time of their lives as they continue to torment him. As the hours pass, shock after shock is delivered in shorter intervals, rising in intensity in an effort to hear him shout in pain through the gag.\r\n\r\nThe treadmill is eventually turned up all the way, Tenya's captors awaiting any slip-ups and pained groans as his stamina slowly depletes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50941987, "type": "ic", "edited": "2018-07-13T04:54:50.959935", "format": "raw", "posted": "2018-07-13T04:54:50.959935", "text": "At this point, he can’t even identify how long he’s been running. Too long, that much is certain. Even his own training sessions weren’t this grueling. There were no rests, the treadmill only seemed capable of speeding up rather than slowing down and it was wearing on Tenya’s endurance now that it was combined with the electric shocks that would throw him off his rhythm.\r\n\r\nHe’s panting around the gag, reaching the end of his stamina while more drool gathers around the gag and slides down his neck and chest. \r\n\r\nEven without the shocks of electricity eliciting pained grunts, Tenya would be losing his edge by this point. He’s having a harder and harder time keeping up with the treadmill’s speed, movements becoming sluggish as he’s been worn out after hours of running with no break."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50942230, "type": "ic", "edited": "2018-07-13T05:06:44.411372", "format": "raw", "posted": "2018-07-13T05:06:44.411372", "text": "Deciding that their new plaything has had enough, the five slow down the treadmill to an eventual stop, leaving the room to confront the worn-out young man.\r\n\r\nThe fans smirk as they look over Tenya, taking note of the copious amounts of drool pouring down his chin and neck. The leader of the group approaches him, examining his tires body.\r\n\r\n\"You look exhausted,\" he says, his thumb running over his drool-wet bottom lip. \"Don't you know you should take breaks during strenuous exercise?\"\r\n\r\nHe gives Tenya a pat to the cheek, ruffling his hair afterwards. The others surround the treadmill, gazes falling over every inch of him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50942369, "type": "ic", "edited": "2018-07-13T05:12:19.382912", "format": "raw", "posted": "2018-07-13T05:12:19.382912", "text": "If not for the collar and handcuffs, Tenya thinks that he would slump over and catch his breath. At this very moment he’d give anything to be ungagged and have a bottle of fresh water. \r\n\r\nBreathing heavily, he doesn’t even have it in him to fight the inspection of his body, staring at the blurry faces of his kidnappers with half lidded eyes as the leader runs a thumb over his lip. \r\n\r\nHe flinches expectantly at the touch to his cheek and the ruffle of his hair. After enduring hours of constant shocks from the collar, Tenya can only imagine what else has to be in store for him. The only real question is when it happens."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50943444, "type": "ic", "edited": "2018-07-13T06:07:45.301129", "format": "raw", "posted": "2018-07-13T06:07:45.301129", "text": "\"You know,\" the man in front of Tenya says as he takes off his cuffs. \"You sure look handsome all worn-out like that.\"\r\n\r\nThree others help their partner keep an iron grip on Tenya as the remaining member grabs for rope and scissors. They carefully snip off his clothes, revealing every inch of his body as the others gawk and stare. Once all of it is cut away, the rope is tied tightly around his body, leaving him helpless as the five grope and kiss him.\r\n\r\nSpecial attention is paid to his chest, the stalker's affinity for it obvious as they slap at it and pinch his nipples."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50943557, "type": "ic", "edited": "2018-07-13T06:14:18.109764", "format": "raw", "posted": "2018-07-13T06:14:18.109764", "text": "Tenya can’t help the flood of relief that courses through him when he’s freed from the treadmill. It means that at least for now he doesn’t have to worry about running for hours on end. He’s entirely too exhausted to put up much of a fight as he’s stripped down to nothing and surrounded by the five men.\r\n\r\nThe rope binding him digs into his skin and Tenya groans through the gag at the sudden treatment suddenly being paid to him. Five sets of lips on him at various points in time, hands exploring his body. \r\n\r\nIt almost lulls Tenya further into his daze until his nipples are pinched and his chest is slapped, bringing out moans of pain."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50959624, "type": "ic", "edited": "2018-07-14T04:54:19.580415", "format": "raw", "posted": "2018-07-14T04:54:19.580415", "text": "The stalkers' molestations continue, their touches getting rougher as they drift to more sensitive places. One of them grabs onto Tenya's cock, bending down to give it a kiss before popping it into his mouth.\r\n\r\nThe others give Tenya's chest and neck special attention, leaving kisses and licks along his skin. The pinches to his nipples are getting harsher, the captors also going out of their way to lightly bite at the buds."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50963106, "type": "ic", "edited": "2018-07-14T08:57:34.655708", "format": "raw", "posted": "2018-07-14T08:57:34.655708", "text": "Tenya strains against the ropes binding him, flush with exhaustion and embarrassment alike as he’s lavished with attention. He tries reaching out in an attempt to push away the man on his cock but can only manage to brush the man’s hair with his fingertips. \r\n\r\nHe’d have a better chance if it were only one other man rather than five. His knees almost buckle under the gentler touches, gritting his teeth into the ball gag to stop a whine from escaping his throat. And when it inevitably does, it’s when they begin to nip at his buds with their teeth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 51061854, "type": "ic", "edited": "2018-07-19T07:46:15.026845", "format": "raw", "posted": "2018-07-19T07:46:15.026845", "text": "Desperate hands grope at his body in a haze of lust spurred on by Tenya's whining. It's clear that the men are enjoying what little Tenya can do to stop them as they continue their molestation, nails digging into his skin as they continue to suck and tease his nipples.\r\n\r\n\"Sensitive, aren't we?\" One of the stalkers chuckles. \"How cute... I want to hear more of those beautiful moans.\"\r\n\r\nMeanwhile, the man sucking Tenya's dick bobs his head up and down as fast as he can. He wants to see him cum more than anything now that he's in their clutches. Deepthroating Tenya's cock was a dream for him, but to experience it firsthand was another thing altogether. Groaning around his length, the stalker patiently awaits more lewd noises from the group's plaything."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51398804, "type": "ic", "edited": "2018-08-07T04:04:06.845874", "format": "raw", "posted": "2018-08-07T04:04:06.845874", "text": "Tenya’s hips twitch briefly at the ministrations being paid to every inch of his body. It’s worse than if he’d been snatched up and beaten within an inch of his life. At least then he would know what he could expect - but this was something new entirely. Villains didn’t kidnap heroes and subject to this kind of treatment, not even heroes in training. They had to be civilians. \r\n\r\nBut even that realization doesn’t help Tenya make any more sense of his current predicament. He’s a young man, not a machine. If he were able to think clearly and reach a plausible solution with so many hands groping and pinching and teasing while a warm mouth was on his cock, he’d be almost inhuman.\r\n\r\nHe’d never even thought of himself as someone with very many sexual desires, too focused on his studies, but he’d be loathe to admit that his cock was responding to all the touches, sharp and gentle alike. \r\n\r\nIt doesn’t take much longer than two or three minutes before Tenya feels himself cumming."}]