[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50850687, "type": "ic", "edited": "2018-07-08T04:52:07.967608", "format": "raw", "posted": "2018-07-08T04:52:07.967608", "text": "Something still has to be in his system. He completely believes what Thomas is saying to him, there’s a look in his eyes that says that the American isn’t playing around. It’s more of the fact that he isn’t panicking more than he is, that he doesn’t struggle even when the car is parked and the larger man picks him up. There are people milling about the area and he can’t bring himself to do anything.\r\n\r\nNot out of embarrassment. He just feels...disconnected from his own body in a way. Heavy.\r\n\r\nTotty leans his head against Thomas’ chest, glancing up at him through the veil and regarding him idly. All he can really manage to do properly in this state is spectate."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50851081, "type": "ic", "edited": "2018-07-08T05:09:13.571023", "format": "raw", "posted": "2018-07-08T05:09:13.571023", "text": "Thomas moves the veil aside, leaning down to give Totty a kiss to his cheek.\r\n\r\n\"Good boy,\" he whispers as he moves it back in place. \"This will be over before you know it.\"\r\n\r\nHe nudges the door open, walking down the aisle with Totty still in his arms. The priest gives them a smile as they finally reach the podium, having been hired by Thomas to oversee the wedding.\r\n\r\n\"I'll make this quick for the two of you,\" he says, gazing over to Thomas. \"Do you take this fair lady to be your lawfully wedded wife?\"\r\n\r\n\"I do,\" Thomas replies, holding Totty close.\r\n\r\n\"And do you,\" the priest faces Totty, \"take Thomas Brown to be your husband?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50851238, "type": "ic", "edited": "2018-07-08T05:15:46.640120", "format": "raw", "posted": "2018-07-08T05:15:46.640120", "text": "Thing is, Totty doesn’t want to be a good boy. He wants to go home. He just can’t find the energy to actually move into action - even if he wouldn’t be impeded by the skillfully tied ropes underneath the wedding dress.\r\n\r\n“Mmhn!” He moans, trying and failing to articulate that he’s been kidnapped as he’s addressed by the preacher."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50851492, "type": "ic", "edited": "2018-07-08T05:29:35.973757", "format": "raw", "posted": "2018-07-08T05:29:35.973757", "text": "The preacher registers Totty's moan as an affirmation, not able to see the gag through the veil.\r\n\r\n\"You may now kiss the bride,\" he says, Thomas leaning in to give Totty a kiss to the cheek. The preacher still hasn't caught on that something is up as Thomas kisses Totty on his cheeks and neck.\r\n\r\nThey exchange a few words before Thomas leaves, his new \"wife\" still in his arms as he exits the building and shoves him into the passenger's seat.\r\n\r\n\"I can't wait for you to see our home, dear,\" he says, giving Totty a pat on the cheek before pressing on the accelerator. \"I've got a farm, and lots of toys for you to play with... you'll get used to your new life before long.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50851578, "type": "ic", "edited": "2018-07-08T05:33:21.193411", "format": "raw", "posted": "2018-07-08T05:33:21.193411", "text": "Tears hidden by the veil begin to form in Totty’s eyes as Thomas begins to kiss him - solidying their “marriage”. He has no way to communicate what’s actually happening when he’s drugged and gagged, carried and placed into the car like some kind of doll.\r\n\r\nHis gaze slides over to Thomas as they begin driving again, watching him listlessly as he talks about their new life together."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50851729, "type": "ic", "edited": "2018-07-08T05:41:55.279063", "format": "raw", "posted": "2018-07-08T05:41:55.279063", "text": "Thomas reaches his house around ten minutes later, picking up and carrying Totty over to their house to give him a special tour.\r\n\r\n\"Since you're my wife, it makes sense for you to do the chores, doesn't it?\" He laughs, showing off a frilly maid dress. \"I think this dress will suit you nice. You'll wear it whenever you're cleaning the place.\"\r\n\r\nThomas carries Totty over to his room, showing him the big, fluffy bed.\r\n\r\n\"This is my bed. If you're a good boy, I'll let you sleep in it with me. Otherwise, you'll sleep elsewhere.\"\r\n\r\nThomas lies Totty down on the bed, slowly and delicately taking off his dress.\r\n\r\n\"Since we just got married, we should probably celebrate... and I know just the thing.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50851853, "type": "ic", "edited": "2018-07-08T05:48:56.611087", "format": "raw", "posted": "2018-07-08T05:48:56.611087", "text": "Once again Totty finds himself leaning heavily against Thomas, taking in the house through half-lidded eyes and whining when he’s shown the frilly outfit. Through the entire tour it’s only piece of clothing that looks to be in his size aside from the wedding dress - something that doesn’t instill confidence in the young man.\r\n\r\nHe wrinkles his nose as the veil is removed, drooling around the white ball gag. Once the dress is off he’s able to see his limp cock and that the ropes binding him are also a pure white."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50852435, "type": "ic", "edited": "2018-07-08T06:22:51.466853", "format": "raw", "posted": "2018-07-08T06:22:51.466853", "text": "Thomas hums as his fingers wrap around Totty's limp cock, taking a moment to stroke it as he starts to tell him what he has planned for him.\r\n\r\n\"I'll have to show off a pretty little thing like you off to some folks at some point,\" he muses. \"But don't worry, I won't let them touch you. You're my property after all.\"\r\n\r\nHis mouth leans down to give Totty's cock a kiss, soon taking it into his mouth and sucking on it. Thomas moans around it, his calloused fingers running along the base."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50852505, "type": "ic", "edited": "2018-07-08T06:27:16.984896", "format": "raw", "posted": "2018-07-08T06:27:16.984896", "text": "Totty shakes like a leaf on the bed, very much a virgin in more ways than one. Even Thomas’ mouth on his cock feels like too much. But again the drugs have made him pliant as he’s stroked into becoming hard."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50860094, "type": "ic", "edited": "2018-07-08T21:08:23.953242", "format": "raw", "posted": "2018-07-08T21:08:23.953242", "text": "Thomas continues his ministrations for a moment, but soon pulls away, saliva connecting his mouth to the head of Totty's cock.\r\n\r\n\"Aw, are you scared?\" He asks, smirking. \"Wait, don't tell me you're a virgin? Must be my lucky day!\"\r\n\r\nThomas positions himself above Totty, leaning into his neck to lick and bite at the skin. He then leans into his ear, giving the lobe a sensual lick before speaking.\r\n\r\n\"We need to make tonight special... after all, you're losing your virginity tonight.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50860775, "type": "ic", "edited": "2018-07-08T21:43:29.674615", "format": "raw", "posted": "2018-07-08T21:43:24.673933", "text": "Totty dribbles saliva around the ball gag, twisting feebly before he’s caged in by Thomas. Already tears are beginning to stain his cheeks but there’s still nothing that he can do in his confinement.\r\n\r\nHe looks pitifully up at Thomas as he whines, trying to earn himself some mercy as he continues to whine."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50860901, "type": "ic", "edited": "2018-07-08T21:50:37.416592", "format": "raw", "posted": "2018-07-08T21:50:37.416592", "text": "Thomas gives him another kiss to the neck, ignoring his muffled whines for mercy. The tears only edge him further on, kissing them away as he tries to ease him.\r\n\r\n\"Don't cry, dear,\" he coos, giving his nipple a quick pinch. \"You're going to enjoy your new life as my plaything after a while. And even if you don't, well, wouldn't that be a shame?\"\r\n\r\nThomas grabs for a bottle of lube in his drawer, slipping off his pants and allowing his erect cock to hang free. Lathering his cock in the lubricant, he flips Totty over, giving his ass a smack before slowly inching his way inside."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50860958, "type": "ic", "edited": "2018-07-08T21:55:03.812777", "format": "raw", "posted": "2018-07-08T21:55:03.812777", "text": "Totty watches in horror as Thomas coats his own cock with lube, the muffled pleas rising in volume until he’s flipped over on the bed, ass in the air. He knows that he isn’t going to enjoy being the man’s plaything, Thomas doesn’t even seem to care. Which should have been more obvious since he’d been kidnapped."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887386, "type": "ic", "edited": "2018-07-10T04:27:16.269772", "format": "raw", "posted": "2018-07-10T04:27:16.269772", "text": "Thomas loses himself as he thrusts into Totty's ass, spurred on even further from his muffled protests. The man is enjoying what little Totty can do to resist his abuse, a twisted sense of pride and lust overtaking him. He was all his, and Thomas would make sure he'd stay that way for a long time.\r\n\r\n\"After this, I can give you a tour of the barn,\" he grunts, giving Totty's ass a quick smack. \"I can even show you how some of the machines work.\"\r\n\r\nThomas's breath hitches as he feels himself getting closer to release, and it isn't long before he's cumming in Totty's ass. He pulls out, cum leaking from his hole and dripping down his thighs.\r\n\r\n\"Congratulations, my beautiful wife,\" he says, coming down from his orgasm. \"You're no longer a virgin.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50887559, "type": "ic", "edited": "2018-07-10T04:34:05.459965", "format": "raw", "posted": "2018-07-10T04:34:05.459965", "text": "Totty’s breathing around the ball gag and cloth shoved into his mouth turns ragged as he starts to panic. Moving and twisting as he has so far has only served to impale him further on Thomas’ cock. Exactly where he doesn’t want to be.\r\n\r\nThe tears come easily when Thomas finishes with him, cum leaking from his ass and dripping down his thighs.\r\n\r\nHe can’t imagine anything worse than this very moment but at the same time he doesn’t know what’s waiting for him in the barn."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52248302, "type": "ic", "edited": "2018-09-26T04:57:50.319533", "format": "raw", "posted": "2018-09-26T04:57:50.319533", "text": "Thomas doesn't have a care in the world as he kisses Todomatsu's tears away. His hand reaches up to gently stroke his cheek, wiping away more tears.\r\n\r\n\"Was that scary for you, Todomatsu?\" He asks in a soft voice. \"Don't worry, we'll be sharing more moments like that together, so you'll get used to it soon.\"\r\n\r\nLifting Totty up like a bride, Thomas carries him outside and into his barn, where several machines are waiting for them. Stationed near a machine is an armbinder and a pair of elevated boots resembling horse hooves.\r\n\r\n\"Let me just cut off some of this rope, then I can show you how the milker works,\" Thomas says as he cuts away the white rope with a pair of scissors."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52250107, "type": "ic", "edited": "2018-09-26T09:01:44.595112", "format": "raw", "posted": "2018-09-26T09:01:44.595112", "text": "Totty flinches. He can’t help himself. The gentleness is completely at odds with what he knows Thomas is capable of now. It isn’t fair that he can be reminded that he first thought the American was a nice guy. Handsome and well mannered. Not someone who would plan out kidnapping another person to use them like an object. Like something to be owned. It makes Totty cry harder. \r\n\r\nBecause if he’ll “get used to” Thomas using him it means the other man has thought about all of this in the long term. \r\n\r\nThe outside air is cold to his skin, doing absolutely nothing for his limp cock. And he can’t help but feel somewhat grateful for the rush of warmer air that emanates from the barn once they reach their destination. The feeling fades when the new devices catch his attention. They’re so obviously meant to be used on a human that Totty would have to be practically delusional to hope that they wouldn’t be used on him.\r\n\r\nBecause life isn’t fair.\r\n\r\nHe’s almost given up hope completely - a trait shared amongst his brothers to take the path of least resistance, but he can’t bring himself to do that when Thomas cuts the ropes. He has to try and run. So he does."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52263601, "type": "ic", "edited": "2018-09-27T03:27:52.799469", "format": "raw", "posted": "2018-09-27T03:27:52.799469", "text": "Thomas is spurred into action when Totty makes a run for it. He's a lot faster than he looks, reaching Totty within seconds of his escape attempt. His fingers dig into his arm, nails reddening the flesh below.\r\n\r\n\"It still hasn't set in, has it?\" Thomas sneers as he jerks Totty closer to him. \"You belong to /me/. There's nowhere left for you to go. Your only purpose now is to be used as my personal doll.\"\r\n\r\nHe yanks the helpless NEET towards the milker, strapping him in a vulnerable position where his arms and legs are spread wide open. Eyeing the tube, Thomas reaches for it and adjusts it around Totty's cock.\r\n\r\n\"Since you tried to escape, I'm going to hook you up to this thing for a few hours longer,\" he says with a smile before pressing a few buttons off to the side. \"Good little playthings don't run away from their masters, you know.\"\r\n\r\nThe machine begins to suck and squeeze around Totty's cock, stimulating it while Thomas watches."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52263722, "type": "ic", "edited": "2018-09-27T03:33:38.782613", "format": "raw", "posted": "2018-09-27T03:33:38.782613", "text": "Totty strains uselessly, his slighter frame no match for Thomas’ strength. If it weren’t bad enough, he’s more of a help than a hindrance as he’s being properly restrained in order to be used by the milker.\r\n\r\nIt’s a vulnerable and precarious position that leaves his cock wide open to be placed inside the device.\r\n\r\nThe NEET moans pitifully the second the machine starts up, body jerking in small fits as it pumps his cock."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54995512, "type": "ic", "edited": "2019-03-04T05:22:16.381213", "format": "raw", "posted": "2019-03-04T05:22:16.381213", "text": "Thomas isn't joking when he says he plans to leave Totty like this for a longer period time as punishment. With a kiss to the cheek and a pinch to the nipple, he leaves him alone to suffer, locking the barn door behind him and leaving him in darkness.\r\n\r\nThe machine is vicious as it jerks Totty off, pumping and sucking at his member. A large glass container is off to the side of the machine, and it wouldn't take a detective to figure out its purpose of storing cum. A bottle and funnel are also stationed nearby, obviously meant to act as force-feeders if the victim was uncooperative in drinking it."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54997973, "type": "ic", "edited": "2019-03-04T08:11:05.600657", "format": "raw", "posted": "2019-03-04T08:11:05.600657", "text": "Totty squeals as the milker begins to continuously pull orgasms out of him, the storage container filling up with his cum over the course of several hours. It’s an exhausting process that takes most of the fight out of him by the time that the container’s full. \r\n\r\nHe hangs limp in his bindings with his eyes half lidded, drooling around the ball gag and watching the barn doors almost hopefully. The passing hours feel like an eternity and Totty can’t even begin to think straight after the first few times that he cums."}]