[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47013203, "type": "ic", "edited": "2017-12-15T07:39:01.977324", "format": null, "posted": "2017-12-15T07:39:01.977324", "text": "Oso’s reaction is near instantaneous. He begins to gag on Boss’ cock as he’s forced up and down into throat fucking the man. His throat pulses with every thrust and he’s practically gasping for air by the time that Boss cums on his face and sends him stumbling to the floor where he lays in a panting and drooling mess.\r\n\r\nThe rest of the Matsus whimper in fear, Choro shaking his head vehemently as he desperately wants to avoid the same fate as his older brother. \r\n\r\nNot that he expects to be listened to given the fact that they’ve already been kidnapped."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47025826, "type": "ic", "edited": "2017-12-16T03:25:22.436673", "format": null, "posted": "2017-12-16T03:25:22.436673", "text": "Boss smirks as a guard comes forward and frees his cock, grabbing onto the back of Choro's head and forcing it down on his erection despite him shaking his head no.\r\n\r\n\"Take all of it, Choro-kun,\" he says as the guard fucks his throat, not letting up for a second before eventually cumming minutes later. Most of it goes down his throat, but the guard allows some of it to spray on his face when he pulls away.\r\n\r\nThe guard tosses him on the floor next to Oso, awaiting further instructions from Boss.\r\n\r\n\"Now,\" he looks to the other brothers as his guards surround them. \"Who's next?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47025940, "type": "ic", "edited": "2017-12-16T03:30:39.383597", "format": null, "posted": "2017-12-16T03:30:39.383597", "text": "Tears run down Choro’s cheeks as he’s left gagging on the guard’s cock in practically the same manner that he just saw Oso being treated. Faces covered in cum, ye two brothers move closer to one another in an attempt to find some assurance that everything would work out.\r\n\r\nAs for the other Matsus, they begin to squirm and wiggle their way closer to one another as well - shaking with fear and still letting out muffled protests that immediately fall on deaf ears as they’re surrounded."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47026155, "type": "ic", "edited": "2017-12-16T03:42:17.116530", "format": null, "posted": "2017-12-16T03:42:17.116530", "text": "A proud smirk comes across Boss's face as the remaining sextuplets are left to cower and squirm, the guards using several pairs of scissors to cut away at their clothes until their skin is completely barred, limp cocks and bare chests exposed. Osomatsu's boxers are also snipped off, leaving each brother naked and vulnerable.\r\n\r\n\"How about Ichi-kun?\" Boss suggests, the guards yanking him out of the pile and shoving him towards Boss. His tape gag is soon ripped off, the guards aiming to use a ring gag on him as his nose is held, preventing him from breathing as the gag hovers in front of his face."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47026548, "type": "ic", "edited": "2017-12-16T03:58:39.488411", "format": null, "posted": "2017-12-16T03:58:39.488411", "text": "Ichi whimpers fearfully once his name is called out, unable to hold his breath for long until his very own ring gag is shoved in and he’s drooling down his chest. Rather than writhing about he uses his legs to push himself away from the guards in order to not meet the same fate as his brothers."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47026801, "type": "ic", "edited": "2017-12-16T04:09:21.471505", "format": null, "posted": "2017-12-16T04:09:21.471505", "text": "A guard behind Ichi grabs onto him before he can get very far, squatting down to meet him face-to-face and blindfolding him with a cloth. Examining the bound toy, the guard shoves his tongue into his mouth and roughly kisses him, more guards tugging at his nipples and jerking him off.\r\n\r\n\"If you're going to be so defiant, I have no choice but to punish you.\" Boss nods to his guards as they bring nipple clamps forward, attaching them to his buds before yanking at them.\r\n\r\n\"How do you feel, kitten?\" Boss asks in a mocking tone."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47026938, "type": "ic", "edited": "2017-12-16T04:16:01.536904", "format": null, "posted": "2017-12-16T04:16:01.536904", "text": "If Ichi thought the gag was bad, the effect is ten times worse when he’s blinded by a simple piece of cloth tied around his face. He’s unable to tell when the guards are close to him until they’re actually touching him - kissing and playing with his nipples and cock until both are almost painfully hard.\r\n\r\nA situation that’s made even more difficult to handle when the clamps are applied and pulled on immediately after.\r\n\r\n“Ah!” He screams loudly, trying to curl into himself protectively."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47027202, "type": "ic", "edited": "2017-12-16T04:30:14.262883", "format": null, "posted": "2017-12-16T04:30:14.262883", "text": "The guards keep molesting Ichi, poking at his body as the clamps are yanked on and his cock is stroked faster. The guard kissing him pulls away, saliva connecting their mouths and dripping down Ichi's chin.\r\n\r\n\"Does my slutty little kitten want a cock down his throat?\" He asks, one guard shoving his cock inside his wide-open mouth as if on command. \"How deep can you take it, kitten? We have lots more to do as a part of your punishment...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47027307, "type": "ic", "edited": "2017-12-16T04:36:00.738709", "format": null, "posted": "2017-12-16T04:36:00.738709", "text": "Despite not liking to see their brother being used like a plaything, there’s some relief that the attention isn’t being focused on them as they learn exactly what gaining a punishment means - instilling a strong desire to avoid getting their own as their captivity continued.\r\n\r\nIchi is left a mess, choking on cock and beginning to sob silently as his poor nipples are tortured by the clamps. And despite the mistreatment it doesn’t take long before he’s spilling his seed onto his abdomen - creating a strange mixture of pleasure and pain."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47027605, "type": "ic", "edited": "2017-12-16T04:52:10.790643", "format": null, "posted": "2017-12-16T04:52:10.790643", "text": "\"You came from that?! You seriously came from that?\" Boss laughs as the orgasm subsides, the guard thrusting down his throat continuing his assault before cumming as well, spilling it all down his throat.\r\n\r\nAs he pulls out, the guards quit torturing Ichi's nipples, focusing on Boss rummaging through his desk drawers and pulling out a latex bitchsuit. As soon as it's in front of Ichimatsu, Boss removes the blindfold and clamps, urging him towards it as the tape around his limbs are cut off.\r\n\r\n\"Get in the suit, or you're not going to like what happens next.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47027753, "type": "ic", "edited": "2017-12-16T05:01:16.616526", "format": null, "posted": "2017-12-16T05:01:16.616526", "text": "Ichi grimaces as he’s forced to follow the load of cum, blinking as his eyes readjust to the light once the blindfold is removed.\r\n\r\nFor the briefest of moments it looks like Ichi has been cowed into submission, shaking in place as he looks at the bitchsuit.\r\n\r\nThen the tape is cut off and Ichi scrambles to his feet, glancing around wildly before making a dash for the room’s only exit."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47036043, "type": "ic", "edited": "2017-12-16T20:18:16.035341", "format": null, "posted": "2017-12-16T20:18:16.035341", "text": "Ichimatsu's escape attempt is quickly halted, the guards prepared for this sort of outburst as they run towards him, grabbing onto his arms and yanking him back towards the latex suit.\r\n\r\n\"You're going to regret that, Ichi-kun,\" Boss spits out as the NEET is blindfolded once more, his body forced inside the suit by the guards. The mask is slid over his face, his body completely covered except for his nipples, cock, and ass. Two small holes also adorn the mask, allowing him to breathe.\r\n\r\nBoss attaches nipple clamps to his buds once more, this time a different pair with weights on the end as his nipples are tugged towards the floor.\r\n\r\n\"Try to escape now, kitten,\" Boss taunts."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47036173, "type": "ic", "edited": "2017-12-16T20:27:32.985225", "format": null, "posted": "2017-12-16T20:27:32.985225", "text": "Ichi jerks wildly in their grasp, screaming through the gag the entire time he’s forced into the suit - the sound eventually muffled by the mask. It’s an entirely different experience in the suit, slobbering inside of the mask and able to feel the blindfold pressed against his skin. Blinded even if he wasn’t wearing the mask. \r\n\r\nThe attachment of the weighted clamps brings another round of muffled screaming before petering off into pained whines. \r\n\r\nEscape is impossible in this state, blinded and every inch he manages to moved forward on his elbows and knees causes the weights to moves and tug his buds closer to the ground - only lasting a moment before he comes to the conclusion that staying as still as possible is his best option."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47036270, "type": "ic", "edited": "2017-12-16T20:36:48.346624", "format": null, "posted": "2017-12-16T20:36:48.346624", "text": "Boss plays with the clamps to further torture Ichi, reveling in his wails and screams of pain. The punishment isn't over yet, one guard pulling lubricant out of Boss's drawer and applying it to his own cock.\r\n\r\nPutting his cold, wet finger into Ichimatsu's hole, the guard soon replaces it with his cock, thrusting wildly as he spanks him.\r\n\r\n\"Do any of you boys want to be next? I have five other suits just for you...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47036383, "type": "ic", "edited": "2017-12-16T20:44:30.888605", "format": null, "posted": "2017-12-16T20:44:30.888605", "text": "The boys watch the spectacle in various stages of horror - not quite knowing what to do as they watched Ichi be tortured and fucked mercilessly by Boss and the guard. \r\n\r\nBut...they could be spared a punishment if they readily agreed rather than try to escape.\r\n\r\nJyushi is the first to indicate his answer, squirming forward and grunting through his own gag. Kara and Todo are the next to follow their brother."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 47036571, "type": "ic", "edited": "2017-12-16T21:06:35.724898", "format": null, "posted": "2017-12-16T20:55:55.774033", "text": "\"Such good pets...\" Boss sighs, stopping Ichimatsu's nipple clamp torture as the guard keeps thrusting inside him.\r\n\r\nHe pulls out three other suits, along with six collars, each tag a humiliating name: \"Fuck Toy\", \"Cock Slut\", \"Cumdump\", \"Kitty Slut\", \"Puppy Slut\", and \"Bitch Slave\".\r\n\r\nThe tape is cut off of Jyushi first, the guards ring gagging him and placing him inside the suit before applying the mask, followed by the Puppy Slut collar around his neck.\r\n\r\nThe other two are then given the same treatment, Kara receiving the Cock Slut collar, while Totty receives the Bitch Slave one.\r\n\r\n\"Choro-kun and Oso-kun are next,\" Boss says as he pulls out two more, the guards cutting off their restraints and beginning to fasten them inside the suit."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47036688, "type": "ooc", "edited": "2017-12-16T21:02:57.160921", "format": null, "posted": "2017-12-16T21:02:57.160921", "text": "Hey sorry I can’t find it in the chat so I might be skimming over it but are Jyushi, Kara, and Totty ring gagged?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47036742, "type": "ooc", "edited": "2017-12-16T21:07:05.068450", "format": null, "posted": "2017-12-16T21:06:03.286666", "text": "(( I changed the response so they are now. I want it to be consistent"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47036934, "type": "ic", "edited": "2017-12-16T21:17:39.057593", "format": null, "posted": "2017-12-16T21:17:39.057593", "text": "Jyushi keeps his head down throughout the process, trying his best not to do anything that would warrant a punishment. Though the names on the collars don’t escape his notice before he’s masked like Ichi - even if he’s unable to tell which one is cinched around his own neck, creating a seamless transition between the mask and suit.\r\n\r\nIchi lists forward, resting most of his weight on his elbows as his fucking continues, unaware of his brothers being put into similar suits.\r\n\r\nThe remaining four Matsus are more than compliant in their own dressings, with Kara and Totty even lifting their heads to allow the collars to be put on. \r\n\r\nWith every Matsu properly placed inside the latex, they begin to experience the same blindness and muffled sounds filtering in from the outside - isolated and drooling through the ring gags."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47042435, "type": "ic", "edited": "2017-12-17T03:00:29.348092", "format": null, "posted": "2017-12-17T03:00:29.348092", "text": "Boss looks over the heavily bound sextuplets as they're all lined up in a row, paying special attention to Ichi as his punishment fuck continues. The guard cums after a few minutes, giving Ichi a smack to the ass after leaving his hole.\r\n\r\nBoss takes off Ichi's mask for a moment and removes the blindfold, curious to see the look in his eyes after getting fucked so roughly.\r\n\r\n\"Take a look, Ichi-kun,\" he says as he gestures to the others bound tight in the latex. \"They're all in the same boat as you.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47046373, "type": "ic", "edited": "2017-12-17T06:16:27.737934", "format": null, "posted": "2017-12-17T06:16:27.737934", "text": "Ichi is practically shaking by the end of his fucking, jolting at the smack to his ass. His eyes are narrowed with irritation when the mask is removed though there’s a certain sort of glazed over look to it that gives away the fact that’s he’s spent. \r\n\r\nHe glances tiredly at his brothers, taking note of the collars around their necks in order from youngest to oldest.\r\n\r\nCumdump, Cock Slut, Fuck Toy, Puppy Slut, and Bitch Slave.\r\n\r\n“Ahhn...” he moans sadly, looking down to read the upside down engraving that’s sure to be found on his own collar but doesn’t even find a collar around his neck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47054512, "type": "ic", "edited": "2017-12-17T20:44:47.293567", "format": null, "posted": "2017-12-17T20:44:47.293567", "text": "\"You want a collar of your own, huh? Don't worry, Ichi-kun. I've got one just for you.\"\r\n\r\nBoss fixes the Kitty Slut collar around Ichi's neck, firmly tightening it. Afterwards, he returns to playing with his sore nipples, the clamps still attached to his poor buds.\r\n\r\n\"Since it's almost Christmas, I'm going to be throwing a party for some guests. And you and your brothers are going to be the main attractions...\"\r\n\r\nHe gives Ichi a kiss to his drool-wet bottom lip, giving his clamps one last sharp tug before standing up.\r\n\r\nBoss walks back to his desk, pulling out six pairs of reindeer antlers. He places them on each of the sextuplets, saving Ichi for last.\r\n\r\n\"On goes the mask again, Kitty Slut,\" he says before placing it back on, followed by the antlers."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47057047, "type": "ic", "edited": "2017-12-17T22:47:00.537621", "format": null, "posted": "2017-12-17T22:47:00.537621", "text": "Ichi practically mewls as the collar is put in place, a sad expression in his eyes as his nipples continue to be the focus of the man’s attention. By this point they’re sore and hard from being held down by the swinging weights. \r\n\r\nHe watches as his squirming brothers are adorned with the antlers. It’s nerve wracking to think that he’s the only one to know about the party, having first hand experience that the mask muffled most of the outside world. \r\n\r\nThough at least he isn’t blindfolded when the mask goes back on this time - soon accompanied by the weight of the antlers."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47064609, "type": "ic", "edited": "2017-12-18T04:15:58.180814", "format": null, "posted": "2017-12-18T04:15:51.006643", "text": "After adjusting the antlers over each brother's head, Boss allows his guards to step forward, handing them leashes to attach to the collars around each Matsu's neck. He then tells them to lead each of them to their cages, the guards obeying as they tug them towards another room.\r\n\r\nThree large cages are lined up in the next room over, each one large enough to hold two of the sextuplets. The guards tug the leashes over to the open doors, not planning to release them for the rest of the night.\r\n\r\nA lot of things need to be prepared, after all."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47069456, "type": "ic", "edited": "2017-12-18T10:29:12.740066", "format": null, "posted": "2017-12-18T10:29:12.740066", "text": "Each brother makes the relocation with some difficulty as they adjust to crawling along on their elbows and knees - managing to wriggle forward a few centimeters with every twist of their rubbery forms. With the weight of the antlers coupled with overall exhaustion with the day’s events, each Matsus’ head is bowed towards the ground in what could possibly be seen as a sign of subservience.\r\n\r\nEven Ichi who’s shown the most rebellious streak so far seems to be too tired to hold his head up properly, choosing instead to shuffle along with his brothers until their split into pairs and locked inside the heavy duty dog cages.\r\n\r\nKara and Totty, Oso and Jyushi, and Choro and Ichi all remain silent as the grave as they settle down - unable to muster the entertainment to do anything but curl up into one another for blind comfort. \r\n\r\nChoro is careful to remain still once he enters the cage, not wanting to jostle the clamps that he knows are there once he’s able to deduce who his cell mate is."}]