[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47071788, "type": "ic", "edited": "2017-12-18T16:42:23.021200", "format": null, "posted": "2017-12-18T16:42:23.021200", "text": "After placing the Matsus inside their cages, the guards leave them alone for the rest of the night. With the party coming up tomorrow, decorations need to be set up, along with some of the events featuring the new captives.\r\n\r\nThe whole night is spent setting everything up, from the vibrating stand for the \"tree\" to be placed on, to the sleigh sitting outside the mansion.\r\n\r\nWhen morning comes, the three cages are rattled in an effort to wake the boys up, their bodies still bound tight in the latex, the antlers still weighing on their masked heads."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47085296, "type": "ic", "edited": "2017-12-19T04:25:42.279815", "format": null, "posted": "2017-12-19T04:25:42.279815", "text": "It isn’t hard to sleep after the ordeal they’ve had - though none of the brothers are capable of reaching a truly deep sleep. The rattling of the cages startles them all into consciousness, heads jerking up and in some cases entangling the tines of the antlers on their heads."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47085581, "type": "ic", "edited": "2017-12-19T04:38:11.319101", "format": null, "posted": "2017-12-19T04:37:11.981504", "text": "Boss and his guards unlock the cages after the boys are startled awake, tugging on the collars in an effort to get them out of their confined spaces. The six are tugged towards Boss's office, their masks removed by the guards as the man in charge stares them down.\r\n\r\n\"Good morning,\" he greets them, ruffling Ichi's hair before suddenly removing the clamps. \"Notice anything different about the office, boys? I decorated it to look festive, just for tonight.\"\r\n\r\nHe removes the ring gag from Ichi, ruffling his hair once more.\r\n\r\n\"I presume you aren't going to keep up that rebellious attitude, Ichi-kun?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47088623, "type": "ic", "edited": "2017-12-19T08:19:04.839094", "format": null, "posted": "2017-12-19T08:19:04.839094", "text": "The Matsus shuffle after the guards as fast as they can manage - weights swaying and pulling at Ichi’s nipples the entire time and bringing out groans of pain. There are more groans as the masks are removed and the sextuplets are faced with light for the first time in hours. \r\n\r\nIchi whimpers pathetically as the blood rushes back to his poor nipples, leaving them sore and aching as he practically slumps onto the floor and gazes up at Boss. After a few moments he shakes his head.\r\n\r\n“No, Sir.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47090572, "type": "ic", "edited": "2017-12-19T14:19:47.343100", "format": null, "posted": "2017-12-19T14:19:47.343100", "text": "Boss responds by patting Ichi on the cheek, giving him an oddly gentle kiss on the forehead.\r\n\r\n\"Such a good little kitty slut,\" he whispers before giving him another kiss, this time on the lips.\r\n\r\nStanding up, Boss looks towards the remaining sextuplets.\r\n\r\n\"My six little reindeer are going to be very busy tonight...\" he explains, a smirk lifting on his face. \"Be prepared to pleasure not just me, but several guests for the party I have planned.\"\r\n\r\nAs Boss finishes his explanation, the guards start to get hands-y with the boys, stroking their cocks and playing with their asses."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47142317, "type": "ooc", "edited": "2017-12-22T05:23:47.133409", "format": null, "posted": "2017-12-22T05:23:47.133409", "text": "(( I hope you're doing well, friend"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47177962, "type": "ooc", "edited": "2017-12-24T07:02:51.443489", "format": null, "posted": "2017-12-24T07:01:01.535837", "text": "(( can we still do the christmas theme if when you reply it's past christmas?\r\n\r\nOn another note, Merry Christmas Eve! I hope you're doing alright and I'd love to continue this RP! It's so rare for me to find someone whose kinks match up so perfectly. I'll be waiting here on all of our RPs if/when you come back."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47317835, "type": "ooc", "edited": "2017-12-31T09:52:19.942517", "format": null, "posted": "2017-12-31T09:52:19.942517", "text": "Sorry for the lateness! I ended up with the flu over the holidays and couldn’t really get online. \r\n\r\nWe can definitely stick with the theme"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47317866, "type": "ic", "edited": "2017-12-31T09:55:33.055199", "format": null, "posted": "2017-12-31T09:55:33.055199", "text": "Ichi’s nose wrinkles with disgust at the kiss but he doesn’t make much comment since he doesn’t want to be punished again. \r\n\r\nThe rest of the boys listen with confusion as they’re told about the party. It couldn’t mean anything good for them to be shown off so early after their capture - Boss didn’t seem worried at all all.\r\n\r\nThough the thoughts are fleeting once the guards start to play with them, eliciting moans as saliva pours through their gags."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47321460, "type": "ooc", "edited": "2017-12-31T18:12:43.522638", "format": null, "posted": "2017-12-31T18:12:43.522638", "text": "(( I'm glad you're okay now! I was worried"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47321682, "type": "ic", "edited": "2017-12-31T18:33:57.429796", "format": null, "posted": "2017-12-31T18:33:57.429796", "text": "Boss doesn't do anything to stop the guards as they play with the captives, enjoying the humiliating spectacle as drool pours out of their open mouths.\r\n\r\n\"I have roles assigned for the six of you for tonight,\" Boss says as he pulls out a piece of paper from his pocket. The guards stop playing with the boys, listening to their boss as he lists off the roles.\r\n\r\n\"Oso-kun, Ichi-kun, and Jyushi-kun will be the reindeer, giving rides for guests. That means you'll have to stay in your bitchsuits out in the cold.\r\n\r\n\"Kara-kun will be the tree. Guests will attach ornaments all over your body, and there will be a lighting ceremony which will likely be very painful for you.\r\n\r\n\"Choro-kun will be a slutty elf giving guests blowjobs. I have an outfit prepared for you to wear that I'm sure will looking charming.\r\n\r\n\"Finally, Totty will be our snowman. Most of your body will be frozen in an ice sculpture, kept in a position where guests can fuck you.\r\n\r\n\"I also have a special event I've saved for the end, but I want to keep that a secret. My men will keep a close watch on you throughout most of the party. That will be all.\"\r\n\r\nOnce Boss finishes his explanation, the guards in charge of Choro, Kara, and Totty take off their bitchsuits, removing the ring gag from Kara."}]