[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52794427, "type": "ooc", "edited": "2018-10-31T05:55:35.454886", "format": "raw", "posted": "2018-10-31T05:55:35.454886", "text": "happy Halloween!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52794857, "type": "ooc", "edited": "2018-10-31T06:51:36.868809", "format": "raw", "posted": "2018-10-31T06:51:36.868809", "text": "(( happy halloween!!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 52794956, "type": "ooc", "edited": "2018-10-31T07:04:00.582360", "format": "raw", "posted": "2018-10-31T07:04:00.582360", "text": "I think we practically ready to start haunted house if you’d like me to start us off"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 52794997, "type": "ooc", "edited": "2018-10-31T07:10:20.012223", "format": "raw", "posted": "2018-10-31T07:10:16.306448", "text": "(( sure, go right ahead!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 52795112, "type": "ic", "edited": "2018-10-31T07:29:59.554750", "format": "raw", "posted": "2018-10-31T07:29:59.554750", "text": "After nearly a month of anxiously awaiting its arrival, Halloween had finally come to the neighborhood - and by extension the Matsu household. The sextuplets has put the bare minimum into decorating but it was the thought that counted in the minds of the two youngest brothers. Jyushi and Totty were really the reason that any effort at all had been put into celebrating, seeing as they were the only two that wanted to participate in the activities. \r\n\r\nThey could still get away with trick or treating thanks to their youthful appearances and cheerful dispositions. And if they hadn’t put so much work into their costumes since coming up with the ideas, they surely would have been in charge of decorating the house as well. But the two wouldn’t let their brothers’ lack of spirit damper their own since they were already planning on going out for a night of fun.\r\n\r\nThey spend about an hour or so just walking in through their neighborhood in costume. Jyushi, having chosen to be a werewolf, just wearing some older, torn clothes with the addition of a tail and ears. And Totty, whose take on a mermaid was summed up in scales drawn on his bare torso and a long skirt that he’d sewn to look like a tail.\r\n\r\nJust when they’re about to head home they spot a house that they swear they’ve never seen before - and one that looks like a genuine haunted mansion. The two share a curious glance when they spot a sign in the yard advertising a free monster house. \r\n\r\n“I’m interested if you don’t think you’ll get too scared,” Totty teases, already walking up the pathway with Jyushi following at his heels.\r\n\r\n“As if!” His brother responds, pushing open the door to reveal a seemingly empty house."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53447786, "type": "ic", "edited": "2018-12-12T06:50:52.647687", "format": "raw", "posted": "2018-12-12T06:50:52.647687", "text": "Unbeknownst to the two brothers, the haunted mansion in question is genuinely cursed, housing real monsters that had once been curious humans. The moment the brothers step inside seals their fate as permanent residents of the house.\r\n\r\nWith haunted houses being a popular Halloween attraction, it was fairly easy to lure interested people inside and toy with them however the monsters liked. All sorts of creatures lurked here, from mummies to ghosts to snake-like creatures. And all of them wanted to play with the new guests.\r\n\r\nThe door shuts behind the two once they step inside, locking them in complete darkness. For a while, it's completely silent.\r\n\r\nThen a blue light appears in front of them, circling around them to tie them together. The bindings are an ethereal sort, colored blue like the light the circled them.\r\n\r\nCreaking floorboards fill the room, shadowy figures creeping closer and closer to the bound brothers."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53447887, "type": "ic", "edited": "2018-12-12T06:58:59.601801", "format": "raw", "posted": "2018-12-12T06:58:59.601801", "text": "Jyushi is the first to notice the click of the door locking behind them but passes it off as the beginning of their genuine haunted house experience. He had to give it to the home owners, he couldn’t make out what sort of device was used to make the door shut with no one around.\r\n\r\nIt also does its job of scaring Totty, despite his confident words right before entering the house. His first reaction is to cling to his brother’s arm as they make their first steps to venture further into the house.\r\n\r\nThey both yelp in surprise when the blue light appears, sharing an amused laugh when it hovers in front of them. Just a harmless jump scare then. The two hardly have time to react when it starts moving again and they end up tied together face to face. \r\n\r\n“Jyushi!”\r\n\r\n“It wasn’t me!”\r\n\r\nThe short lived squabble grinds to a halt when they notice the approaching shadows, swallowing nervously until Jyushi has the sense to speak up.\r\n\r\n“Uhh...this is a real cool haunted house and all but I think we got a little tangled up in the decorations?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53448134, "type": "ic", "edited": "2018-12-12T07:19:20.297007", "format": "raw", "posted": "2018-12-12T07:19:20.297007", "text": "The sound of wicked laughter surrounds the brothers in response to Jyushi's naive words. Their bonds squeeze them tighter as a lone figure approaches them, the darkness obscuring most of their face.\r\n\r\n\"It's been a long time since we've gotten any visitors.\" By the voice it's clear that the person speaking is male. \"You seem frightened, but that is to be expected.\"\r\n\r\nHe steps close enough to the light for his face to be revealed, his skin as pale as snow and fangs showing through his smile.\r\n\r\n\"These are no mere decorations,\" he explains. \"They are wisps of light, and they can't be broken. You'll be stuck like that for as long as we want you to.\"\r\n\r\nHe reaches out his cold hands to touch Totty and Jyushi's faces as he says his final piece.\r\n\r\n\"You're going to make wonderful additions to our collection of permanent guests.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53448221, "type": "ic", "edited": "2018-12-12T07:26:52.908095", "format": "raw", "posted": "2018-12-12T07:26:52.908095", "text": "The two Matsus grimace as they’re almost painfully squeezed together by the strings of light. Totty more so as his bare chest presses up against the scratchy fabric of Jyushi’s costume. The laughter doesn’t help either and the two share a confused expression until the voice begins to speak.\r\n\r\n“Well I can see why,” complains Totty. “This has to be some kind of safety hazard. I wouldn’t have even wanted to come if I’d known this would happen.”\r\n\r\n“Shut up Totty!” Jyushi hisses as the man reveals himself and begins to explain.\r\n\r\nHe was just a tad quicker to realize what wa sharpening than his brother and he didn’t want Totty’s rudeness to land them in even more trouble. If they stuck this out they’d likely be let go within the hour.\r\n\r\nOr not. They both whimper as the man touches them and speaks of permanent guests. Even worse that he mentions a collection. The inhabitants of the house had likely been doing this for a while without anyone’s notice."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53448296, "type": "ic", "edited": "2018-12-12T07:38:44.282028", "format": "raw", "posted": "2018-12-12T07:38:44.282028", "text": "The vampire smirks as Totty and Jyushi whimper under his touch. It had been a long time since he had come into contact with new victims, forgetting how much fun it was to torment and scare them.\r\n\r\n\"We have a few monsters in here that we keep as pets,\" he says, offering an explanation about the collection. \"Once human, these monsters either join us in capturing new guests, or stay as our playthings forever. I have a feeling that we're going to have a lot of fun together, my dear guests.\"\r\n\r\nHe pats them on the cheek again before something from the distance floats nearby, the light revealing it to be a double-ended dildo gag. Two sets of straps extend and wrap around both brother's heads, shoving each end inside. Both ends extend, filling up their mouths and tickling the back of their throats."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53448342, "type": "ic", "edited": "2018-12-12T07:45:12.525251", "format": "raw", "posted": "2018-12-12T07:45:12.525251", "text": "“We’re not...monsters?” Jyushi begins to explain, trailing off once the man, likely a monster of some kind, mentions that they used to be human. \r\n\r\nThe two of them strain their eyes to see in the darkness what could possibly be moving toward them and once the dildo gag is in the light it isn’t hard to discern what it’s use would be.\r\n\r\n“Please do-aaagh!” Totty’s plea is interrupted when the dildo works its way to the back of his throat.\r\n\r\nTheir closeness from the bonds turns the connected gag into a mockery of a kiss, both nearly choking on the massive dildos as they begin to squirm against one another in desperate attempts to escape."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53448451, "type": "ic", "edited": "2018-12-12T08:00:27.783915", "format": "raw", "posted": "2018-12-12T08:00:27.783915", "text": "The monsters laugh as the two brothers try to squirm away, their bondage and gags keeping them pressed tightly together. The vampire takes great pleasure in seeing them like this, knowing that the torture is only going to get worse from here on out.\r\n\r\nThe light squeezes them even tighter, the gags being pushed further down their throats as a result. The monsters all laugh and cheer as the bondage becomes tighter and tighter before finally loosening enough for the brothers to be able to squirm.\r\n\r\nThe tightening bondage has torn holes in the brothers' outfits, leaving their asses on display for the monsters to stare at. And not only that - two large, lubed-up dildos appear before taking their positions behind the brothers, slowly inching their way inside and filling them up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53448523, "type": "ic", "edited": "2018-12-12T08:09:26.385771", "format": "raw", "posted": "2018-12-12T08:09:26.385771", "text": "Jyushi and Totty are helpless to do anything except try to accustom themselves to the dildos fucking their throats the more that they move about. Even trying to stay still does nothing to stop the gags from slipping further down their throats - either pressed further in by the tightening light or the brothers’ own inability to stay still at exactly the same time.\r\n\r\nTotty is the first to break down in tears as he’s pushed flush against his brother, drool spilling from around the cock in his mouth and mixing with the tears running down his cheeks.\r\n\r\nJyushi tries to soothe his brother the best he can in the same predicament, making gargled cooing noises around the cock in his own mouth and holding onto Totty’s hands.\r\n\r\nIt’s more than a small relief when the light finally loosens up and gives them a lot more wiggle room against one another. Though the reason why becomes painfully clear when they feel the cold air of the house on their bare asses just moments for the massive dildos begin to work their way inside the brothers.\r\n\r\nThey both choke on their gags as they start to frantically squirm away from the dildos now invading their asses. But it doesn’t take more than a minute or two before they’d both completely nestled inside the brothers up to the base."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53453236, "type": "ic", "edited": "2018-12-12T19:43:34.755251", "format": "raw", "posted": "2018-12-12T19:43:34.755251", "text": "Laughter fills the room as the brothers squirm and choke on the dildos, both of them stuffed completely in each of their holes. The dildos in their asses fill them up nicely, along with the ones shoved in their throats.\r\n\r\nThe light continues to squeeze them as the monsters watch on, awaiting the moment when Jyushi starts to sob alongside his younger brother. Then something happens that makes the monsters cheer.\r\n\r\nThe dildos in their asses begin to vibrate, sending waves of pleasure to the captured brothers. The dildos are merciless in their assault, vibrations intensifying with each passing second."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53453302, "type": "ic", "edited": "2018-12-12T19:50:19.633092", "format": "raw", "posted": "2018-12-12T19:50:19.633092", "text": "It takes little time for Jyushi to begin sobbing around the dildo in his throat, unable to continue comforting Totty through his own torture. \r\n\r\nThey can hardly even focus on the monsters themselves when the vibrations start to rock through them. Their sobbing turns into whines of stifled pleasure as they rub against one another.\r\n\r\nIt hardly takes any time at all before they cum seconds after one another, completely ruining the tattered remains of their costumes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53453447, "type": "ic", "edited": "2018-12-12T20:00:57.602198", "format": "raw", "posted": "2018-12-12T20:00:57.602198", "text": "Even as the brothers cum on one another, the vibrations in their asses don't stop. The monsters all cheer and holler as the brothers' stifled whines fill the room, the dildo gags further muffling their cries as it extends even deeper down their throats.\r\n\r\nThen the light lifts the brothers up in the air, tightening as it suspends them upside down from the ceiling like a chandelier. Nothing more than a pretty decoration.\r\n\r\nThe monsters take a while to admire the suspended brothers, a few of them masturbating to the sight and shooting cum on their bodies and faces."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53453622, "type": "ic", "edited": "2018-12-12T20:13:27.625230", "format": "raw", "posted": "2018-12-12T20:13:27.625230", "text": "Jyushi and Totty both gag as the dildos extend even further down their throats, creating the slightest bulge as they squirm and groan along with the powerful vibrations.\r\n\r\nWhen they feel themselves begin to rise they entertain the briefest hope that gravity might allow the dildos in their asses to slip out before they end up upside down. The ears of Jyushi’s costume fall to the ground when they slip off his head with a soft thud while Totty’s mermaid skirt flips over itself and bares his underwear soaked with cum.\r\n\r\nThey groan as the monsters begin to masterbate and cover them in cum alongside their own as the vibrating dildos bring them to another orgasm."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53481461, "type": "ic", "edited": "2018-12-14T17:47:22.003020", "format": "raw", "posted": "2018-12-14T17:47:22.003020", "text": "More monsters join in on the fun, coating the brothers in loads of cum before leaving them to hang in the air, cum spilling into a puddle on the floor. Through it all, the vibrating dildos don't let up on their assault as they continue to buzz inside their asses.\r\n\r\nA half-hour passes before the light lowers them down, still keeping them pressed together but flipping them right side up before setting them on the ground. The vibrating slows down and eventually stops, the dildos sti lodged deep inside them.\r\n\r\nThe monsters surround the brothers, eager to see them up close. The vampire from earlier steps forward, tracing his fingers along the dildo bulges in their throats with a cruel smile.\r\n\r\n\"How do you feel about being used as fuck toys for the rest of the night?\" He asks while stroking their cheeks. \"Since it's Halloween, we'll be partying all night.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53482741, "type": "ic", "edited": "2018-12-14T19:48:29.389511", "format": "raw", "posted": "2018-12-14T19:48:29.389511", "text": "Being coated in layers of cum isn’t at all how the two brothers envisioned their night going. They just wanted to trick or treat around the neighborhood and visit a haunted house or two. Only the first one turned out to be this horribly perverted trap full of monsters bent on making their lives even more miserable.\r\n\r\nNeither Jyushi or Totty are able to make it the half hour without breaking down - cum drying on their bodies as they continued to writhe against one another. At some point their sobs had turned into moans of pleasure around the dildos in their throats. And they hardly seem to notice when the light begins to set their feet back on the floor until the vibrations from the dildos stop completely - then the moaning turns into a grunt of diappointment and a sigh of relief.\r\n\r\nSide-eying the crowd of monsters, Jyushi and Totty try to move in unison to be as far from them as possible until the vampire once again appears at their side. They whine when he traces the faint outline the gag makes within their throats, trying to remain as still as possible.\r\n\r\nStanding in a small puddle of cum neither brother can bring themselves to answer in their current hazy states."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53491327, "type": "ic", "edited": "2018-12-15T06:28:22.668786", "format": "raw", "posted": "2018-12-15T06:28:22.668786", "text": "Regardless of how they responded, the monsters still would have forced them to be the party playthings. They had spent the last few years playing with the same permanent guests, and although they were entertaining, new faces were even more fun to torment and break.\r\n\r\nThe dildos in their asses slowly pull out, eventually exiting altogether. Moments later, the straps keeping their gags inside loosen, and the dildos' sizes shrink before leaving their mouths. The light separates them, but keeps them tied tightly after it divides.\r\n\r\n\"Now,\" the vampire announces, the monsters closing in on the brothers. \"Who wants to go first?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53494785, "type": "ic", "edited": "2018-12-15T16:13:17.904419", "format": "raw", "posted": "2018-12-15T16:13:17.904419", "text": "Jyushi and Totty share a collective sigh of relief when the dildos leave their assed and mouths. There’s still the issue of being covered in a combination of their own cum and monster cum that still remains after the dildos are completely gone. Likely because the monsters were about to add another layer to the debauchery.\r\n\r\nBiting the inside of his cheek Jyushi makes little hops to stand in front of his younger brother protectively. Without the other Matsunos present that left Jyushi to be on charge of keeping the youngest out of any danger. \r\n\r\n“Leave Totty, alone. Okay? I’ll take twice what’s about to happen to me if you leave him alone.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53494895, "type": "ic", "edited": "2018-12-15T16:30:07.395402", "format": "raw", "posted": "2018-12-15T16:30:07.395402", "text": "The vampire laughs at Jyushi's desperate plea. Once being human, he vaguely understands the need to protect loved ones from harm, even if it had faded during his time here.\r\n\r\n\"How brave of you,\" he scoffs with a ruffle to his hair. \"The bond between you two must be strong for you to protect him like that.\"\r\n\r\nHe pats Jyushi on the cheek a few times as the monsters close in on them. When one of the monsters grabs Totty, the vampire holds his hand out in a signal to stop.\r\n\r\n\"He can just watch for now,\" he says, much to the monsters' disappointment. \"But this little werewolf is going to regret that decision soon.\"\r\n\r\nTotty is put on the side as the light wrapped around Jyushi yanks him upwards, spreading his legs out and shoving his arms behind him. His head tilts back in his position, floating on his back with his legs spread wide as he's suspended in the air.\r\n\r\nThe monsters line up on both sides of Jyushi, cocks fully erect and lubricated as the first one slides into his ass, followed by one in his mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53494965, "type": "ic", "edited": "2018-12-15T16:39:30.479225", "format": "raw", "posted": "2018-12-15T16:39:30.479225", "text": "Jyushi flinches with the vampire’s touch. Every pat seems to come when they’re being “cute” but somehow communicates condescension than any real compliment. It isn’t as if they were dogs trying to receive some scratches behind the ear or a belly rub. Though Jyushi can’t bring himself to struggle at all now that he’s put it upon himself to take whatever’s about to happen twice over in Totty’s defense.\r\n\r\nThe youngest Matsu sniffles as he watches the light around Jyushi contort him into a more vulnerable and open position, just the right height to be impaled by two cocks at the exact same time.\r\n\r\nJyushi groans as the first two monsters fill him with their cocks, helpless to do anything other than float between them."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53526981, "type": "ic", "edited": "2018-12-17T17:08:42.946456", "format": "raw", "posted": "2018-12-17T17:08:42.946456", "text": "The thrusting in both Jyushi's ass and mouth is merciless as he floats between the two monsters. While Jyushi's holes are pounded, the other monsters watch on eagerly, hardly able to wait for their own turns with the new plaything.\r\n\r\nCum fills Jyushi's ass minutes later, his mouth receiving the same treatment as he's forced to swallow the monster's cum. Once both cocks have left him, two more take their place seconds later as the next monsters step forward.\r\n\r\nWhile Totty may be on standby, that doesn't stop some of the monsters from stroking his face and mockingly kissing him on the cheek. A few monsters even stroke the outline of the bulge in his underwear, covering his mouth to prevent him from making too much noise.\r\n\r\n\"You should be thankful your brother is so kind,\" one of the monsters sneers. \"Otherwise you'd be in the same position as him.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53528355, "type": "ic", "edited": "2018-12-17T19:41:57.802384", "format": "raw", "posted": "2018-12-17T19:41:57.802384", "text": "Jyushi can only be thankful that the rest of his werewolf costume hasn’t yet been destroyed by the light as it had when it created an opening to his ass. Though he doesn’t entertain the thought for very long when both monsters cum inside of him, excess dripping from both ends and creating a puddle on the floor below him. And then there’s two more cocks thrusting inside of him.\r\n\r\nTotty is appalled by the display, whimpering at the sight of his brother until the monsters figure out that there are other ways to enjoy Totty and start to surround him. \r\n\r\nThen the sound is muffled by the hand that clamps around his mouth as hands explore his body. What remains of his costume provides hardly any protection, bare chested and a long skirt that was now torn. \r\n\r\n“Please just let us go,” he begs tearfully. “Or just stop...this. There has to be something else you do to people here other than this.”"}]