[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540228, "type": "ic", "edited": "2018-12-18T07:10:21.157139", "format": "raw", "posted": "2018-12-18T07:10:21.157139", "text": "The monsters surrounding Totty only snicker as they continue to touch him, pinching his nipples and stroking him through his cum-stained underwear.\r\n\r\n\"Well, if you must know...\" a spider monster perks up. \"We do have a few activities for our guests besides just fucking them. But I can assure you that you aren't going to enjoy them. We have training programs for new guests to shape them into their roles as monsters. We can show you what we mean once we're finished with your brother.\"\r\n\r\nThe light binding Jyushi tightens as he's fucked in both holes again and again, cum splattering all over his costume and face when some of the monsters didn't feel like cumming inside of him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53540267, "type": "ic", "edited": "2018-12-18T07:15:59.066197", "format": "raw", "posted": "2018-12-18T07:15:59.066197", "text": "At some point, a monster using his ass hits the perfect spot in Jyushi - bringing out a strangled moan from the older Matsu from around the cock in his mouth as his torn pants dampen with another orgasm. The only solace he can really find is that Totty isn’t being used in the same ways.\r\n\r\n“W-what? You’re going to turn us into monsters?”\r\n\r\nTotty is horrified at the prospect, completely unsure how the process would even work or what they would be turned into."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540389, "type": "ic", "edited": "2018-12-18T07:29:17.713957", "format": "raw", "posted": "2018-12-18T07:29:17.713957", "text": "The spider monster strokes Totty's face, giving him a few condescending pats before explaining.\r\n\r\n\"That's right... by the time your transformation is over, you'll be unable to leave this mansion. Your minds will be transformed too, completely broken down into mindless, obedient sex dolls. You'll practically beg to be fucked and abused everyday, and we'll be more than willing to give that to you.\"\r\n\r\nHe gives him a kiss to the cheek, silk forming from his finger tips as he starts to wrap up Totty. The light disperses, but now he's left in a silk cocoon.\r\n\r\n\"I think a mermaid would be a good fit for a cutie like you,\" he says while gazing at Jyushi's abuse. \"As for your brother, a werewolf would be charming.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53540551, "type": "ic", "edited": "2018-12-18T07:48:05.439525", "format": "raw", "posted": "2018-12-18T07:48:05.439525", "text": "“Please, we didn’t ask for this.” Totty’s voice breaks halfway through as the tears start up again - he just can’t help it. Begging is the only thing he has at his disposal and he doesn’t want to think about the fact that it could possibly be a skill to aid him if they actually managed to transform them body and mind.\r\n\r\nWhat would it be like to beg for this kind of torment? Totty doesn’t want to know and he doubts Jyushi does either.\r\n\r\nBut he can’t fight back now that he’s wrapped in the silk cocoon that encases him even more so than the light that previously held him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540615, "type": "ic", "edited": "2018-12-18T07:56:00.816329", "format": "raw", "posted": "2018-12-18T07:56:00.816329", "text": "The monsters surrounding Totty laugh and mock him as he cries, the spider kissing and licking his tears away.\r\n\r\n\"Poor little toy,\" he coos, using silk to fill his mouth and silence him. \"None of the monsters asked for it. But you're really going to enjoy your new life here after a while, I promise. Both you and your brother.\"\r\n\r\nHe kisses him on the cheek again before lifting him up, placing his cocooned body on his back and carrying him to another room.\r\n\r\n\"Your brother probably isn't going to be finished for a while, so let's start your training in the meantime. Don't worry, we can visit him once our session is over.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53540704, "type": "ic", "edited": "2018-12-18T08:03:51.702035", "format": "raw", "posted": "2018-12-18T08:03:51.702035", "text": "The mockery does nothing to make Totty stop crying. Which is probably the whole point as he starts to whine again. Only the spider monster is the least bit kind and even that is only a minor bit of difference between them and the others.\r\n\r\nHis sobs only lessen when the silk fills his mouth and muffles the cries. \r\n\r\nJyushi notices his brother’s absence almost immediately, tuned into his younger sibling’s well being now that they’re in such a dangerous predicament.\r\n\r\nHe lets out a questioning grunt of protest as he watches the monster carry Totty away."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540841, "type": "ic", "edited": "2018-12-18T08:26:06.396803", "format": "raw", "posted": "2018-12-18T08:26:06.396803", "text": "The monster thrusting down Jyushi's throat goes at it harder when he grunts in protest, along with the monster abusing his ass. They don't show any remorse for separating the two for the moment, focusing more on preparing them for their training.\r\n\r\nThe room the spider monster reaches features a large glass container of water, comparable to a fish tank with colorful decorations. Sitting nearby is a glass bottle filled with an odd blue liquid.\r\n\r\nTearing the silk out of his mouth, the spider monster soon grabs for the vial of mysterious liquid and unscrews it.\r\n\r\n\"You'll be drinking this in the morning and at night. It'll help your physical transformation, while your mental transformation drinks will be given once a day.\"\r\n\r\nHe pinches Totty's nose as he inches the bottle towards his mouth, pressing it to his lips while he waits for him to open up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53540875, "type": "ic", "edited": "2018-12-18T08:35:36.670801", "format": "raw", "posted": "2018-12-18T08:35:36.670801", "text": "Totty observes the room almost curiously. His struggles cease almost immediately as he looks at the tank, the inside of which is more colorfully decorated than the outside of the room. It’s unnerving that the room is already prepared - as if the monsters were prepared to take anyone in as a pet given the opportunity.\r\n\r\nHe works his tongue out of his mouth a few times to work the dryness out of his mouth provided by the silk, listening to the spider with rapt attention as his focus is brought to the bottle.\r\n\r\nTotty can’t even question the potion before his nose is being held and he’s forced to swallow the blue liquid down."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53587059, "type": "ic", "edited": "2018-12-20T06:40:39.447533", "format": "raw", "posted": "2018-12-20T06:40:39.447533", "text": "The spider gleefully watches Totty swallow the entire bottle of liquid, pulling away when he's finished and covering his mouth with a hand to keep him from spitting it out.\r\n\r\n\"This room will be yours once your physical transformation is complete,\" he explains, hands running down his cocooned body. \"Right now, you'll be practicing holding your breath underwater to aid your body in the transformation. And I'll be having my fun with you the whole time.\"\r\n\r\nHe carries Totty to the tank, leaning him towards the pool of water before tearing off the silk covering his ass. He takes his time lubing up before slowly inching his way inside, filling up Totty before thrusting. With the first thrust, he shoves his head underwater, starting Totty's daily training."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53587356, "type": "ic", "edited": "2018-12-20T06:49:18.620587", "format": "raw", "posted": "2018-12-20T06:49:18.620587", "text": "This couldn’t be possible, Totty thinks as he’s maneuvered into position. It had to be come kind of elaborate prank pulled by people in very realistic costumes because he doesn’t feel any different after drinking the potion. Not even a little bit. \r\n\r\nHe doesn’t even have enough time to protest before he feels the monster’s cock slip inside of him almost painfully slow and he loses his train of thought to a series of whimpers. \r\n\r\nTotty tries not to panic with the first thrust, but he can’t help but gasp in surprise at the exact same time that his head is dunked into the tank, resulting in the Matsu thrashing about and impaling himself further on the cock."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53587697, "type": "ic", "edited": "2018-12-20T06:59:27.559391", "format": "raw", "posted": "2018-12-20T06:59:27.559391", "text": "Totty's struggles as he fights for air sends a jolt of pleasure to the monster that goes straight to his cock, his ass clenching around him with every jerk, squirm, and wiggle. The silk is unbreakable by those trapped inside, making his struggles completely useless.\r\n\r\nThe monster lifts his head up for a brief moment, hair and face drenched in water. He chuckles before shoving it back down, thrusts reaching new speeds before he eventually cums inside him. Throughout the process, he lifts and dunks Totty's head in the water repeatedly, greatly enjoying his futile struggles. Even after he's cum inside him, he still keeps up the training.\r\n\r\nWhen he's finally finished, he tosses Totty's cocooned body to the side like a toy, bending over him to look him in the eyes.\r\n\r\n\"You're not going to become a mermaid overnight, so we'll keep up the training with every drink you take.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53587926, "type": "ic", "edited": "2018-12-20T07:07:48.319061", "format": "raw", "posted": "2018-12-20T07:07:48.319061", "text": "With each thrust, Totty cries out - doing nothing to help his struggle for air when he’s held underwater. Though it’s hard to tell that he’s crying when he’s taken out as his sopping wet hair clings to his face. \r\n\r\nHe hardly even notices the spider monster cumming inside of him until he’s brought up for another quick gasp of air. And the strangled cry he releases is completely broken before he’s shoved back into the tank.\r\n\r\nTotty pants heavily when he’s finally given reprieve from the tank, chest heaving against his silk bindings as the spider looms over him. \r\n\r\nHe won’t be turning into a mermaid overnight but the makeup that had been washed away by the water has been replaced by the silvery pink glint of fresh scales to show the start of his transformation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53588232, "type": "ic", "edited": "2018-12-20T07:19:51.638157", "format": "raw", "posted": "2018-12-20T07:19:51.638157", "text": "The spider monster runs his hands over Totty's scales, smiling to himself as the potion has started to show its effects.\r\n\r\n\"Gorgeous,\" he sighs, leaning down to kiss his face. \"Simply beautiful. You'll make a fine addition to our collection of guests once your transformation is complete. You'll belong to us completely... mind, body, and soul.\"\r\n\r\nHe gives him a kiss to the lips before filling his mouth with silk again, followed by the rest of his head as he rewraps Totty. Now he's completely wrapped up, with small air holes near his nostrils to allow him to breathe.\r\n\r\nHaving enjoyed seeing Totty struggle while underwater, the spider monster covers the air holes with his fingers, planning to pull away when he's satisfied with Totty's little private show."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53588470, "type": "ic", "edited": "2018-12-20T07:29:41.167721", "format": "raw", "posted": "2018-12-20T07:29:41.167721", "text": "Totty whines when the monster kisses his face, squirming in the silk bondage and stilling when he can’t find the energy to resist that much. Being half drowned had really taken what little fight he had out of him and Totty blinks hazily at the monster when he fills his mouth with silk again.\r\n\r\nMind, body, and soul, huh? He still doesn’t quite believe what’s happening but if this was all his training entailed Totty could imagine how easily that could break his spirit. \r\n\r\nEven more so when his entire head is wrapped up and he’s left to contemplate in the darkness. Then his air is taken from him again and Totty kicks his bound together legs fruitlessly as black spots start to cloud his vision."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53588722, "type": "ic", "edited": "2018-12-20T07:41:45.120643", "format": "raw", "posted": "2018-12-20T07:41:45.120643", "text": "The spider monster laughs cruelly as he watches Totty struggle, pulling away momentarily before plugging up his nose again, this time with the intention to make him pass out. With his precious air stolen, he'd have no other option than to black out, making him a lot easier to carry to his web.\r\n\r\nJyushi's torture has just ended, another spider-like monster leaving him in a similar cocooned state, plugging up his nose to force him to pass out. Jyushi is carried to the same area as Totty, two silk mummies wrapped up side by side for the monsters to admire.\r\n\r\nTotty and Jyushi's new lives as monster playthings were in motion, whether they liked it or not."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53588947, "type": "ic", "edited": "2018-12-20T07:52:23.547911", "format": "raw", "posted": "2018-12-20T07:52:23.547911", "text": "Exhausted as he is, it doesn’t take long for Totty to run out of what little energy he has to stay conscious - silk cocoon going limp enough for the monster to easily pick up.\r\n\r\nUnconscious, neither of the two brothers are aware as they’re finally reunited on the web to be on display to the monsters. It would be several hours until they woke up again, confused about their predicaments as they figured the events that transpired on Halloween had only been a shared nightmare.\r\n\r\nBut it wasn’t. They’re both trapped in darkness - Totty unable to see the first signs of his transformation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53589043, "type": "ic", "edited": "2018-12-20T07:59:16.146965", "format": "raw", "posted": "2018-12-20T07:59:16.146965", "text": "The spider monsters are the first to \"greet\" the two playthings - each one hovering over their chosen prey. Some of the monsters are up and about, but most of them are still sleeping after the hectic Halloween party.\r\n\r\nThey whistle and holler as the silk is torn off of their chests, exposing their nipples for the spiders to play with. They start by using their hands - pinching and twisting them harshly as the other monsters cheer.\r\n\r\nTheir mouths soon toy with their nipples by sucking, licking, and biting the nubs, eager to begin today's training."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53589124, "type": "ic", "edited": "2018-12-20T08:06:10.276879", "format": "raw", "posted": "2018-12-20T08:06:10.276879", "text": "The two Matsus moan, waking up more when they feel the sharp pinpricks of pain in their nipples. Their bodies shake and quiver on the webs the more that their poor buds are teased - muffled whines coming from the silk as they’re roused into wakefulness.\r\n\r\nIt soon becomes clear that the previous night wasn’t a dream at all and Jyushi and Totty have quite the day of training ahead of them so that they can be molded into their new roles as monsterous pets for the rest of the house’s inhabitants.\r\n\r\nJyushi has yet to even begin his training regimen, completely unaware that Totty had already been told what he would end up being turned into."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53589293, "type": "ic", "edited": "2018-12-20T08:17:02.207124", "format": "raw", "posted": "2018-12-20T08:17:02.207124", "text": "The monsters all enjoy the sight of Totty and Jyushi trembling in their silk bondage, completely blind to the world around them and unable to see what's coming next as they're flipped over. The silk covering their ass is soon torn off, the spiders each sliding two fingers inside and finger fucking their poor holes.\r\n\r\nWhen they're satisfied, they give their asses a smack, then carry them down out of the web and onto the floor, where more monsters surround them. Lustful looks fill their eyes as they start to pass them around like party favors, teasing and tormenting their nipples and asses."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53589595, "type": "ic", "edited": "2018-12-20T08:35:43.882609", "format": "raw", "posted": "2018-12-20T08:35:43.882609", "text": "The brothers’ cocks strain against the silk as they’re worked up, the whines picking up in volume when the spiders start finger fucking them. There’s even sounds of muffled disappointment when they’re left empty, turning into panic when they feel themselves being moved. \r\n\r\nAll of the hands on them are a mix of unwelcome and welcome as they’re passed around to be played with - just the beginning of their new lives."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53590114, "type": "ic", "edited": "2018-12-20T09:06:23.317263", "format": "raw", "posted": "2018-12-20T09:06:23.317263", "text": "When the monsters are finished passing them around, they lean the Matsus against the wall, the silk sticking to it as they're held upright. A few monsters line up to play with them, rubbing and teasing their bulges and torturing their poor nipples. A few of them deprive them of air while they play with them - one hand pinching their holes shut while the other pinches one of their nipples.\r\n\r\nAfter being left like that for a full hour, the silk covering the Matsus' eyes and ears are torn off as the spider monsters surround them to explain the day's schedule.\r\n\r\n\"The two of you need to drink your physical transformation potions this morning, then we'll start your training for the rest of the day.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53590277, "type": "ic", "edited": "2018-12-20T09:16:43.936664", "format": "raw", "posted": "2018-12-20T09:16:43.936664", "text": "Jyushi lets out a questioning grunt at the mention of transformation potions - having spent his night being used by the monsters in the house until he’d been wrapped up. Even now there’s still some cum that slides down between his legs now that the silk has been taken away.\r\n\r\nAs such, he’d entirely missed the explanation that Totty had received while he was being dunked into the water tank. \r\n\r\nHe slides his gaze to his younger brother to see whether or not he knew what the monsters were talking about and is surprised to find the silvery pink scales that have started to form around Totty’s eyes, pretty and delicate as they reflect what litttle light is in the room."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53652226, "type": "ic", "edited": "2018-12-22T07:16:15.537414", "format": "raw", "posted": "2018-12-22T07:16:15.537414", "text": "\"You seem confused,\" one of the spider monsters says as he looks to Jyushi. \"Don't worry, we can explain everything.\"\r\n\r\nHis hand reaches up to Jyushi's face to stroke his cheek, calmly explaining the procedure as if the idea isn't heinous or the least bit questionable.\r\n\r\n\"During your time here, not only will you be transformed into perfect, obedient playthings, but you'll also permanently become monsters. As you can see,\" he points to Totty, \"Your brother has already begun his transformation. He'll be turned into a pretty mermaid.\"\r\n\r\nHe leans in closer to Jyushi's face as he reveals his fate, teeth barring a nasty grin.\r\n\r\n\"As for you, you'll make quite the lovely werewolf.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53652478, "type": "ic", "edited": "2018-12-22T07:25:25.725038", "format": "raw", "posted": "2018-12-22T07:25:25.725038", "text": "Jyushi raises an eyebrow at the explanation, trying to shrink back from the spider’s mouth. A werewolf and a mermaid? The idea was completely ridiculous despite all that they’d gone through during Halloween.\r\n\r\nMagic was possible, there was no denying that and monsters were real but unless he hadn’t already seen the proof on Totty’s face, he wouldn’t have believed for a second that it was possible.\r\n\r\nHe grunts again to express his irritation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53652793, "type": "ic", "edited": "2018-12-22T07:38:08.893970", "format": "raw", "posted": "2018-12-22T07:38:08.893970", "text": "The monster pulls back from Jyushi's face, tearing out the silk filling his mouth. The other monster does the same to Totty, giving him kisses to his shiny pink scales.\r\n\r\nIt doesn't take long for other monsters to arrive with the bottles, one filled with blue liquid, the other with green. When they hand the bottles off to the spiders, the two place the opening to the brothers' lips, holding their noses to force them to open up.\r\n\r\n\"I promise it'll be quick and painless,\" the one holding Jyushi's nose says. \"So open up like a good little pet...\""}]