[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53653157, "type": "ic", "edited": "2018-12-22T07:54:12.954276", "format": "raw", "posted": "2018-12-22T07:54:12.954276", "text": "Having experienced the same events last night, Totty wants to get this part done as quickly as possible once his nose has been plugged - obediently swallowing down the blue potion that he knows will alter his physical form even further. He pauses at the green bottle, having been spared drinking this particular potion before, but only for a second before he swallows its contents as well.\r\n\r\nJyushi struggles more than his brother, not wanting to accept their fates so quickly. And especially not wanting to turn into some kind of werewolf pet to be trapped inside this house.\r\n\r\nHe’s forced to relent when he wants to take a breath of fresh air, chugging down the potions as quickly as he can."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53653354, "type": "ic", "edited": "2018-12-22T08:03:38.229523", "format": "raw", "posted": "2018-12-22T08:03:38.229523", "text": "Once the potions are gone, the monsters give them a few light pats and strokes to the cheek along with gentle smiles.\r\n\r\n\"That wasn't so bad, was it?\" The monster coos at Jyushi. \"Your brother seems to have gotten the hang of it, as well.\"\r\n\r\nHe runs his hands along Jyushi's torso before rubbing at the bulge trapped by the silk, further explaining the green potion's effects.\r\n\r\n\"The second potion will gradually mentally change you. You'll thrash and struggle and fight it at first, but eventually your mind will betray itself. You'll find yourself craving the way we use and abuse you, and may even beg for it. Once your body has gotten used to the potion, the change will eventually be permanent.\"\r\n\r\nHe gives Jyushi a quick peck to the lips, sighing against him.\r\n\r\n\"Kiss your old life goodbye, because you'll be here forever.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53690901, "type": "ic", "edited": "2018-12-24T03:17:13.625630", "format": "raw", "posted": "2018-12-24T03:17:13.625630", "text": "Jyushi grinds his teeth in nervous anticipation as the potion starts to take effect and flushes a warmth straight to his trapped cock. The irritable grunts he’s emitted so far turning into another pathetic whine.\r\n\r\nHe wants to protest and whine but just trying is a struggle of garbled nonsense that he doesn’t know whether or not he should attribute to the first or second potion that he’d been forced to take. But other than that he notices no other changes aside from the sudden need in his cock.\r\n\r\nLooking at Totty proves that his younger brother is in a similar enough position, more scales beginning to form around his eyes."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53707694, "type": "ic", "edited": "2018-12-25T01:28:08.718602", "format": "raw", "posted": "2018-12-25T01:28:08.718602", "text": "The monster in charge of Totty runs his fingers through his delicate, shiny scales, leaving soft kisses against his lips. Meanwhile, the other spider monster has noticed the bulge in Jyushi's silk bindings as he cups it in the palm of his hand.\r\n\r\n\"Oh?\" He flashes a smile to Jyushi. \"Is this little werewolf feeling frisky? Don't worry, I'll take care of that.\"\r\n\r\nThe monster squats down in front of Jyushi's erection, his pathetic whines music to his ears. Ripping the silk off and freeing his erection, the spider licks his lips and leaves kisses along his shaft."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "F2A400", "show_edited": false, "id": 53924875, "type": "ic", "edited": "2019-01-05T03:32:23.340006", "format": "raw", "posted": "2019-01-05T03:32:23.340006", "text": "Totty whines breathlessly at the treatment he’s receiving from his monster. So much more gentle than the fucking he’d received last night - though he knows that Jyushi had to have suffered much more being passed around all of the haunted house’s inhabitants.\r\n\r\nThere’s even a tingle in his legs that he isn’t sure whether or not it’s arousal or the beginning of his transformation into an actual mermaid.\r\n\r\nJyushi whines too, but for entirely different reasons as the spider monster unveils his cock and starts kissing it. He starts to pant a little as well, drooling and not noticing that his tongue is a little longer and flatter too - more closely resembling a large dog’s."}]