[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697621, "type": "ic", "edited": "2018-03-12T05:20:47.532328", "format": null, "posted": "2018-03-12T05:20:47.532261", "text": "For the Totoko RP!\r\n\r\nhttps://www.cherubplay.co.uk/chats/26aed678-7892-417f-97c0-c7d2c4751d33/"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48697832, "type": "ic", "edited": "2018-03-12T05:32:48.687486", "format": null, "posted": "2018-03-12T05:32:48.687486", "text": "Totoko whines as the man’s cum joins her own juices in leaking from her pussy. She couldn’t continue doing this unless she wanted to be completely fucked out of her mind. But by the sound of it, she’s going to be around for a long time to make even more perverted videos for people to enjoy.\r\n\r\nThe thought brings another fresh set of tears as she begins sobbing through the ring gag."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48697979, "type": "ic", "edited": "2018-03-12T05:43:22.429819", "format": null, "posted": "2018-03-12T05:43:22.429819", "text": "\"Aw, poor baby,\" Tsubasa mocks, rolling Totoko over on her back to take the nipple clamps off. \"They look so sore... poor little thing. I think you deserve a break, don't you?\"\r\n\r\nShe snips off the pantyhose covering her body, along with the tape wrapping her body up. The man that fucked her has her body pinned down, just in case she tried to get away.\r\n\r\n\"You'll be stored away for your break, and we'll pull you out in a few hours for some more training,\" she says as employees come out with a latex bitchsuit and rubber mask. The naked man drags Totoko over to the suit, forcing her knees and elbows in the slots and fastening the tight suit against her.\r\n\r\n\"Sweet dreams, sweetheart,\" Tsubasa says before the mask is put on, the employees transporting her to a storage area. The storage area is filled with toys, which the guards plan to use to humiliate Totoko before letting her rest."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48698399, "type": "ic", "edited": "2018-03-12T06:16:36.885282", "format": null, "posted": "2018-03-12T06:16:36.885282", "text": "Another cry of pain as the clamps are finally removed and blood rushes back into her sore and puffy nipples. More drool spills onto her breasts as she sobs with relief. The promise of rest is more than a little tempting, just enough to distract her from the fact that Tsubasa has confirmed her new position within the company as their new form of entertainment.\r\n\r\nShe hardly protests as she’s slipped inside the bitchsuit and masked with the rubberly latex that leaves her blind and deaf to the outside world. Totoko can hardly bring herself to care as she’s carried into the storage area - unable to see the toys being planned to use against her."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48698492, "type": "ic", "edited": "2018-03-12T06:23:44.079883", "format": null, "posted": "2018-03-12T06:23:44.079883", "text": "The employees lie Totoko down on her back on the floor, one circling around her as another grabs onto a riding crop. He unzips the zipper covering her breasts, freeing them from the latex. He gives her no time to prepare as he starts to whip at her breasts, another employee pinching the holes on her mask shut for a few seconds before releasing.\r\n\r\n\"I wonder how much fight she still has left in her,\" one asks as he unzips the zipper covering her pussy, inserting a vibrator into her folds before turning it on a decent setting. \"I wanna see this little bitch squirm.\"\r\n\r\nThe whipping on her breasts stops, only for vibrators to be attached to her nipples. With both nipples and her pussy stimulated, she'd be restless for as long as the men decided to play with her."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48698564, "type": "ic", "edited": "2018-03-12T06:30:59.489220", "format": null, "posted": "2018-03-12T06:30:59.489220", "text": "Nipples already sore, Totoko can hardly take the attention being given to them by the crop, crying out though the mask as her breasts jiggle and bounce with every swat. Her movement becomes more erratic as the only air holes are covered, jerking and twitching wildly. She moans as another vibrator is set into her well lubricated pussy, sending her into a confused daze about her treatment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48749890, "type": "ic", "edited": "2018-03-15T05:09:52.301415", "format": null, "posted": "2018-03-15T05:09:52.301415", "text": "The men chuckle as they turn up the vibrators to her nipples and pussy, holding her nose again to deprive her of air. They don't pull away for a while until she's likely on the brink of passing out, only letting go for a few brief moments before torturing her again with no air.\r\n\r\nThe cycle of breathplay goes on and on, the men playing with Totoko in many different ways. One slaps her breasts, another plays with her shortened limbs, having enjoyed seeing them flail the first time her nose was held."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48750188, "type": "ic", "edited": "2018-03-15T05:33:06.431352", "format": null, "posted": "2018-03-15T05:33:06.431352", "text": "Totoko flails miserably while she’s deprived of air, quickly becoming exhausted from the lack. She wishes the men would just allow her to pass out but she knows that it’s unlikely. Her breasts become pink as they’re continually slapped, jiggling together and illiciting muffled sobs from the poor girl."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48750284, "type": "ic", "edited": "2018-03-15T05:40:42.679130", "format": null, "posted": "2018-03-15T05:40:42.679130", "text": "After playing with Totoko for a while, the men leave her be, turning the vibrators on to the highest setting before leaving her alone to writhe on the floor.\r\n\r\nAfter a few hours have passed, the vibrators run out of batteries, but by then there's little time for rest as the employees come to retrieve her. Placing a tight collar around her neck with a tag that says \"Bitch Slut\", they attach a leash to it and force her on her elbows and knees, tugging her along the floor as they exit the storage room. One employee removes the mask, allowing saliva to drop from the ring gag still lodged in her mouth.\r\n\r\n\"Hurry along, bitch. We're on a schedule, here,\" he demands."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48750419, "type": "ic", "edited": "2018-03-15T05:53:02.896358", "format": null, "posted": "2018-03-15T05:53:02.896358", "text": "The poor girl has no room to rest under the intense power of the vibrators. Her nipples are hard and erect throughout the next several hours almost to the point of causing pain and she cums several more times in addition to the numerous times she had already since the beginning of her capture.\r\n\r\nShe wants to hate it, really she does, but the pleasure that comes from the instense pain is beginning to override her sensibilities and starting to break her down. \r\n\r\nThe idol is almost disappointed when the vibrators run out of juice, but she doesn’t have to wait long before she’s being retrieved again - collared and unmasked, drool spilling out of her mouth almost immediately as Totoko struggles to keep up with their pace."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48757784, "type": "ooc", "edited": "2018-03-15T20:49:03.621132", "format": null, "posted": "2018-03-15T20:49:03.621132", "text": "(( what do you feel about Nyaa-chan joining the party? she'd either be a retired idol or on break when she gets kidnapped, and her and Totoko could star in videos together"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48757845, "type": "ooc", "edited": "2018-03-15T20:54:05.652976", "format": null, "posted": "2018-03-15T20:54:05.652976", "text": "That sounds good!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48757931, "type": "ooc", "edited": "2018-03-15T20:59:38.180546", "format": null, "posted": "2018-03-15T20:59:38.180546", "text": "(( great!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48758059, "type": "ic", "edited": "2018-03-15T21:08:24.070613", "format": null, "posted": "2018-03-15T21:08:24.070613", "text": "The employees laugh as she struggles forward, eventually reaching the room where she had been filmed in hours earlier. There's another girl in a bitchsuit spread out on her back on an examination table, a latex mask stretching over her face. Her long, pink hair is visible behind the mask, pussy exposed through a zipper in the bitchsuit.\r\n\r\n\"Hi, Totoko!\" Tsubasa coos. \"Did you enjoy your rest? While you were on break, we found a pretty new toy to play with, and you two are going to be in the same video!\"\r\n\r\nTsubasa takes off the mask, revealing a ring-gagged Nyaa Hashimoto underneath."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48760376, "type": "ic", "edited": "2018-03-15T23:40:25.834289", "format": null, "posted": "2018-03-15T23:40:25.834289", "text": "Nyaa squirms in her tight latex bondage, feeling absolutely betrayed as she listens to the muffled voices around her - no doubt discussing her fate. Some men had approached her with a woman that said she was a huge fan and then she’d been abducted straight from the venue she’d been performing at. \r\n\r\n“Nyaaahn?!” Totoko states incredulously, recognizing the hair even before she’s unmasked.\r\n\r\nThe two girls look at each other with narrowed eyes, briefly forgetting their current predicament in favor of their rivalry."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48761327, "type": "ic", "edited": "2018-03-16T00:29:00.774344", "format": null, "posted": "2018-03-16T00:29:00.774344", "text": "From the way the two girls look at each other, Tsubasa can tell that there's animosity between them.\r\n\r\n\"Do you two lovely ladies know each other?\" She asks, giggling. \"Well, that'll make this video a lot easier to shoot when there's chemistry between you two!\"\r\n\r\nTsubasa rubs a finger on Nyaa's clit as she explains the video's contents, slowly and gently rubbing it in a circle.\r\n\r\n\"Nyaa over here is going to be our new star, but she's been such a brat. We need to show her that her behavior is unacceptable. We'll start the video by making her pussy nice and wet with all sorts of toys, then we'll tie you two into a 69 position. Whoever cums first gets punished! Think of this as some sort of competition between you two.\"\r\n\r\nShe removes her finger from Nyaa's clit, smirking down at the cat idol.\r\n\r\n\"Are you ready, my little bitch?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 48768047, "type": "ic", "edited": "2018-03-16T06:14:10.507598", "format": null, "posted": "2018-03-16T06:14:10.507598", "text": "Nyaa’s expression flickers with pleasure at her treatment, arching into Tsubasa’s touch and hardly paying attention to what the woman is saying. Totoko’s eyes narrow further, annoyed that she’d been treated so poor when she’d been kidnapped and now Nyaa is being treated like a little princess.\r\n\r\nShe’d win the compitition for sure so that the more popular idol would be punished."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 48770960, "type": "ic", "edited": "2018-03-16T16:04:49.987047", "format": null, "posted": "2018-03-16T15:54:43.484688", "text": "Tsubasa smirks at Totoko's expression. She knows how to play the cards right in a situation like this. Pitting two girls against each other in a dire situation when they already have a rivalry burning between them was brilliant in her eyes.\r\n\r\nThe cameras start rolling a few minutes later, Totoko placed on a chair off-screen in a sitting position while Nyaa continues lying on her back.\r\n\r\n\"Good evening!\" Tsubasa greets, smiling at the camera. \"Today, we have a very special guest that's going to be working with us from now on: Nyaa Hashimoto!\"\r\n\r\nShe gives Nyaa a kiss on the cheek, stroking her hair and giving Totoko a cruel smirk.\r\n\r\n\"First, we're going to get Nyaa-chan all wet for her special performance! You'll see what I mean soon!\"\r\n\r\nTsubasa picks out a vibrator from a tray nearby, pressing it against Nyaa's slit before turning it on."}]