[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47502309, "type": "ic", "edited": "2018-01-09T08:23:45.751446", "format": null, "posted": "2018-01-09T08:23:45.751408", "text": "(18+ only please!)\r\n\r\nHonestly?? I just want to make these cute NEETs suffer through extreme bondage kinks, like bitchsuits and mummification and being treating like a sex toy. Most kinks below are optional but I'd love you forever if you could indulge me in my rarer kinks.\r\n\r\nMy kinks include heavy bondage, shibari, struggling/thrashing, gags (!!!), bitchsuits (!!), suspension bondage, nipple clamps, begging, toys, double/triple penetration, humiliation, degradation, crying, recording, blindfolds, latex, public use, spanking, mummification bondage, orgasm denial, fucking machines, overstimulation, drool/saliva, electricity, cock milking, breathplay, and likely more! Hard no's are are anything unsanitary, gore, vore, pregnancy, bestiality, or death."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47502310, "type": "ooc", "edited": "2018-01-09T08:23:52.908495", "format": null, "posted": "2018-01-09T08:23:52.908495", "text": "Hello!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47504011, "type": "ooc", "edited": "2018-01-09T15:01:51.894075", "format": null, "posted": "2018-01-09T15:01:51.894075", "text": "(( hi!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47504448, "type": "ooc", "edited": "2018-01-09T15:57:43.277779", "format": null, "posted": "2018-01-09T15:57:43.277779", "text": "I definitely want to work something out with you"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47506236, "type": "ooc", "edited": "2018-01-09T18:36:51.526503", "format": null, "posted": "2018-01-09T18:36:51.526503", "text": "(( I'm glad to hear that! What did you have in mind?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47507016, "type": "ooc", "edited": "2018-01-09T19:33:34.526188", "format": null, "posted": "2018-01-09T19:33:34.526188", "text": "Well everything you have listed is right up my alley but I don’t actually have any specific ideas at the moment"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47507087, "type": "ooc", "edited": "2018-01-09T19:37:51.230254", "format": null, "posted": "2018-01-09T19:37:51.230254", "text": "(( ah, I see! we can brainstorm then. was there a specific character you wanted to play? I might have a few ideas. I even had an idea involving Totoko if you were at all interested in playing her."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47507282, "type": "ooc", "edited": "2018-01-09T19:52:49.621096", "format": null, "posted": "2018-01-09T19:52:49.621096", "text": "I was thinking of Ichi, but I wouldn’t mind playing Totoko"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47507445, "type": "ooc", "edited": "2018-01-09T20:03:29.206087", "format": null, "posted": "2018-01-09T20:03:29.206087", "text": "(( Alright! The idea I had for Totoko involved her signing up for an actress position for a studio, only to find out too late that it's for a heavy/extreme bondage porn company"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47507816, "type": "ooc", "edited": "2018-01-09T20:29:28.417342", "format": null, "posted": "2018-01-09T20:29:28.417342", "text": "Oh yeah that could definitely work out!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47511521, "type": "ooc", "edited": "2018-01-10T00:05:42.730863", "format": null, "posted": "2018-01-10T00:05:42.730863", "text": "(( glad you're alright with that!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47512971, "type": "ooc", "edited": "2018-01-10T01:19:48.435555", "format": null, "posted": "2018-01-10T01:19:48.435555", "text": "No problem! It sounds like a really good idea"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 47519640, "type": "ooc", "edited": "2018-01-10T06:05:52.867314", "format": null, "posted": "2018-01-10T05:56:04.949641", "text": "(( thanks! an idea I had involved Totoko's manager livestreaming events where subscribers could suggest ways to tie up and tease Totoko; eventually adding layers and layers of tape and pantyhose to her ensemble until she can barely budge"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47520319, "type": "ooc", "edited": "2018-01-10T06:42:07.165390", "format": null, "posted": "2018-01-10T06:42:07.165390", "text": "Yes!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47535207, "type": "ooc", "edited": "2018-01-11T04:55:31.918829", "format": null, "posted": "2018-01-11T04:55:31.918829", "text": "(( okay, cool! I'll write the starter if we have nothing else to discuss"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47535288, "type": "ooc", "edited": "2018-01-11T05:00:19.498289", "format": null, "posted": "2018-01-11T05:00:19.498289", "text": "I say go for it m!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47535773, "type": "ic", "edited": "2018-01-11T05:27:15.168196", "format": null, "posted": "2018-01-11T05:27:15.168196", "text": "Tsubasa had a knack for trickery. With her smooth voice and good offers in business, it would take a detective to figure out where her true intentions lied.\r\n\r\nHer latest endeavor in her porn company was simple: put flyers around town offering a harmless acting gig, only to trap them before they could realize what was happening.\r\n\r\nTotoko Yowai was a pretty little thing, pretty enough to be a big hit with Tsubasa's subscribers. She was due to come by today for a \"rehearsal\", where she was sent a script of her practice role as a damsel in distress. The script, however, gave no mention of her being gagged or having her clothes snipped away.\r\n\r\nOnce she heard her office door open, Tsubasa smiled at Totoko, putting on her best professional attitude.\r\n\r\n\"Hello, Ms. Yowai. Please, have a seat.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47536194, "type": "ic", "edited": "2018-01-11T05:49:39.075762", "format": null, "posted": "2018-01-11T05:49:39.075762", "text": "Totoko was...a little nervous about the gig. Sure, she was a well known idol within the community and everyone loved her - as they should - but this acting job promised a more widespread fan base if the audience was pleased with her performance. She’d be able to travel anywhere and find a faithful fan and that was lovely all on its own. What she didn’t want was to be rejected.\r\n\r\nNot by the casting agent, she’d practically been handed the job - a role that was perfectly suited to her tastes apparently. But rejection from the people who watched the film, audience members who she hadn’t known her whole life and grown to love her.\r\n\r\nShe takes her seat with confidence when asked, slipping into her own professional mode rather than showcase her fears for Tsubasa to see in case they thought she couldn’t handle the role. “Thank you for seeing me.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47536314, "type": "ic", "edited": "2018-01-11T05:58:12.924988", "format": null, "posted": "2018-01-11T05:58:12.924988", "text": "Tsubasa offers a nod to the other girl, one of her employees entering the room with a coil of rope.\r\n\r\n\"Absolutely. When I saw you, I knew you'd be perfect for the role I had in mind.\" She ushers the employee closer, the bulky man standing behind Totoko and making his presence known.\r\n\r\n\"I hope this won't be too much of an issue, but I want you to practice the role in front of me right now. One of my employees will tie you up, and then I'll help you practice your lines.\"\r\n\r\nThe employee holds out the rope in front of himself, not yet tying Totoko up until she gave her agreement."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47536393, "type": "ic", "edited": "2018-01-11T06:02:22.378453", "format": null, "posted": "2018-01-11T06:02:22.378453", "text": "Totoko’s face is briefly taken over by confusion.\r\n\r\nPracticing the role was one thing but she wasn’t aware that she’d actually have to be tied up for an impromptu rehearsal. The hesitance is shrugged off in moments however as she figures that she’s never actually been with a large film production and that this must be how the true professionals do it.\r\n\r\n“Of course.” She nods, turning her attention to the man and smiling cheerfully. “Go ahead.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47536632, "type": "ic", "edited": "2018-01-11T06:13:43.625017", "format": null, "posted": "2018-01-11T06:13:43.625017", "text": "The man starts to bind her, guiding her arms gently behind her back as he ties her up tight. Tsubasa watches with a neutral expression, but on the inside she's ecstatic to see how the events will play out.\r\n\r\n\"Thank you for understanding,\" she says, her eyes scanning over Totoko's body. The employee stays behind her, taking out a cloth in his pocket that he intends to use to gag her.\r\n\r\n\"On the count of three, you'll say your first line.\" Tsubasa begins to count, and once she reaches three, the employee stuffs the thick cloth into Totoko's mouth, effectively silencing her."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47536789, "type": "ic", "edited": "2018-01-11T06:20:08.136397", "format": null, "posted": "2018-01-11T06:20:08.136397", "text": "They really didn’t play around. Totoko shifts against the rope experimentally and finds no weakness in the expertly tied knots. Thankfully it isn’t too much with only her hands tied behind her back and it doesn’t take long before she adjusts to the position and sits up in her chair.\r\n\r\nWhen she’s gagged however, Totoko lets out a muffled shriek of surprise. She wasn’t supposed to be gagged until much later in the script. Looking between Tsubasa and the employee, she tries to communicate the mistake and waits for them to take out the gag so they can properly start."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537081, "type": "ic", "edited": "2018-01-11T06:33:51.368271", "format": null, "posted": "2018-01-11T06:33:51.368271", "text": "Tsubasa darkly chuckles as the employee pulls out another coil of rope, using it to tie Totoko's ankles together.\r\n\r\n\"I was wondering when you'd realize this whole thing was fishy,\" she reveals, pulling out a pair of scissors from her drawer. \"I'll be honest with you, Totoko-chan. This isn't a movie performance you're auditioning for. It's a porn gig. And you've already been approved.\"\r\n\r\nShe approaches Totoko with the scissors, cutting an opening in her shirt to reveal her breasts. Then the bra is cut off, Tsubasa starting to cut away her skirt, eyeing her panties before snipping them off."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47537180, "type": "ic", "edited": "2018-01-11T06:39:49.122497", "format": null, "posted": "2018-01-11T06:39:49.122497", "text": "Porn! She couldn’t be seen in a porn flick, it would completely ruin the image she’d so carefully built within the area. But her muffled protests go unheard and she flinches when the cool metal of the scissors makes contact with her skin.\r\n\r\nTears pool in the corners of her eyes as her clothes are cut away. It’s shameful the way she’s allowed to keep her shirt but her breasts are left hanging out as if they were supposed to be out on display."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537325, "type": "ic", "edited": "2018-01-11T06:49:40.679874", "format": null, "posted": "2018-01-11T06:49:40.679874", "text": "Tsubasa mockingly puts her hand to her face, moving her wrist to simulate crying.\r\n\r\n\"Aw, poor baby,\" she coos, putting the scissors on her desk. \"Your bondage is only going to get more strict from here on out.\"\r\n\r\nThe employee finishes tying her up, Tsubasa pulling out a latex mask and lots of pantyhose from her desk. Moving behind the newly trapped pet, she forces the mask over her head, two small holes adorning her face to allow her to breathe.\r\n\r\nExplanations are useless with Totoko practically deaf, so Tsubasa just settles for pinching her nipples to hear her muffled squeals."}]