[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47537460, "type": "ic", "edited": "2018-01-11T06:59:10.093664", "format": null, "posted": "2018-01-11T06:59:10.093664", "text": "Briefly, Totoko regains her composure - if only to look deeply offended that she’s being mocked by Tsubasa. There was no denying that the local idol was extremely prideful and couldn’t stand being made fun of. \r\n\r\nOf course, she barely has time afterwards to question ‘more strict bondage’ when the latex mask is forced over her head and she’s left blind and deaf to the outside world. Only making her more sensitive to touch that she doesn’t see coming when Tsubasa begins toying with her nipples and illicits sharps squeals of pain that can just barely be heard through the gag and skin tight latex."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537570, "type": "ic", "edited": "2018-01-11T07:08:25.612505", "format": null, "posted": "2018-01-11T07:08:25.612505", "text": "Tsubasa hums as she pinches and tugs at Totoko's nipples, her employee inching her body in the pantyhose legs first. Tsubasa helps him as her whole body is encased in the material, finishing it off by tying the opening at her head.\r\n\r\nBut Tsubasa isn't finished. She pulls out more pantyhose, putting it over Totoko's layer and tying that securely as well.\r\n\r\nSeveral minutes are spent putting pantyhose on Totoko, more and more layers covering her body. Once Tsubasa's finished, she inches her body in a latex sleeve with an opening at the breasts and pussy, cutting the pantyhose covering both of them to allow them to be on display.\r\n\r\nTsubasa starts to play with her breasts and nipples again, her employee nudging a finger in her folds."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47537681, "type": "ic", "edited": "2018-01-11T07:19:10.113574", "format": null, "posted": "2018-01-11T07:19:10.113574", "text": "Totoko moans weakly as her nipples are pinched and pulled into becoming erect, squirming in her seat. She could hardly believe that she’d been caught in such a trap - though it had been extremely well disguised as an actual movie and not porn.\r\n\r\nShe shifts a little as she’s put into the pantyhose, confused as it’s pulled up the length of her body and she’s unable to identify the thin material. This being repeated several times until she can no longer distinguish the layers from one another until she’s placed inside the thicker latex sleeve. \r\n\r\nOnce again she feels the scissors near her breasts and pussy and feels her breath hitch until they’re removed and she can actually feel the air on them again. So they’d been spared being encased in the multiple layers so they could be played with.\r\n\r\nWithin the sleeve, there’s no way she can struggle or move away from the hands groping at her breasts and nipples - and she starts to shiver when she feels a finger enter her pussy."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537762, "type": "ic", "edited": "2018-01-11T07:26:54.787484", "format": null, "posted": "2018-01-11T07:26:54.787484", "text": "Tsubasa enjoys Totoko's helpless form as she roughly gropes at her breasts, noticing her little shiver when the employee starts fingering her.\r\n\r\nShe tells the man to pull out a vibrator to use on her, and he obeys, pulling out a vibrating wand toy and nudging it in between Totoko's layers of pantyhose. He flicks it on, the toy springing to life full force as it vibrates against the helpless girl's pussy.\r\n\r\nTsubasa suggests leaving her alone in the room, but not before attaching clamps to her nipples and laying her out on her desk to squirm."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47537807, "type": "ic", "edited": "2018-01-11T07:32:45.709603", "format": null, "posted": "2018-01-11T07:32:45.709603", "text": "Only Totoko can feel the tears she starts to shed once the vibrator is applied to her pussy and the clamps put on her nipples. It’s almost the perfect combination of pleasure and pain and she can barely even tell when she’s lifted up on the desk and left alone when she’s locked in her own little world.\r\n\r\nIt’s exceutiating. The vibe is merciless as it buzzes away and it isn’t long before Totoko is leaking her own juices from cumming - spasming as she has several orgasms."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47544651, "type": "ic", "edited": "2018-01-11T21:55:36.511517", "format": null, "posted": "2018-01-11T21:54:31.559538", "text": "Tsubasa leaves the other woman on her desk for nearly two hours, watching some of the action from a security camera as it records her twitches from the vibrator.\r\n\r\nWhen she returns, several of her employees come along with her, catching an eyeful of the newly trapped star. Tsubasa goes to remove the vibrator, giving her clamps a few light tugs before nudging two fingers into her pussy.\r\n\r\n\"It's dripping wet...\" she chuckles, popping her fingers into her mouth to taste it. Totoko's juices are rather sweet, which pleases Tsubasa.\r\n\r\nWith help from her employees, she removes the latex sleeve, cutting open the several layers of pantyhose with scissors. Tsubasa takes off the latex mask, giggling at Totoko's tearful face.\r\n\r\n\"Maybe I should stuff your pretty panties in your mouth instead of that cloth,\" she thinks aloud as she removes the gag."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47545204, "type": "ooc", "edited": "2018-01-11T22:31:08.105599", "format": null, "posted": "2018-01-11T22:31:08.105599", "text": "(( i want to say something real quick if that's ok. If at all possible, could you try to tell me when you're going to be taking a break? if it's an unexpected event like an illness, that's okay, but I've had several RPs go silent when I've gotten really invested in them. the RPs we've been having recently are some of my favorites, it's so rare to find someone with the same kinks as me"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47546505, "type": "ooc", "edited": "2018-01-11T23:34:12.008307", "format": null, "posted": "2018-01-11T23:34:03.546696", "text": "(( I hope that doesn't come off as forceful or rude or anything"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47547987, "type": "ooc", "edited": "2018-01-12T00:49:11.074575", "format": null, "posted": "2018-01-12T00:49:11.074575", "text": "Oh yeah! Of course! \r\n\r\nI’m usually pretty good with keeping my partners up to date unless it’s a really sudden change."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47548021, "type": "ooc", "edited": "2018-01-12T00:50:54.305930", "format": null, "posted": "2018-01-12T00:50:54.305930", "text": "(( that's good to hear! thank you!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47548135, "type": "ic", "edited": "2018-01-12T00:55:59.923060", "format": null, "posted": "2018-01-12T00:55:59.923060", "text": "Totoko feels as though she’s being slowly broken. There’s no possible way for her to move or distance herself from the powerful vibrator and though she has no way of properly telling, it feels as though she’s been left alone for ages. \r\n\r\nIt’s almost a relief when the vibrator is replaced with fingers. At least it means that she hasn’t been left completely alone to suffer.\r\n\r\nShe’s almost delirious when she’s finally freed from the sleeve and pantyhose as well as the mask, arms still tied behind her back and clamps on her nipples, eyes glazed over before she comes back to her senses as the gag is finally removed.\r\n\r\n“Please let me go,” she cries. “Please.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47555609, "type": "ic", "edited": "2018-01-12T05:54:29.991964", "format": null, "posted": "2018-01-12T05:54:29.991964", "text": "Tsubasa completely ignores Totoko's cry to be released, instead thinking aloud for options to gag her.\r\n\r\n\"...Or perhaps I'll use a ring gag, so your drooling mouth can be wide open for any cocks. Or I could use that ball gag I bought the other day, that one was a cute pink color...\"\r\n\r\nShe tugs at one of the clamps as she talks, fingering Totoko with her free hand as her juices coat her index and middle fingers once she pulls out.\r\n\r\n\"Do you want a taste, Totoko-chan?\" She asks, although it's nothing more than a demand as she forces her fingers into her mouth anyway. \"Be gentle, now...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47555762, "type": "ic", "edited": "2018-01-12T06:01:32.741549", "format": null, "posted": "2018-01-12T06:01:32.741549", "text": "Totoko’s protests quickly turn into whimpers as she’s toyed with, biting the inside of her cheek to keep from moaning aloud. The vibrator truly had made her pussy more sensetive. \r\n\r\nThe tug to the clamp breaks her resolve as she cries out, allowing Tsubasa ample opportunity to put her fingers in her mouth. Trying to appease the woman, she begins to suck and lick gently."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47555919, "type": "ic", "edited": "2018-01-12T06:09:23.585817", "format": null, "posted": "2018-01-12T06:09:23.585817", "text": "Tsubasa smirks down at the submissive, letting her fingers linger in her mouth a while before pulling away.\r\n\r\n\"I could get addicted to the taste of you, Totoko-chan,\" she says, almost as if she's moaning. \"Such a good girl...\"\r\n\r\nShe leans down to give Totoko a deep kiss, hands cupping her cheeks as she does so. While she kisses her, an employee helps himself to fingering her, another toying with her nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47556069, "type": "ic", "edited": "2018-01-12T06:15:23.965740", "format": null, "posted": "2018-01-12T06:15:23.965740", "text": "Totoko feels completely overwhelmed by the attention. Still frazzled by the two hours spent with the vibrator, she knows that she’s most likely not acting herself. At least she hopes she’s not acting herself. Surely she doesn’t actually enjoy this kind of treatment?\r\n\r\nStill, she can’t help but return Tsubasa’s kiss, motivated by the fingers in her pussy and the hands groping her breasts and nipples."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556270, "type": "ic", "edited": "2018-01-12T06:26:37.893109", "format": null, "posted": "2018-01-12T06:26:37.893109", "text": "Tsubasa pulls away, a sadistic smile on her face as she stares into Totoko's eyes.\r\n\r\n\"Such soft lips... perfect for sucking cock. A ring gag it is, then.\"\r\n\r\nNavigating to her drawer, she pulls out a ring gag, lowering it into Totoko's mouth and lodging it inside. The employees continue to toy with her, the pulling at her nipples starting to get a lot rougher.\r\n\r\n\"After you help out my employees a bit, we'll start filming a clip to put on my website. The subscribers are going to adore you, sweetie. Aren't you excited? You're getting the attention you've always craved.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47556403, "type": "ic", "edited": "2018-01-12T06:33:33.790290", "format": null, "posted": "2018-01-12T06:33:33.790290", "text": "The statement is enough to bring Totoko back to her senses. Yes, she wanted attention as a famous idol, but certainly not like this! She lets out a sharp cry through the ring gag in frustration, clearly annoyed by the other woman’s comment.\r\n\r\nIt doesn’t help that she’s still being fingered that the angry sound turns into one of clear arousal even as her clamped nipples are so harshly played with. Even without the extremely restrictive bondage she’s helpless to do anything to stop them with her arms and ankles tied."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556516, "type": "ic", "edited": "2018-01-12T06:39:34.574088", "format": null, "posted": "2018-01-12T06:39:34.574088", "text": "Tsubasa laughs at Totoko's noises, adjusting her body so she's on her knees in front of the employees.\r\n\r\n\"Try not to make such a mess on my floor with your drool, sweetie.\" Tsubasa gives Totoko a kiss on the cheek as her workers line up in front of her, unzipping their pants and freeing their cocks.\r\n\r\nThe first in line grabs onto Totoko's pigtails, shoving her face forwards as he roughly fucks her throat, showing no mercy with his thrusting."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47556639, "type": "ic", "edited": "2018-01-12T06:46:27.111876", "format": null, "posted": "2018-01-12T06:46:27.111876", "text": "The idol struggles against the ropes once more as she’s positioned on the floor. With her arms tied behind her back, her breasts are pushed even more outward through the hole in her shirt, legs tucked underneath herself. \r\n\r\nShe watches Tsubasa walk away in confusion before the first man yanks on her pigtails. Totoko squeals as she’s harshly fucked, drool spilling down her chin as she’s left gagging with every thrust."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556782, "type": "ic", "edited": "2018-01-12T06:54:13.979283", "format": null, "posted": "2018-01-12T06:54:13.979283", "text": "The employee empties himself down Totoko's throat, yanking her pigtails back to force her to look up towards him. The next quickly replaces him, until eventually every employee cums, Totoko's face coated with their release.\r\n\r\nTsubasa shakes her head as she sees the pile of drool on the floor, returning with a large roll of tape and a blindfold.\r\n\r\n\"That's no good, Totoko-chan,\" she scolds, crouching down to meet her face. \"You've made such a mess... you need to be punished now.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47556838, "type": "ic", "edited": "2018-01-12T06:58:08.900971", "format": null, "posted": "2018-01-12T06:58:08.900971", "text": "Once more Totoko finds herself crying as she’s used by every man in the line, her hair and face a mess as they’re coated with cum whenever they pulled out and didn’t feel like making her swallow. Not that all of them followed suit. Plenty of cum has joined the drool spilling out of the gag.\r\n\r\n“Ahn Ahn!” She begs pitifully, tearfully looking between Tsubasa and the items in her hands."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557042, "type": "ic", "edited": "2018-01-12T07:08:57.226341", "format": null, "posted": "2018-01-12T07:08:57.226341", "text": "Tsubasa ignores the pathetic gargled pleas, wrapping up Totoko in several layers of tape despite them. Once she's satisfied, she puts the blindfold on, leaving Totoko an immobile, blind toy. Of course, her breasts and pussy are uncovered, leaving them on display for anyone to play with.\r\n\r\n\"I'll just play with these clamps while you think about what you've done.\" Tsubasa lays Totoko on her back, harshly yanking the weights as she stands up, the clamps tugging away at Totoko's poor nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557104, "type": "ic", "edited": "2018-01-12T07:13:13.669961", "format": null, "posted": "2018-01-12T07:13:13.669961", "text": "Totoko lets out another series of squeals as the clamps are tugged on, stretching her nipples up towards Tsubasa. Wrapped up once more, she can only squirm in an effort to get away but that only lends to pulling at the clamps even more."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557200, "type": "ic", "edited": "2018-01-12T07:22:34.333632", "format": null, "posted": "2018-01-12T07:22:34.333632", "text": "Once Tsubasa's satisfied, she stops tugging, giving Totoko a few ruffles of her hair.\r\n\r\n\"We're going to film the clip now, sweetie. And you're still going to be wrapped up like this as part of your punishment.\"\r\n\r\nShe stands Totoko up on her feet, taking off the blindfold so she can see in front of her. Two employees grab onto her clamps, tugging them to urge her forward.\r\n\r\n\"It's in the next room over, Totoko-chan. Come on, hop on over there.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557332, "type": "ic", "edited": "2018-01-12T07:34:36.977291", "format": null, "posted": "2018-01-12T07:34:36.977291", "text": "Totoko glares openly at Tsubasa when the woman finally stops pulling at her nipples and helps her to her feet now that she has her sight back. \r\n\r\nIt’s utterly humiliating to hop along behind the three of them, but lagging behind means her poor nipples being stretched even more by the employees holding onto the clamps."}]