[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557527, "type": "ic", "edited": "2018-01-12T07:49:42.462538", "format": null, "posted": "2018-01-12T07:49:42.462538", "text": "Tsubasa catches an eyeful of Totoko hopping along the ground, her breasts bouncing with each movement.\r\n\r\nWhen the group reaches the next room, a camera is visible in front of them, along with sex toys and pantyhose laid out on a table. A metal chair sits nearby, which the employees force Totoko into sitting on.\r\n\r\n\"This clip will be about thirty minutes long, where I'll be showing you off and playing with you. You'll be suspended in the air at one point, and wrapped up in more pantyhose. Then we'll finish it with one of my guards fucking your pussy.\r\n\r\n\"The cameras will start rolling soon, so feel free to put on a cute, helpless face. Our fans love that.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557595, "type": "ic", "edited": "2018-01-12T07:56:37.485224", "format": null, "posted": "2018-01-12T07:56:37.485224", "text": "Surely there wouldn’t be that many people watching this sort of program. Not when the participant was kidnapped and clearly distressed. Though Totoko reasons with herself that if the film really has that many people who watch it maybe someone that knew her would see it and know that she would never willingly take part in something so lewid. \r\n\r\nCraning her neck, she spots one of the cameras and lets her tears fall freely as she gargles helplessly through the ring gag, breasts covered in drool. She tries hard not to think about the itinerary of the video that Tsubasa has laid out, not wanting to dwell on the fact that the video will end with her being fucked."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557647, "type": "ic", "edited": "2018-01-12T08:03:21.502350", "format": null, "posted": "2018-01-12T08:03:21.502350", "text": "The cameras start to record the action soon after Tsubasa's warning, the dominant woman introducing the new captive to the audience.\r\n\r\n\"Hello, everyone. I have a new star that will be in our videos. Her name is Totoko and she's an innocent idol. But not for long.,. Let's see how well she can handle some of my toys.\"\r\n\r\nShe picks up a fairly large dildo from the table, shoving it into Totoko's mouth and thrusting.\r\n\r\n\"Look at all of that drool on her chest...\" Tsubasa says to the camera. \"Those nipples have been clamped for over two hours, folks. I don't know how she's been able to handle it.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557714, "type": "ic", "edited": "2018-01-12T08:10:04.280400", "format": null, "posted": "2018-01-12T08:10:04.280400", "text": "Totoko gags around the large dildo, no more prepared for its entrance than she had been for all the employees that had fucked her throat just before filming. \r\n\r\nTears are still streaming down her cheeks as she cries pathetically, breasts bouncing as she moves in the seat."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557848, "type": "ic", "edited": "2018-01-12T08:19:15.091198", "format": null, "posted": "2018-01-12T08:19:15.091198", "text": "Tsubasa continues her abuse as Totoko sobs around the dildo, tugging on one of the clamps teasingly.\r\n\r\n\"Aw, look at this helpless girl...\" she mocks, giving her breasts a few slaps. \"Even though she's crying and heavily bound, she's still putting on a show for all of you.\"\r\n\r\nTsubasa removes the dildo from her throat, drool pouring out from around the toy.\r\n\r\n\"What a mess... let's see how well her pussy can take the same toy.\"\r\n\r\nShe stands Totoko up, showing off her ass and pussy as she bends her over the table.\r\n\r\n\"Look at how wet she is... looks like she's secretly enjoying being exposed like this, aren't you, Totoko-chan?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557941, "type": "ic", "edited": "2018-01-12T08:26:31.173724", "format": null, "posted": "2018-01-12T08:26:31.173724", "text": "The idol coughs weakly as the dildo is removed from the gag, flinching as Tsubasa slaps her breasts and causes the clamps to jiggle around and cause the girl even more pain.\r\n\r\nBent over the table and forced to put pressure on her clamped nipples, Totoko gargles and begs through the ring gag as her ass and pussy are exposed to the camera."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557976, "type": "ic", "edited": "2018-01-12T08:32:55.498031", "format": null, "posted": "2018-01-12T08:32:55.498031", "text": "Tsubasa nudges the large toy inside Totoko's pussy, thrusting as furiously as possible and giving her a few smacks to the ass here and there.\r\n\r\n\"Did I mention that she's a virgin? We're going to witness Totoko getting fucked for the first time today!\" Tsubasa hypes up the event, even if she's unaware if Totoko is actually a virgin or not.\r\n\r\nShe removes the dildo after pounding for several minutes, placing the wet toy on the table.\r\n\r\n\"Look at how wet her pussy is...\" Tsubasa spreads it out with her fingers, the camera zooming in. \"Believe me when I say she tastes amazing.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47557992, "type": "ic", "edited": "2018-01-12T08:36:53.868794", "format": null, "posted": "2018-01-12T08:36:53.868794", "text": "Totoko pants heavily as Tsubasa fucks her with the dildo and smacks her ass. How on earth she could possibly know that she was a virgin was beyond her but it really sets in that this woman and her employees were going to ruin her. \r\n\r\nThe dildo is certainly the largest thing that her pussy has taken and there’s no denying that her pussy is wet when the juices running between her legs provide hard evidence."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47572394, "type": "ic", "edited": "2018-01-13T04:16:41.192853", "format": null, "posted": "2018-01-13T04:16:41.192853", "text": "Tsubasa gives Totoko another smack to her sore ass after her showcase, moving on to the next scene.\r\n\r\n\"Up next is Totoko's intensive bondage training. Being mummified in tape isn't extreme enough for this slut. She needs several more layers to be satisfied.\"\r\n\r\nTsubasa grabs onto a blindfold, placing it over Totoko's eyes before reaching for a layer of pantyhose. She forces the idol's body into it, along with several more layers afterwards.\r\n\r\nThe sadistic manager cuts an opening in the breasts and near the pussy, playing with her poor nipples once more.\r\n\r\n\"Suspension bondage is up next for our pretty new toy. What do you think, Totoko?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47572594, "type": "ic", "edited": "2018-01-13T04:24:21.873227", "format": null, "posted": "2018-01-13T04:24:21.873227", "text": "Totoko just wants to cry. To be continually humiliated in this fashion is too much for the poor girl when she can’t even defend herself. Once more she finds herself blindfolded and encased in several layers of pantyhose that even make squirming difficult.\r\n\r\nThe worst part is that she doesn’t even know how much time has passed. It feels like ages, but she knows that can’t be true when the manager said the clip would be thirty minutes long.\r\n\r\nAnd again she feels the cool air only on her breasts and pussy before Tsubasa begins tugging on her clamped nipples. Already they’re beginning to go numb with the pain of having been clamped for over two hours now.\r\n\r\nAt the question she can only drool through the gag and let out muffled pleas through the layers of pantyhose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47572839, "type": "ic", "edited": "2018-01-13T04:34:36.586350", "format": null, "posted": "2018-01-13T04:34:36.586350", "text": "Totoko's muffled pleas are ignored once more as Tsubasa begins to tie her up with rope, hoisting her up towards the ceiling and leaving her to hang around.\r\n\r\n\"Before Totoko gets fucked, we have a little surprise for her,\" Tsubasa says as she reaches for a vibe wand. \"We're going to leave Totoko with this for a few minutes, and then she'll get her very first fuck.\"\r\n\r\nShe nudges the vibrator inside the pantyhose and against her pussy, turning it on the highest setting.\r\n\r\n\"How do you feel, Totoko-chan? Tell the audience how good you feel.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47572920, "type": "ic", "edited": "2018-01-13T04:37:24.374336", "format": null, "posted": "2018-01-13T04:37:24.374336", "text": "Not again. Totoko doesn’t think she can hold on very long when she’s being teased by the vibrator on its highest setting again. Not with such a short period between the first time.\r\n\r\nAnd indeed it doesn’t take long before she’s moaning through the pantyhose, drool creating a damp patch even through all the layers."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47573114, "type": "ic", "edited": "2018-01-13T04:44:43.430803", "format": null, "posted": "2018-01-13T04:44:43.430803", "text": "\"Look at that mess she's making!\"\r\nTsubasa teases as she gives Totoko's breasts a slap. \"She's a very messy girl... even if she's a virgin, she's got the heart of a whore.\"\r\n\r\nTsubasa starts to push her body back and forth, letting it swing through the air.\r\n\r\n\"Let's watch her cum together, everyone. She'll be all nice and wet for her first time.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47573243, "type": "ic", "edited": "2018-01-13T04:50:58.712054", "format": null, "posted": "2018-01-13T04:50:58.712054", "text": "Totoko yelps in surprise as her body begins swinging back and forth, the noise turning into one of pain as the clamps mimic the motion themselves and tug on her nipples even more.\r\n\r\nIt isn’t long before she cums either, leaking juices and twitching in her suspension as another orgasm follows the first relatively quickly."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47573422, "type": "ic", "edited": "2018-01-13T04:58:29.772786", "format": null, "posted": "2018-01-13T04:58:29.772786", "text": "Following her second orgasm, Tsubasa turns off the vibrator, showing off the shine of Totoko's juices to the camera.\r\n\r\n\"Now, the moment you've been waiting for.\" She gives a wink to the camera, lowering Totoko to the ground and untying her. Still wrapped in her layers of tape and pantyhose, Totoko is helpless as Tsubasa bends her over the table, her dripping wet pussy on display once more.\r\n\r\nA naked man approaches her, one of the employees from earlier. A hungry look is in his eyes as he starts to inch his way inside her, pounding away as different cameras focus on the fucking and her covered face."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "B536DA", "show_edited": false, "id": 47573561, "type": "ic", "edited": "2018-01-13T05:05:33.097254", "format": null, "posted": "2018-01-13T05:05:33.097254", "text": "Totoko struggles as best she can once she’s lowered from the ceiling bust doesn’t achieve much before she’s bent over the table again.\r\n\r\nHer cries become much louder as the man starts to fuck her. She really had been a virgin and now she was losing her innocence in front of cameras that were broadcasting the entire scene."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47573791, "type": "ic", "edited": "2018-01-13T05:16:26.833877", "format": null, "posted": "2018-01-13T05:16:26.833877", "text": "The man cums before long, helped by Totoko's extremely wet pussy. He slowly pulls out, giving her ass a smack before leaving her a drooling, dripping mess.\r\n\r\n\"There you have it. An innocent idol, forced into intense bondage and fucked like crazy. She'll be in a lot more videos these upcoming weeks! We'll make sure she's drooling and dripping wet for you all next time!\"\r\n\r\nTsubasa blows a kiss to the camera before it shuts off, moving over to face Totoko. With scissors, she cuts off the pantyhose covering her head so she can see her expression clearly.\r\n\r\n\"You look so exhausted, Totoko-chan... you made such a mess drooling and cumming, too...\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48695799, "type": "ooc", "edited": "2018-03-12T03:45:54.085074", "format": null, "posted": "2018-03-12T03:45:54.085074", "text": "(( hi! are you the person I'm currently rp'ing with?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48696476, "type": "ooc", "edited": "2018-03-12T04:20:17.596537", "format": null, "posted": "2018-03-12T04:19:41.621216", "text": "(( I'm not mad or anything if you are! I'd be willing to do our unfinished RPs again, but if you don't feel like it, that's ok too. I was just worried something bad happened"}]