[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993375, "type": "ic", "edited": "2019-01-08T07:43:42.458076", "format": "raw", "posted": "2019-01-08T07:43:42.458046", "text": "Zoo Time!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993376, "type": "ooc", "edited": "2019-01-08T07:43:51.392169", "format": "raw", "posted": "2019-01-08T07:43:51.392169", "text": "(( here I am!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993389, "type": "ooc", "edited": "2019-01-08T07:44:55.010679", "format": "raw", "posted": "2019-01-08T07:44:55.010679", "text": "Neat! Do you want to start this one off while I work on the idol chat? I figure they could all be brought in as a group"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993395, "type": "ooc", "edited": "2019-01-08T07:45:14.671781", "format": "raw", "posted": "2019-01-08T07:45:14.671781", "text": "(( sure thing!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993493, "type": "ic", "edited": "2019-01-08T07:55:23.273326", "format": "raw", "posted": "2019-01-08T07:55:23.273326", "text": "Zoos were a popular attraction for the young and old alike. Exotic animals of all kinds could be found and preserved for generations, all confined in small enough spaces.\r\n\r\nThe idea of zoos for humans had never been tried before, at least until recently. With one recently opening up, many turned a blind eye to the fact that the subjects were kidnapped and experimented on to be more animal-like, forced to entertain visitors for the rest of their lives.\r\n\r\nAnd who should be the next subjects but the Matsuno sextuplets, along with their childhood friend Totoko.\r\n\r\nKidnapped as a group, the seven were all tied heavily and stripped naked, gagged with their own underwear and tape wrapped around their heads several times. Stuffed into bags, they were soon brought to the headquarters before being dumped out on the floor.\r\n\r\nFluffy bitchsuits line the walls, along with sex toys and scientific equipment. Men and women surround the seven, groping their bodies to inspect them throughly.\r\n\r\n\"These will be wonderful additions to the zoo,\" one of them says as he slaps Totoko's chest. \"We'll start the transformation as soon as possible.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993591, "type": "ic", "edited": "2019-01-08T08:02:51.891687", "format": "raw", "posted": "2019-01-08T08:02:51.891687", "text": "How things had gotten to this point, Totoko and the sextuplets didn’t know. They’d been having a nice time at the Matsuno household and before they knew it, the house had been broken into and they’d been stripped, gagged, and taken off to wherever they’d been dumped out.\r\n\r\nThey hadn’t even been properly bound aside from the layers of tape that blinded them to their surroundings. Granted, on the car ride over in the hot trunk the group of seven had passed out on route and were only just stirring upon their arrival. The room is quickly filled with questioning grunts through their gags and layers of tape.\r\n\r\nTotoko squeals when her chest is slapped, lifting her arms to cover herself and drawing her legs in. Her taped head looks around wildly, unable to pinpoint the men and women surrounding her and the sextuplets that were finding themselves in similar positions."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993623, "type": "ooc", "edited": "2019-01-08T08:05:31.851430", "format": "raw", "posted": "2019-01-08T08:05:31.851430", "text": "So I just noticed I missed the tied heavily part but also interesting image of just taped heads?"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993653, "type": "ooc", "edited": "2019-01-08T08:07:59.413440", "format": "raw", "posted": "2019-01-08T08:07:59.413440", "text": "(( it's cool, not a big deal!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993761, "type": "ic", "edited": "2019-01-08T08:17:52.222010", "format": "raw", "posted": "2019-01-08T08:17:52.222010", "text": "A few of the captors chuckle as Totoko squeals and panics, the man in charge of her continuing to roughly play with her chest. The men and women toying with the Matsus treat them roughly as well, pinching their nipples and slapping their chests.\r\n\r\n\"I'll bet you're all very confused,\" one woman says as she stands over them, each captor tying the captives' arms tightly behind their backs. \"I'll explain: starting today, you're all subjects at our human zoo. You'll stay here for the rest of your lives, entertaining guests and learning to live like animals. But first, we'll need to knock you out so we can perform surgeries on all of you. You'll become more animal-like, never being able to talk or act like humans again.\"\r\n\r\nOso's captor gets particularly handsy, gripping onto his dick and stroking it while kissing his neck.\r\n\r\n\"Enjoy your short time as humans while you can. Nobody will come to save you, I promise.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993835, "type": "ic", "edited": "2019-01-08T08:25:22.422376", "format": "raw", "posted": "2019-01-08T08:25:22.422376", "text": "Seven muffled series of grunts emanate from the group as their arms are tied behind their backs. The awkward positioning opens up each of their chests even more to being pinched and slapped now that they’re thrust forward. They can hardly believe what they’re hearing.\r\n\r\nLiving as animals for the rest of their lives? That was completely insane. They didn’t want to do that at all, but they didn’t have much of a choice now that they’re all helpless and vulnerable.\r\n\r\nOso hunches forward as his dick is played with, precum starting to leak from the tip as he groans through the tape.\r\n\r\nHelpless as they are, knocking them out for their respective surgeries would be easy."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993884, "type": "ic", "edited": "2019-01-08T08:30:43.767920", "format": "raw", "posted": "2019-01-08T08:30:43.767920", "text": "\"How about we start with the eldest brother first?\" The woman asks, taking note of his captor having a fun time groping him. \"We've done research on all of you, so we know everything.\"\r\n\r\nThe man playing with him complies, holding his nose to deprive him of air. With his underwear stuffed in his mouth, passing out would be inevitable.\r\n\r\n\"Just relax... it'll be painless, like falling asleep. Be a good boy and it'll be over soon.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53993926, "type": "ic", "edited": "2019-01-08T08:34:49.784091", "format": "raw", "posted": "2019-01-08T08:34:49.784091", "text": "Oso’s bound head lifts when he’s mentioned. So he’d be the first to lose his humanity to whatever these people were going to do to them. He shifts a little when his nose is covered, taking little time to figure out exactly how they were planning on knocking him out.\r\n\r\nHis younger brothers and childhood friend can only just make out the muffled sounds of thrashing, protesting to Oso’s treatment with gargled grunts. \r\n\r\nEventually Oso does pass out, but not before he cums on his stomach just as his body goes limp and he falls heavily into his captor’s arms."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53993985, "type": "ic", "edited": "2019-01-08T08:43:32.743811", "format": "raw", "posted": "2019-01-08T08:43:32.743811", "text": "\"What a disgusting pervert, cumming all over himself,\" the woman laughs as Oso's captor lifts him up, carrying him to the next room over for him to undergo surgery.\r\n\r\n\"He'll be back in a short while. But he'll be completely changed, unable to communicate with human language. In the meantime, I'll just watch the remaining six of you get abused and toyed with.\"\r\n\r\nKara's captor pinches his nipples, chuckling in his ear an ominous warning.\r\n\r\n\"You're next, Painfulmatsu.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 53994003, "type": "ic", "edited": "2019-01-08T08:46:51.778371", "format": "raw", "posted": "2019-01-08T08:46:51.778371", "text": "Kara whines at the warning. This had to be the worst situation that they’d found themselves in to date and there was absolutely nothing they could do to stop it.\r\n\r\nLike his older brother, Kara’s cock seems to respond to just his nipples being played with - back arching as his dick throbs almost painfully. And looking around the room would reveal that the majority of the Matsus and even Totoko were responding phenomenally to the rough treatment they were all receiving even if they didn’t want it."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54011393, "type": "ic", "edited": "2019-01-09T05:43:57.742315", "format": "raw", "posted": "2019-01-09T05:43:57.742315", "text": "The woman in charge doesn't do anything to stop the Matsu and Totoko abuse, watching with beaming eyes as they're molested and groped mercilessly.\r\n\r\nSeveral minutes pass before the captor returns with Oso, who no longer has his head bound and can see. However, he's worse off now, heavily bound in a fluffy, red panda-themed bitchsuit. Plastic ears decorate the top of his head, and a matching tail butt plug is lodged deep in his ass.\r\n\r\nThe remaining captives' tape is unwrapped around their eyes, allowing them to see Oso's transformation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54011563, "type": "ic", "edited": "2019-01-09T05:51:46.219332", "format": "raw", "posted": "2019-01-09T05:51:46.219332", "text": "Six sets of eyes widen in response to seeing Oso in his new form. He still seems a little groggy from whatever they’d done to him in surgery, eyes half-lidded and quiet as he’s set back onto the floor. He doesn’t move a long while, coming back to himself slowly as the others whine worriedly.\r\n\r\nKara seems the most unsettled, knowing that he’ll be next to receive the same treatment. He watches as Oso starts to pad forward on his elbows and knees, moving slowly and whining softly as the tail plug moved inside of him. \r\n\r\nSeeing his brothers and Totoko, he opens his mouth to speak but only a soft chirring noise comes out, rising in volume when he realizes that no actual words are being said."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54011729, "type": "ic", "edited": "2019-01-09T05:59:17.721146", "format": "raw", "posted": "2019-01-09T05:59:17.721146", "text": "The captors laugh as Oso's noises get louder, pleased to see that the surgery was a success.\r\n\r\n\"Perfect,\" the woman says as she approaches Oso's bound form. \"Hey there, little guy.\" She crouches in front of him and ruffles his hair. \"No need to be upset. You'll get along with the other red pandas in the habitat.\"\r\n\r\nA sadistic smile comes across her face as she grips onto his hair.\r\n\r\n\"I forgot to mention... with you being in different habitats, you may very well never see each other again. I hate to break up such a wonderful set of sextuplets, but we need new subjects in different parts of our zoo. I'm sure you understand.\"\r\n\r\nReleasing his hair, she gives a nod to Kara's captor, who plugs his nose as he jacks him off."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54011891, "type": "ic", "edited": "2019-01-09T06:06:36.840979", "format": "raw", "posted": "2019-01-09T06:06:36.840979", "text": "Oso produces more of the same, high-pitched sounds, cocking his head quizzically as he listens to the woman speak. Separated? That couldn’t happen. If this was going to be done to them, they couldn’t be apart from one another to fend for themselves without one another’s support.\r\n\r\nThe chirring turns into a pained yowl when his hair is pulled, craning his neck in an attempt to lessen the pain. \r\n\r\nHe shakes his head vehemently, followed by the other memebers in the group. They didn’t understand at all, this shouldn’t even be happening to them to begin with.\r\n\r\nKara follows in his brother’s footsteps, passing out as he cums so that he can be taken away for his own surgery."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54012036, "type": "ic", "edited": "2019-01-09T06:13:08.382342", "format": "raw", "posted": "2019-01-09T06:13:08.382342", "text": "Kara's captor moves him to the same room Oso was in, ready to begin transforming him into a helpless animal.\r\n\r\nChoro's treatment roughens as his captor leans in his ear, chuckling darkly before giving him his warning.\r\n\r\n\"I think you know just as well as I do that you're next.\"\r\n\r\nWith a pinch to his nipple, he begins sucking and nibbling on his neck, determined to get a rise out of him. The woman in charge of Ichi blows in his ear, whispering her own warning.\r\n\r\n\"Maybe I can squeeze you in, so you'll both get surgeries at the same time?\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54012231, "type": "ic", "edited": "2019-01-09T06:22:31.787244", "format": "raw", "posted": "2019-01-09T06:22:31.787244", "text": "Now that they’ve been unblinded, the remainder of the sextuplets and Totoko share similar expressions as they’re toyed with like dolls. Their eyes are wide-eyed and frightened as they glance at one another, grunting and moaning through their gags.\r\n\r\nIchi looks to his brother, a bit of hope rising in his chest as he listens to the woman. It was a small chance, but there was always the possibility that going into surgery at the same time would mean that they were...turned into the same animals.\r\n\r\nHe nods excitedly, knowing that there’s no hope to escape but at the very least he could try to stay with his brother.\r\n\r\nMeanwhile Choro writhes in his man’s arms, eyes fluttering when he starts to nibble on his neck as his cock rises to attention."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54012353, "type": "ic", "edited": "2019-01-09T06:29:30.873249", "format": "raw", "posted": "2019-01-09T06:29:30.873249", "text": "Minutes pass before Kara's captor returns, a thick latex sack in his arms. Inside the sack is the newly transformed Kara, whose head pokes out of one of the ends. In his mouth is a ring gag, which offers an easy look at his transformed tongue.\r\n\r\n\"He has increased flexibility to easily inch around,\" the man explains as he sets him down on the ground on his stomach. \"His habitat will be torture for him, very hot and even worse with that hot sack on.\"\r\n\r\n\"Show us what you can do, little snake. Inch around for us and show off.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54012490, "type": "ic", "edited": "2019-01-09T06:37:39.310450", "format": "raw", "posted": "2019-01-09T06:37:39.310450", "text": "The return of Kara is a lot more lively than Oso’s, the man returning with a hissing and twitching sack in his arms as Kara has already regained consciousness by the time he’s brought back into the room. Like Oso, his new vocalizations rise in volume in his panic of not being able to talk.\r\n\r\nHis new, modified tongue flicks out of the open gag - a few inches longer and ending in a fork to mimic the snake he’d been turned into. There’s even a cinched leather strap around his eyes added to the ensemble, likely mimicking the poor eyesight that most snakes had.\r\n\r\nUnlike Oso, his movements aren’t nearly as slow when he’s set back on the ground - he doesn’t get incredibly far but it’s impressive given his new lack of arms and legs."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54012610, "type": "ic", "edited": "2019-01-09T06:44:15.327996", "format": "raw", "posted": "2019-01-09T06:44:15.327996", "text": "The captors watch with awe as Kara blindly inches his way across the floor. Inside his ass, concealed by the sack, is a thick dildo with vibration settings, although it's currently turned off.\r\n\r\n\"How lovely,\" the woman says as she watches his slithering. \"Hopefully you'll get used to that leather around your eyes, since it's never coming off.\"\r\n\r\nChoro and Ichi are the next to receive air deprivation while they're stroked off. Choro's captor nibbles on his ear, while Ichi's captor bites his neck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54012717, "type": "ic", "edited": "2019-01-09T06:51:19.347995", "format": "raw", "posted": "2019-01-09T06:51:19.347995", "text": "Kara hisses, more in pain than him trying to get out more words that he can no longer speak, as he feels the dildo moving inside him. He doesn’t know it yet, but he would likely feel even worse once the vibrations went off. \r\n\r\nIchi is the first of his brothers to not cum as he passes out, gritting his teeth into his underwear gag the entire time as he tries to control himself. Choro isn’t lucky enough to share the same fate, joining Oso and Kara’s ranks.\r\n\r\nOso watches Kara as he blindly moves around the room, at one point loping forward the best he can manage in his new bitchsuit to prevent his brother from slithering headfirst into a wall. Through the gag, Kara’s tongue flicks in and out like an actual snake’s, too long to fit comfortably inside his mouth anymore as he drools."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54012823, "type": "ic", "edited": "2019-01-09T06:57:53.837974", "format": "raw", "posted": "2019-01-09T06:57:53.837974", "text": "Kara's captor fiddles with the vibrator's remote before turning it on, sending waves of pleasure to the drooling snake. Choro and Ichi are also carried out and into the surgery room, leaving only three more to receive surgery.\r\n\r\n\"Trying to help out your brother before saying goodbye for good?\" The woman laughs as she watches Oso moving towards him. \"What a good older brother you are...\"\r\n\r\nJyushi and Totty are the next tonreceibe rough treatment, both being told they'll be next in line to become animals."}]