[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54012899, "type": "ic", "edited": "2019-01-09T07:03:10.767385", "format": "raw", "posted": "2019-01-09T07:03:10.767385", "text": "Oso blinks in surprise, drawing back when his brother begins to let out a stuttering hiss of pleasure - unaware of the dildo in his ass that was different from the fluffy tail plug in his own. He chances a look at the woman in charge as she speaks, glaring a little when he feels like he’s being patronized.\r\n\r\nTotoko has a horrified look in her eyes as she watches Choro and Ichi be carted away, turning her head to look back at the two Matsunos that had already been transformed. She wants nothing more than to scream, the sound muffled by her own panties.\r\n\r\nJyushi and Totty are in the exact same predicament, chests heaving in panic when the rise in their rough treatment signals that their turn is coming up next."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": true, "id": 54012972, "type": "ic", "edited": "2019-01-09T07:14:22.259253", "format": "raw", "posted": "2019-01-09T07:09:04.318716", "text": "Totoko's captor slaps her chest and pinches her nipples as she screams through the panties in her mouth, chuckling darkly in her ear.\r\n\r\n\"Dumb sluts like you deserve to be in this zoo. I think you'll enjoy your transformation, even though you won't admit it.\"\r\n\r\nHe gives a sensual lick to her ear at the same time Choro and Ichi are brought out. Choro is suited up in a deer ensemble, fitted with antlers and a bitchsuit. Ichi is tied tightly with rope, forced into a crouching position and little mobility.\r\n\r\n\"See that?\" Totoko's captor laughs. \"You'll be just like them soon.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54013092, "type": "ic", "edited": "2019-01-09T07:20:04.156253", "format": "raw", "posted": "2019-01-09T07:20:04.156253", "text": "Totoko grunts, the pained sound turning into a pleasure moan as she cums, juices dripping between her legs just from the man pinching her nipples. It’s completely humiliating, and even worse as she sees Jyushi and Totty lose consciousness when the man and woman toying with them decide to knock them out. \r\n\r\nShe’d be next. \r\n\r\nChoro is acting a little oddly when he returns, eyes flitting about the room nervously as he stumbles around the room in his bitchsuit, the ends of his forcibly shortened limbs capping off in hoof shaped weights that kept him off balance like a newborn deer. It was likely that he could get used to it in time and crawl around normally, but as of now it was just clumsy.\r\n\r\nMeanwhile Ichi shivers slightly, not given the same minimal protection from the open air as his brothers as the tight ropes kept him in his own position. The only metal piece would appear to be two spreader bars clamped around his thighs and ankles to keep them in place and force him to waddle everywhere he wanted to go."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54013182, "type": "ic", "edited": "2019-01-09T07:29:18.706118", "format": "raw", "posted": "2019-01-09T07:29:18.706118", "text": "The group of captors laugh as Choro clumsily moves around on all fours, along with Ichi's humiliating waddling. Choro had been given drugs to make him skittish and nervous, while Ichi was forced to endure the cold air. Dildos are lodged in both their asses, each with a vibration setting.\r\n\r\n\"If you think this is cold, you're going to be in a world of hurt when you get brought to your habitat,\" Ichi's captor chuckles as she pinches his nipples.\r\n\r\nJyushi and Totty are brought to the surgery room, coming out some time later as new animals. Jyushi is a frog, tied in a crouching position with his long tongue sticking out through a ring gag. Totty is a sheep, on all fours in a fuzzy bitchsuit. A buttplug is shoved in his ass, while Jyushi's ass is unoccupied.\r\n\r\n\"You're next, slut,\" Totoko's captor snickers as he plugs up her nose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54013312, "type": "ic", "edited": "2019-01-09T07:40:15.549527", "format": "raw", "posted": "2019-01-09T07:40:15.549527", "text": "Totoko thrashes until she passes out, leaving the room full of the transformed Matsunos to wander about and become accustomed to their new bondage.\r\n\r\nKara is nudged along by Oso to the center of the room, guided as the only blinded brother where the others begin to gather to look over one another and try their best to say goodbyes. It takes Ichi a little longer to reach the middle, having to wait for his captor to let him go before he can join his brothers - waddling over and honking in pleasure when he can feel his dildo moving around in his ass.\r\n\r\nThey begin to nudge against one another gently, checking to make sure that they’re all okay. \r\n\r\nJyushi drools even more than Kara, unable to get his new tongue to fit inside his mouth anymore, hands tied tightly to his ankles so he can’t use them to aid in his movement. He turns his head, cocking it to the side when he notices that his is the only ass that isn’t plugged by a dildo and voicing it with a series of ribbits and croaks.\r\n\r\n“Baaa,” bleats out Totty, panting a little as the wool of his bitchsuit begins to make him a little too hot."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54468160, "type": "ic", "edited": "2019-02-02T07:02:38.717037", "format": "raw", "posted": "2019-02-02T07:02:38.717037", "text": "The zoo's employees watch as the Matsus wordlessly exchange their final goodbyes. A few snickers fill the room as Totty bleats and pants in his fuzzy bitchsuit, no sympathy from the entire group at the fact that the brothers will never see each other again.\r\n\r\n\"We'll let you say goodbye to Totoko when she comes out,\" the woman in charge announces as she watches the sextuplets huddle together. \"After that, we'll put you in your permanent habitats. Speaking of which... it seems Totoko is finished.\"\r\n\r\nThe door connecting the two rooms opens, the man carrying Totoko in a cow-themed bitchsuit. A collar with a cowbell is attached to her neck, and a tail buttplug is lodged in her ass. Her breasts have even gotten bigger to better suit her role as a cow.\r\n\r\n\"Do you want to say your goodbyes, slut?\" Totoko's captor asks as he places her on the floor."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54469884, "type": "ic", "edited": "2019-02-02T09:51:47.980657", "format": "raw", "posted": "2019-02-02T09:51:47.980657", "text": "Totoko has a pitiful, mournful expression as she’s carried into the room, followed by the soft clanging of the bell around her neck. She’s loathe to admit that she’s thankful for being carried - her larger breasts feel extremely sensitive as one of the few parts left uncovered by her spotted bitchsuit and would no doubt leave her new, larger nipples to drag on the floor. All eyes minus Kara’s are on Totoko, no doubt entranced by her larger breasts and Jyushi gives a low croak as he drools around his tongue.\r\n\r\nThis was it, they’d never see one another again after this moment if they were extremely unlucky. Tears fall freely down their cheeks, the room filling with sad animal noises from the sextuplets and long time friend. It’s broken up by hiccuping and low moans from the ones with vibrators currently working away in their asses.\r\n\r\n“Mooooo,” Totoko groans, throat unable to work out the human words as her fate has been sealed along with the six brothers.\r\n\r\nAs soon as they were taken out the door their new lives as animals would truly begin."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54527200, "type": "ic", "edited": "2019-02-05T06:23:53.525565", "format": "raw", "posted": "2019-02-05T06:23:53.525565", "text": "After the group says their tearful goodbyes, the zoo employees assigned to each captive pick them up or tug them out the door, leading them to their new habitats where they would stay forever.\r\n\r\nFirst, Oso is lead to a wide-ranged forest habitat, placed gently on his elbows and knees. Nearby are several other captives taking on the roles of red pandas, who toddle towards Oso to get a closer look at the newest toy. They all make soft chirring sounds as they stare at him, a few tilting their heads in curiosity.\r\n\r\n\"Meet your new friends, Osomatsu,\" his captor whispers in his ear. \"You'll be just as broken as them one day.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54527270, "type": "ic", "edited": "2019-02-05T06:27:12.146877", "format": "raw", "posted": "2019-02-05T06:27:12.146877", "text": "Oso clicks in a panic as he’s torn away from his brothers and Totoko, far too easily carried to his new and permanent home in the forest exhibit. \r\n\r\nThe amount of other red pandas in the enclosure is absolutely terrifying and more tears fall from his cheeks as the zoo keeper whispers in his ear. He couldn’t end up like them! He just wanted to go home!\r\n\r\nOso shrinks back from the ones trying to inspect him, nervous that he’s the smallest of the bunch."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54527480, "type": "ic", "edited": "2019-02-05T06:35:57.371023", "format": "raw", "posted": "2019-02-05T06:35:57.371023", "text": "\"Aw, you seem scared,\" Oso's captor snickers as he removes the buttplug from his ass. \"How about you and your new friends have a little bit of fun together? It'll help relieve your stress.\"\r\n\r\nGrabbing onto a bottle of lube in a container nearby, he lubricates each red panda up as they line up, excited noises filling the enclosure as they wait to stuff Oso's ass.\r\n\r\nThe first red panda takes his turn with help from the captor as he thrusts inside Oso, pleasured sounds coming out from his mouth as he violates him. He eventually climaxes, pulling out and covering his ass with cum.\r\n\r\nThen the next lines up, no breaks for Oso as he's humiliated by each red panda."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54527601, "type": "ic", "edited": "2019-02-05T06:41:21.891074", "format": "raw", "posted": "2019-02-05T06:41:21.891074", "text": "Oso can’t move away from his captor fast enough to not end up with his tail plug being taken out. And it didn’t take a genius to note that he was the only red panda in the forest exhibit to not have an opening for his cock. That and there didn’t seem to be any red pandas that were decidedly female. All these men had likely been turned like him and left for their sexual frustrations to build.\r\n\r\nAnd now Oso was on the receiving end of being the only red panda with an open hole ready for the taking now that his tail was pulled out. No wonder they lined up so quickly.\r\n\r\nHis chirring turns into stuttered panting as he’s fucked repeatedly by each of his new kind, humped and cummed inside like an animal."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54527751, "type": "ic", "edited": "2019-02-05T06:50:01.887119", "format": "raw", "posted": "2019-02-05T06:50:01.887119", "text": "While Oso is violated by the sexually frustrated red pandas, Kara is in a torturous spot of his own as he's carried into a large, heated tank. One other snake shares the space with him, put in bondage identical to Kara. Quiet hisses and whines come out from him as he slowly slithers on the floor, sweat glistening and falling from his chin.\r\n\r\n\"It'll only get hotter, Painfulmatsu,\" his captor whispers in his ear. \"And you're gonna be in this heat for the rest of your life.\"\r\n\r\nWith these words, he leaves the tank, waking up a sweat of his own before fully exiting."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54527832, "type": "ic", "edited": "2019-02-05T06:53:48.626115", "format": "raw", "posted": "2019-02-05T06:53:48.626115", "text": "The rush of hot air on his face when the door to the tank is opened makes Kara flinch and hiss in discomfort. Hearing almost identical hissing in return was unnerving but unlike Oso he wouldn’t have to worry about the other “snake” fucking him if they were in the same bondage with vibrators buzzing mercilessly in their asses.\r\n\r\nHe’s already sweating when he just barely makes out the sound of the door clicking shut again and he’s left alone with the other snake - tongue flicking out as he slithers on the ground to explore his new home and trying to hiss an apology when he bumps into the second snake."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54528284, "type": "ic", "edited": "2019-02-05T07:19:12.209024", "format": "raw", "posted": "2019-02-05T07:19:12.209024", "text": "Choro is the next captive to be brought to his new habitat - a large field to roam around in. A few deer already occupy the area, but the second they see Choro they flinch and scamper off.\r\n\r\n\"I'll feed you that special meal again in a few hours,\" the captor says as he ruffles his hair. \"Gotta make sure you're acting like a cute and proper deer.\"\r\n\r\nHe sets him off, watching him and the other deer roam about."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54528400, "type": "ic", "edited": "2019-02-05T07:27:00.145843", "format": "raw", "posted": "2019-02-05T07:27:00.145843", "text": "Choro fidgets and squirms the whole time it takes for him to be carried to the habitat. It would be fair to say that he was the one that got the short straw when it came to their transformations. The drugs made it to where he barely knew what was going on, he just knew that his arms and legs felt weird, there was something in his ass, and he was beyond terrified.\r\n\r\nEven seeing the other deer just causes him to tense up until they run away - most likely in the same drugged haze he was in. There’s a scared chuffing noise that leaves him when the keeper ruffles his hair and he pulls himself away. He was likely the only one who could get away with such behavior in his altered state of mind. \r\n\r\nHe doesn’t bother to stick around, moving as quickly and as clumsily as he can to find someplace that he felt safe to hide in. And he does in a patch of tall grass that he immediately spreads himself out in, peering out occasionally to look for any threats."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54543478, "type": "ic", "edited": "2019-02-06T05:30:11.642207", "format": "raw", "posted": "2019-02-06T05:30:11.642207", "text": "Ichi is brought into an extreme habitat, the polar opposite of Kara's confined space. Instead of sweltering heat, Ichi is forced to suffer in the freezing cold. Water surrounds him on a platform, one of the kidnapped penguins swimmimg around just like the actual animal.\r\n\r\n\"Feel free to go for a dive if you like,\" the captor says with a grin. \"In a little bit I'll be training you so you'll be swimming like a proper penguin.\"\r\n\r\nShe pinches his nipples and bites his earlobe before leaving the habitat to observe it. One penguin eyes Ichi curiously, waddling over to him to get a closer look."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54543640, "type": "ic", "edited": "2019-02-06T05:39:57.991855", "format": "raw", "posted": "2019-02-06T05:39:57.991855", "text": "Ichi sets to shivering the moment they’re inside the habitat, nipples hard in the cold air. He turns his head from side to side to inspect his new home, flapping his tied together arms in a small panic - although it mainly looks like he’s flapping his flippers.\r\n\r\nThey expect him to get in the water? It looked even colder than the room itself! And how could he possibly swim like this? He sees the other penguins doing so with some difficultly, likely still becoming accustomed to their own transformations as well. \r\n\r\n“Honk honk!” He calls out, waddling on the platform and looking nervously at the water before another spasm runs through him - this time caused by the dildo still vibrating in his ass that causes him to cum. He pants a little, glancing at the approaching penguin."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54543805, "type": "ic", "edited": "2019-02-06T05:49:50.310215", "format": "raw", "posted": "2019-02-06T05:49:50.310215", "text": "The other penguin tilts his head as he reaches Ichi, eyes aimed at his cock as it shoots out cum into the water. He huddles close to Ichi, nuzzling his head into the crook of his neck as he tries to move his \"flippers\" to hug him. Another penguin reaches Ichi on the other side, mirroring the penguin's motions as they try to warm up.\r\n\r\nWarming up isn't the only reason they're near Ichi - evident when each penguin starts to suck and nibble his neck. They honk in pleasure as they rub against him, sandwiching and trapping him in a vulnerable state before finally cumming on him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54543883, "type": "ic", "edited": "2019-02-06T05:54:14.216814", "format": "raw", "posted": "2019-02-06T05:54:14.216814", "text": "Ichi tenses at first, nervous of these strangers that shared the same fate that he did. But when nothing happens, he allows himself to relax a little. They were in just as miserable and cold as he was.\r\n\r\nTears prick the corners of his eyes, touched that the penguins in the exhibit tried to warm one another up. And he’s able to enjoy it for a little bit until they start to nibble on his neck and thrust up against him, then he honks in displeasure and tries to push them away until they end up cumming on him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54544059, "type": "ic", "edited": "2019-02-06T06:03:50.265534", "format": "raw", "posted": "2019-02-06T06:03:50.265534", "text": "As Ichi is forced to endure the other penguins molesting him, Jyushi has to deal with his own habitat. He's placed inside an area with a large body of water, lily pads and flowers decorating the surface. On a rock, it's not long before his captor nudges him towards a lily pad, trying to get him to jump on one.\r\n\r\nTwo other frogs are present, curious croaks and ribbits filling the area. One stutters out his sounds, and it isn't hard to see why - a vibrator is shoved up his ass.\r\n\r\n\"You better behave, or you'll end up with that same punishment,\" Jyushi's captor warns as he gives him a harsh push towards the pad."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54544142, "type": "ic", "edited": "2019-02-06T06:09:56.360167", "format": "raw", "posted": "2019-02-06T06:09:56.360167", "text": "Jyushi is a panting mess by the time he and his keeper reach the marshy habitat, having been made to hop the entire way from the clinic to the enclosure in his new bondage. It was a lot of hard work not to fall over and also make sure that his new tongue wasn’t in the way.\r\n\r\nDrool drips out of the gag and onto his chin as he surveys the habitat with an anxious sort of curiosity. He really doesn’t want to jump onto the lily pad, afraid that it wouldn’t hold his weight above the water but after a look at one of his fellow frogs...resisting what the keeper wants doesn’t look so appealing.\r\n\r\nHe gives a throaty croak before hopping onto the pad, stumbling on the balls of his feet when he’s pushed and missing entirely to land in the murky water. Flailing and kicking, his movements do rather resemble an actual frog as he’s mostly forced to rely on his legs."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54580905, "type": "ic", "edited": "2019-02-08T07:37:01.807295", "format": "raw", "posted": "2019-02-08T07:37:01.807295", "text": "Totty and Totoko are the only new captives placed in the same general area - a petting zoo. Goats, sheep, and cows are only a few of the many types of animals around, each group separated by fences.\r\n\r\nTotty gets a few gentle strokes on his fuzzy bitchsuit by his handler, while Totoko is still under the supervision of the cruel man that performed the surgery on her. He even gives her nipples a harsh pinch before fiddling with a milking machine, carefully placing the new cow on her back before attaching the milking tubes to her nipples.\r\n\r\n\"You gotta be milked a few times a day,\" he explains as he turns the machine on. \"Otherwise you'll be in quite a bit of discomfort.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54581633, "type": "ic", "edited": "2019-02-08T09:00:02.321097", "format": "raw", "posted": "2019-02-08T09:00:02.321097", "text": "Totty is practically in love with the gentle treatment he was receiving dispite his situation. But it didn’t take a genius to see that he’d gotten off easy in comparison to his brothers. Being an animal that was commonly seen in petting zoos meant that he’d be getting more attention and wouldn’t be forced into humiliating positions like Ichi and Jyushi had been. The wool suit is hot and makes him sweat, but Totty can work past that once he’s in the enclosure.\r\n\r\nThe fans surrounding the habitat are obviously for zoo goers and not the animals themselves, but they provide a pleasant enough breeze to take some of the edge off the animals. Once his handler stops petting him, Totty starts to mill about with the other animals in his pen before he ends up at the fence separating the sheep from the cows - and him from Totoko.\r\n\r\nThey were definitely the closest of the group put together, Totty can hear her frantic mooing as her captor works on her. But the horizontal fence post blocks his view of what’s going on.\r\n\r\nTotoko’s moos are as close as she can get to squealing in discomfort as she can get. She sees several other cows in the enclosure and about half are on their backs like she is getting milked. She flails her limbs unhappily as the machine’s set up, not wanting to be milked in her new form."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54851312, "type": "ic", "edited": "2019-02-24T05:53:49.363027", "format": "raw", "posted": "2019-02-24T05:53:49.363027", "text": "The cruel man gives Totoko a slap to the face as she moos in discomfort, snickering as the machine starts up and begins to suck at her nipples. Milk comes out some minutes later, filling up a container connected to the machine.\r\n\r\n\"Fucking dumb cow slut,\" he snarls as she continues getting milked. \"How about I shove my cock down your throat to get you to shut up? You'd like that, wouldn't you?\"\r\n\r\nAfter a few minutes, the man shoves a dildo down Totoko's throat, stuffing her mouth and effectively gagging her. On the other end of the dildo is a tube connected to the container of Totoko's milk, which begins emptying itself and feeding her her own milk."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 54853115, "type": "ic", "edited": "2019-02-24T07:54:23.889318", "format": "raw", "posted": "2019-02-24T07:54:23.889318", "text": "Totoko sniffles, tears welling up in her eyes when she’s slapped. It wasn’t like she asked to be like this! In fact, she hates her new form more than anything else. Her breasts are too large for her petit frame and she hates the tail plug in her ass - but she doesn’t have to focus on that sensation for long when the milker starts to suck on her nipples and her eyes widen when she sees that she’s been made to actually produce milk.\r\n\r\nShe gags around the gag, mooing pitifully around the fake cock and snorting around the large nose ring she’d been giving to rest on her upper lip. The bell around her neck rings mockingly at her when she moves and the new ear piercing flops from side to side as well labeling Totoko as “Cow Slut #10”.\r\n\r\nAnd she’s really in for a shock once her own milk starts to be pumped down her throat. She doesn’t even have the option to try and spit it out, instead swallowing as quickly as she can before she chokes."}]