[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55563923, "type": "ic", "edited": "2019-04-06T05:07:51.435305", "format": "raw", "posted": "2019-04-06T05:07:51.435305", "text": "The sadistic handler laughs as Totoko chokes on her own milk. When he's satisfied after several minutes, he pulls out the dildo and turns off the machine, giving her a breasts a harsh slap after taking off the nipple tubes.\r\n\r\n\"Your identity as a human is no more,\" he chuckles as he points to her piercing. \"You don't even have a name. You're just a useless cow slut, existing to suffer for my amusement.\"\r\n\r\nHe pinches her nipples, yanking them upward for a few seconds before releasing.\r\n\r\n\"I'll be keeping a close eye on you, cow slut,\" he says as he places her on her knees and elbows."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715CD", "show_edited": false, "id": 55564043, "type": "ic", "edited": "2019-04-06T05:15:15.818405", "format": "raw", "posted": "2019-04-06T05:15:15.818405", "text": "Totoko’s tears dry up, needing to focus on drinking her milk rather than sobbing. She gasps when the dildo and milking machine is finally taken off, catching her breath and crying out when he slaps her again.\r\n\r\nHer nipples squirt fresh milk when he pinches and pulls them, making poor Totoko cry again with stuttered mooing. \r\n\r\nShe wobbles when she’s placed on her knees and elbows again, dribbling milk now that she’s started to produce - looking dolefully up at her keeper with big, teary eyes."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55564167, "type": "ic", "edited": "2019-04-06T05:24:09.085345", "format": "raw", "posted": "2019-04-06T05:24:09.085345", "text": "The keeper pays no mind to Totoko as he turns to leave, giving her one last look.\r\n\r\n\"The zoo is closing for the night in a few hours,\" he explains. \"Tomorrow morning will start with you being milked, so be ready.\"\r\n\r\nWhen it's time for the zoo to close, some of the animals are locked up, while others get to roam about freely. Oso's handler finally plugs his ass again after being used as a fuckable hole for the whole day, while the other red pandas' cocks are sealed away for the night.\r\n\r\n\"Don't expect to cum for at least a month,\" he laughs. \"These guys have been in chastity for at least three.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "0715cd", "show_edited": true, "id": 55564346, "type": "ic", "edited": "2019-05-24T06:32:52.344312", "format": "raw", "posted": "2019-04-06T05:39:18.195424", "text": "Oso is a mess by the time the last red pandas are finally pulled off him. At some point one of his fellow pandas had come to the conclusion that Oso’s mouth was just as good as fucking his ass and it didn’t take long before two lines formed and he was taken in the front and back. \r\n\r\nHe’s almost grateful when the handler puts the plug back into his ass, chittering gratefully the best way he knows how.\r\n\r\nKara isn’t much better off, too exhausted to move after exploring the heated tank. He’d collapsed over the second snake a couple hours earlier, dozing off and hissing out quiet snores."}]