[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55651495, "type": "ic", "edited": "2019-04-11T05:54:42.535696", "format": "raw", "posted": "2019-04-11T05:54:42.535696", "text": "The man smirks as Kara sticks out his tongue, pleased that he's acting obedient. When he's done, he sticks his fingers in his mouth, pressing down on his tongue to humiliate him.\r\n\r\n\"Such a slut,\" he laughs as he gives him a slap on his other cheek. \"I'll be back in line in a bit.\"\r\n\r\nThe night goes on, more men using and abusing Kara's throat. The ghost keeping Kara bound plans to keep him there for several hours, having a blast seeing him humiliated.\r\n\r\nWhen it's finally over, nobody is in the bathroom except the cum-covered Kara. That is, until the door opens, and the man who threatened to be back in line shows up."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55651538, "type": "ic", "edited": "2019-04-11T06:00:25.465297", "format": "raw", "posted": "2019-04-11T06:00:25.465297", "text": "Kara retches around the fingers, jerking his head as much as the invisible bonds will allow to try and dislodge the man’s fingers from his open mouth.\r\n\r\nThe tears start up almost an hour in, as Kara works himself up. He has no idea why he can’t bring himself to get up or close his mouth, but the results are horrifying.\r\n\r\nJust when he thinks he’s alone, dribbling cum and saliva onto the bathroom floor with his head bobbing against his chest, Kara looks up to see the man from earlier and cringes. He’s in an even worse state that before. At some point someone had pulled his shirt over his head to bare his chest - leaving it and his jacket still on, while someone else had unzipped his pants and pulled down his boxers just enough to pull his cock out."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55651621, "type": "ic", "edited": "2019-04-11T06:08:40.201802", "format": "raw", "posted": "2019-04-11T06:08:40.201802", "text": "The man takes a few pictures on his phone, getting different shots from different angles. When he's done, he squats down to meet his face, giving his nipple a pinch.\r\n\r\n\"Damn, you look like a proper slut,\" he snickers. \"Why don't you say we get out of here? I could use a sex doll like you to add to my collection of toys.\"\r\n\r\nThe ghost keeps his bindings tight, forming an invisible harness around Kara's head that connects to his wrist bindings and pulls his head back painfully far."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55651645, "type": "ic", "edited": "2019-04-11T06:11:56.953143", "format": "raw", "posted": "2019-04-11T06:11:56.953143", "text": "Oh god. Kara can feel his head moving of seemingly its own accord. He can feel the straps of the harness pulling him back, but has already pieces together that no one else that’s been in the bathroom so far can see his restraints.\r\n\r\nThe thing he’s really afraid of it that the movement looks like a nod to the man’s question. This scene in the bathroom was bad enough. He couldn’t possibly go home with the man!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55651696, "type": "ic", "edited": "2019-04-11T06:17:47.589283", "format": "raw", "posted": "2019-04-11T06:17:47.589283", "text": "The man smirks, shoving two fingers into Kara's open mouth.\r\n\r\n\"I was hoping you'd agree,\" he says as he pulls away. When he lifts him up, Kara's bindings change. The ghost wraps him up like a mummy, arms pressed firmly to his sides and limbs altogether unable to move. His mouth is still forced open, but an invisible object fills his mouth, thick and long enough that it tickles the back of his throat.\r\n\r\nThe man carries him out like a bride, shoving him into his car and driving off into the night."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55651737, "type": "ic", "edited": "2019-04-11T06:21:46.896271", "format": "raw", "posted": "2019-04-11T06:21:46.896271", "text": "Another retch. Did he really have to keep doing that?\r\n\r\nKara panics a little. The fraction of a second where he feels free enough to make an escape isn’t long enough to make a break for it when the man has already picked him up. And he has to give up when he feels a different set of restraints, completely unable to move except to look out of the corners of his eyes.\r\n\r\nHe gags as he’s carried, feeling the presence of...something in the back of his throat. \r\n\r\nHe’s too stiff to be put anywhere but laid into the backseat, specially on the floor so he couldn’t be seen or even see where he was going to end up for the foreseeable future."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55651809, "type": "ic", "edited": "2019-04-11T06:30:25.203963", "format": "raw", "posted": "2019-04-11T06:30:25.203963", "text": "When the man reaches his apartment, he carries the immobile Kara up to his door and all the way up to his bedroom. He throws him on the mattress, the bindings loosening enough to allow him to feebly squirm if he wished.\r\n\r\n\"Now we're all alone,\" the man whispers as he climbs on top of him, the faint smell of alcohol right in his face. \"You look even better in my bed... so helpless and vulnerable.\"\r\n\r\nHe gives his nipples a pinch as the ghost extends the invisible dildo further down Kara's throat. Then the man undresses, throwing his clothes on the bedroom floor before kissing Kara's neck."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55651843, "type": "ic", "edited": "2019-04-11T06:35:15.208762", "format": "raw", "posted": "2019-04-11T06:35:15.208762", "text": "This was somehow more terrifying than being used by several men in the bathroom. At least the bar was a public place - if Kara had been luckier, someone could have come along and put an end to the whole incident. Here, he’d be lucky if he ever escaped the man’s apartment with whatever force that was intent on seeing him suffer.\r\n\r\nHe cringes at the smell of the man’s breath, gagging on the invisible dildo sliding even further down his throat. \r\n\r\nIt feels strange to still be partially dressed while the other man is naked on top of him. He actually feels worse this way. Like a half dressed doll that someone decided to discard halfway through."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55698121, "type": "ic", "edited": "2019-04-14T04:17:36.470427", "format": "raw", "posted": "2019-04-14T04:17:36.470427", "text": "The man places more kisses along Kara's neck, chapped lips brushing against his skin as he trails downward. His tongue flicks over Kara's nipple, taking the bud between his teeth and giving it a soft bite. More kisses pepper his chest, stomach, until the man eventually reaches his cock.\r\n\r\n\"Are you gonna be my little fuck doll?\" He asks, giving him a gentle kiss to the base of his dick. \"Gonna look pretty for me and listen to me like a good boy?\"\r\n\r\nHis tongue runs along the shaft before circling around the head, planting a few kisses afterwards.\r\n\r\n\"Tell me, boy. Tell me how much you want to be mine.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55720128, "type": "ic", "edited": "2019-04-15T06:21:06.262835", "format": "raw", "posted": "2019-04-15T06:21:06.262835", "text": "Kara uses what little wiggle room he has to its full extent, unable to distance himself from the drunk man now that he’s on top of him. The entire situation is awful, ruining what he’d initially thought was going to be an okay night. The only real thing going for him is that he can’t bring himself to answer the man’s question no matter how hard he tries.\r\n\r\nHe strains even more when the man kissed the tip of his cock, surprised by the jolt of pleasure that courses through him. No! He wasn’t going to be like that. \r\n\r\nStill, he doesn’t respond."}]