[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50843452, "type": "ic", "edited": "2018-07-07T22:05:16.391551", "format": "raw", "posted": "2018-07-07T22:05:16.391534", "text": "Hi! I was roleplaying super kinky stuff with you a while back and you kinda... disappeared. Are you alright? I'd be more than willing to start that up again!\r\n\r\nOur RPs included:\r\n• Totoko as a porn star\r\n• Karamatsu as a magician's assistant\r\n• Musical AU where Karamatsu becomes a pet to a group of his classmates"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50843462, "type": "ooc", "edited": "2018-07-07T22:05:42.261210", "format": "raw", "posted": "2018-07-07T22:05:42.261210", "text": "Are there any more of our old RPs that you want to revitalize?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50848594, "type": "ooc", "edited": "2018-07-08T03:24:26.043822", "format": "raw", "posted": "2018-07-08T03:24:26.043822", "text": "(( I was thinking the Totoko one or the baseball Jyushi one"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50848624, "type": "ooc", "edited": "2018-07-08T03:25:58.875652", "format": "raw", "posted": "2018-07-08T03:25:58.875652", "text": "Oh jeez...those were both really fun it’s kind of hard to choose"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50848789, "type": "ooc", "edited": "2018-07-08T03:32:40.417234", "format": "raw", "posted": "2018-07-08T03:32:40.417234", "text": "(( how about the Totoko one? we can continue the Jyushi one another time"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50848997, "type": "ooc", "edited": "2018-07-08T03:41:37.844223", "format": "raw", "posted": "2018-07-08T03:41:37.844223", "text": "Sounds great!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50849316, "type": "ooc", "edited": "2018-07-08T03:54:57.577127", "format": "raw", "posted": "2018-07-08T03:54:57.577127", "text": "(( sure! I have the previous chat available, along with the last message I sent, so you'll know where we are."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 50849359, "type": "ooc", "edited": "2018-07-08T03:56:48.079076", "format": "raw", "posted": "2018-07-08T03:56:48.079076", "text": "Great! I’ll start reading up once I get the link so I can catch up"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": true, "id": 50849389, "type": "ooc", "edited": "2018-07-08T04:14:32.636483", "format": "raw", "posted": "2018-07-08T03:58:05.877527", "text": "https://www.cherubplay.co.uk/chats/63e26a5d-ef93-45f8-b188-351efe9bb0a6/"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 50849939, "type": "ic", "edited": "2018-07-08T04:22:31.333190", "format": "raw", "posted": "2018-07-08T04:22:31.333190", "text": "Nyaa whines, keening and squirming with pleasure in her own bitchsuit. So far her experience has been pleasurable - she knew how to manipulate an audience in her favor and this wasn’t any different. A perfect pleasure kitten.\r\n\r\nAll she had to do was make sure Totoko lost this little bet and then she’d be able to watch whatever torment counted as punishment in this hellhole."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50887979, "type": "ic", "edited": "2018-07-10T04:53:14.873564", "format": "raw", "posted": "2018-07-10T04:53:14.873564", "text": "Tsubasa smirks as Nyaa whines with pleasure, unzipping the zipper covering her breasts and giving her nipples a harsh pinch. Once she's certain she's wet enough, Tsubasa turns off the vibrator inside her, taking it out as her juices coat the toy.\r\n\r\n\"I'm sure you all remember our lovely new star Totoko!\" Tsubasa beams, giving Nyaa's hair a quick ruffle. \"She's going to be in this video as well! Be prepared for some lesbian idol action, because these two are going to go at each other like horny sluts! Whoever cums first will be punished!\"\r\n\r\nShe walks off to retrieve Totoko, placing her on top of Nyaa with their mouths in front of each other's pussies.\r\n\r\n\"On the count of three, you two will be eating each other out! One, two... three!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 50888112, "type": "ic", "edited": "2018-07-10T05:00:15.770913", "format": "raw", "posted": "2018-07-10T05:00:15.770913", "text": "Nyaa whimpers at the treatment her nipples receive but maintains her composure. Unlike Totoko who’d cried and pleaded, she seems to keep her wits about her. She doesn’t want to be here any more than the other girl does but she’s always been able to show her better side if a camera is rolling.\r\n\r\nBoth girls listen attentively to the intro, getting more confirmation that whatever was in store for who lost this competition would be punished. \r\n\r\nIt’s fairly obvious that neither girl has very much experience in eating someone out, but desperation has driven them into doing what they can. Nyaa is on Totoko the moment they’re given the signal to go, licking and sucking as Totoko’s hesitation gives her the advantage."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50979487, "type": "ic", "edited": "2018-07-15T06:46:00.749417", "format": "raw", "posted": "2018-07-15T06:46:00.749417", "text": "The camera catches every angle of the girls' competition, as well as every slurp and noise from each other's busy mouths. Tsubasa watches on with lust, appreciating the scene in front of her.\r\n\r\n\"Come, girls!\" She urges, forcing Totoko's head down further onto Nyaa's pussy. \"You don't want to be punished, do you? We've got lots in store for the loser!\"\r\n\r\nNyaa isn't safe from the rough touches either. Tsubasa's guard makes sure to yank her hair back, her ring-gagged mouth forced to take more of Totoko's pussy.\r\n\r\n\"Which of our new stars will cum first?\" Tsubasa asks the audience as she ruffles Totoko's hair. \"I can't wait to see the loser suffer!\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 50995856, "type": "ic", "edited": "2018-07-16T03:59:29.045384", "format": "raw", "posted": "2018-07-16T03:59:29.045384", "text": "Totoko moans into Nyaa’s pussy as Tsubasa presses her head down further. As much as she wants to win to avoid punishment, she doesn’t want to pleasure the idol the way that she’s doing so now. The same as she doesn’t want to cum through Nyaa’s attention to her pussy - also spurred on by not wanting to be punished overall. \r\n\r\nIt’s a thought process that doesn’t seem to be hindering Nyaa in any way, shape, or form. She’s inexperienced, but she makes up for it with gusto and doesn’t struggle when the guard yanks on her hair. Inside herself, Nyaa knows that she’s suffering, but for the time being there’s a camera rolling.\r\n\r\nBoth girls are sensitive after their recent treatments with the vibrator, and it’s looking to be a close game as they begin to buck into one another. \r\n\r\nThen a cry from the victor as she’s forced to lap up the other girl’s juices. Totoko can’t belive her good fortune."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 50997688, "type": "ic", "edited": "2018-07-16T05:09:08.109250", "format": "raw", "posted": "2018-07-16T05:09:08.109250", "text": "\"Oh, would you look at that!\" Tsubasa beams, yanking up Totoko by the hair. \"Looks like Totoko is the winner!\"\r\n\r\nShe shows off her face to the camera, drool and juice covering it as it's forced open from the ring gag. She makes sure to show off every angle before shoving her tongue in the victor's mouth. She glances to the camera as she forcibly kisses her, moaning loudly before pulling away. Licking her lips, she releases her grip on her hair before striding over to Nyaa.\r\n\r\n\"Our poor, slutty little kitten is going to get punished... what a shame!\" Tsubasa laughs as she pulls Nyaa out from under Totoko, placing her on the floor before tightening a collar around her neck. The tag reads \"Bitch Slut\", which she shows off to the camera before tugging on the leash connected to the collar.\r\n\r\n\"Come on, Nyaa-chan,\" she orders, head motioning to a chair in the distance. \"We don't have all day, you know.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 51020562, "type": "ic", "edited": "2018-07-17T05:36:52.439286", "format": "raw", "posted": "2018-07-17T05:36:52.439286", "text": "Nyaa cries out in frustration when she cums, expression clearly irritated as she watches Totoko be rewarded for her victory. It should have been her getting that kiss and then watching Totoko be punished, not the other way around.\r\n\r\nTotoko is all too pleased with herself as she sees the collar put around Nyaa’s neck and reads the tag. Bitch Slut. Very fitting. Even the most dire of situations like this one wouldn’t damped their rivalry with one another.\r\n\r\nNyaa crawls along on her elbows and knees, slowly sliding along the floor towards the chair."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51062039, "type": "ic", "edited": "2018-07-19T08:05:43.598152", "format": "raw", "posted": "2018-07-19T08:05:43.598152", "text": "The camera films the result of the competition for all the viewers to see, paying special attention to Nyaa. Tsubasa smiles to herself as she drags the idol across the floor, the two soon face-to-face with the chair.\r\n\r\nThe chair was specially designed by an employee for punishing Tsubasa's stars. It had been clearly modified, the dildo sticking out of the seat attesting to that. There's little Nyaa can do as Tsubasa picks her up and places her onto the dildo. Her wet pussy makes the task all too easy, the dildo sliding in with ease.\r\n\r\nPleased with the setup, Tsubasa continues with the torture as she presses a few buttons on the chair. The dildo suddenly starts up, pounding inside Nyaa's pussy at a quick pace."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51170337, "type": "ooc", "edited": "2018-07-25T04:53:23.295113", "format": "raw", "posted": "2018-07-25T04:53:23.295113", "text": "(( I'd like to apologize for taking a while with some of my responses for our RPs. I've been a bit busy. Hope you're doing well!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 51241936, "type": "ooc", "edited": "2018-07-29T05:25:41.678676", "format": "raw", "posted": "2018-07-29T05:25:41.678676", "text": "Sorry! I got busy too, I’ll get responding soon!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51242929, "type": "ooc", "edited": "2018-07-29T06:26:59.011432", "format": "raw", "posted": "2018-07-29T06:26:59.011432", "text": "(( okay, awesome!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 51398180, "type": "ooc", "edited": "2018-08-07T03:41:13.548853", "format": "raw", "posted": "2018-08-07T03:41:13.548853", "text": "Okay now I’m actually getting to work on responses. Would’ve happened sooner but I’ve had a lot of packing to do."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51398213, "type": "ooc", "edited": "2018-08-07T03:42:13.405034", "format": "raw", "posted": "2018-08-07T03:42:13.405034", "text": "(( that's alright! I apologize for the wait on my responses as well, I've been p busy in general"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 51398412, "type": "ooc", "edited": "2018-08-07T03:50:00.040157", "format": "raw", "posted": "2018-08-07T03:50:00.040157", "text": "Perfect timing then! I try so hard to be good about keeping an update at the very least but occasionally I can’t even log into anything because I’m just going from thing to thing."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 51398493, "type": "ic", "edited": "2018-08-07T03:52:59.208275", "format": "raw", "posted": "2018-08-07T03:52:59.208275", "text": "Nyaa’s already slick pussy hardly resists being put onto the dildo, seen by anyone and everyone watching the stream. Though the same can’t be said about Nyaa herself. \r\n\r\nShe moans and whines, the sounds increasing in volume as the dildo begins to thrust inside of her and her shortened limbs flail pathetically."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 51492190, "type": "ic", "edited": "2018-08-12T08:28:06.425329", "format": "raw", "posted": "2018-08-12T08:28:06.425329", "text": "Seeing the cat idol reduced to a pathetic, squirming plaything fills Tsubasa with incredible lust. She can't help herself as she grabs for a set of nipple clamps, attaching them to Nyaa's buds and giving them a harsh tug.\r\n\r\n\"I could just eat you up, my little kitten,\" Tsubasa coos before shoving a dildo in her mouth. The fake cock plugs it up, brushing against the back of her throat.\r\n\r\nThat's when Tsubasa's fingers hold onto Nyaa's nose, cutting off her air supply as she thrusts the dildo plugging her mouth."}]