[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54995347, "type": "ic", "edited": "2019-03-04T05:11:48.418702", "format": "raw", "posted": "2019-03-04T05:11:48.418702", "text": "Tsubasa and her employees cut the livestream some time after the girls pass out from the heat, but not before showing a message on the screen promising more lewd videos with the two... and a hint at \"something big coming soon\".\r\n\r\nThe two girls are removed from the shared bag and placed into a new type constricting bondage - transparent vacbeds. They're placed across from each other, the material holding them still and stretching against their faces in a humiliating spectacle. Tubes are lodged in their mouths, giving them a supply of air from a machine with the option to cut it off if needed.\r\n\r\nEach girl now has a vibrator in her pussy, along with removed blindfolds so they can see each other's torment when they come to. Tsubasa and her employees have left the room to sleep, the machine set to cut off air for a short while at a time every fifteen minutes. The vibrators also have an option to turn on and off randomly in the night at different settings, giving the girls only some time to rest."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 54998104, "type": "ic", "edited": "2019-03-04T08:23:31.873879", "format": "raw", "posted": "2019-03-04T08:23:31.873879", "text": "Nyaa is the first to awake with as much of a jolt as she can manage, snorting in panic when she can’t breath and using up even more of what little air she had after her supply was cut off. She’s about to scream when the sound turns into a pleasured moan when the vibrator cuts on and buzzes inside of her for a few short seconds that leave her wanting more. But she doesn’t have time to take stock of her new situation until the timer resets and she’s able to breath more easily.\r\n\r\nShe can see the pink of Totoko’s bitchsuit a few feet across from her, her breasts squashed together a little bit. The sight of her face makes her laugh a little - one eye is wide open and twitching in her unconscious state while the other is only half open with the eyebrow pushed down extremely low, paired with her still hooked nose pressed against the membrane of the vacbed and a wide open mouth.\r\n\r\nIt isn’t the sound that wakes Totoko up, but also the lack of air that the former idol recently experienced, giving her the opportunity to see Nyaa in a very similar situation minus the nose hook. \r\n\r\nIt’s an extremely long night, frustrating both girls to no end as the vibrators in their pussies tease them without letting them cum and their air supply is cut off when they start drifting off."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55746368, "type": "ic", "edited": "2019-04-16T23:18:14.892731", "format": "raw", "posted": "2019-04-16T23:18:14.892731", "text": "Morning arrives quickly for Tsubasa and her employees, who all take their sweet time eating breakfast and chatting about the news before retrieving the former idols. They're still locked away in their vacbeds, the breath controlling machines being their main connection to the outside world.\r\n\r\n\"Good morning, girls,\" Tsubasa greets as her employees remove them from their restraints. \"I'll bet you didn't sleep well at all! Well, that's going to be an issue, considering we booked an event for the two of you tonight.\"\r\n\r\nShe tugs on one Totoko's pigtails, yanking back Nyaa's hair as well.\r\n\r\n\"Hope you like taking cock for hours on end, piggy and kitty,\" she laughs."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "FF6FF2", "show_edited": false, "id": 55748362, "type": "ic", "edited": "2019-04-17T01:32:33.304931", "format": "raw", "posted": "2019-04-17T01:32:33.304931", "text": "The rest of the night was less than peaceful for the two girls, startling awake from the lack of air or whenever they felt the vibrations in their pussies. Even when they’re being taken out of the vacbeds, Nyaa’s starts up again and she squeals with pleasure seconds before her hair is pulled back.\r\n\r\nRight. This was serious. Especially if she wanted to continue being treated marginally better than Totoko.\r\n\r\nTotoko is completely exhausted, drooling without restraint as soon as Tsubasa even mentions cocks. It shows that she’s been tormented longer than Nyaa, searching for just a little bit of relief even if it means agreeing."}]