[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47457147, "type": "ooc", "edited": "2018-01-07T05:48:55.969007", "format": null, "posted": "2018-01-07T05:48:55.969007", "text": "(( that's a cute idea! they could have an interesting time hiding him from the people with the no pet policy, while still toying with him enough to satisfy themselves"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47457234, "type": "ic", "edited": "2018-01-07T05:52:10.782418", "format": null, "posted": "2018-01-07T05:52:10.782418", "text": "Takeru fights back the urge to groan at Jyushimatsu's rambling. In a few minutes, he won't be able to talk at all, and Takeru hopes the moment comes soon.\r\n\r\n\"Yeah, we've got some uniforms in there,\" he explains. \"You'll have to put it on right away. Gotta make sure you feel at home, Jyushi.\"\r\n\r\nHe opens the door to the storage room, where rows and rows of equipment are lined up, from bats to gloves to balls. A single uniform lies on a chair nearby.\r\n\r\n\"Feel free to start changing. I'll be with you in a moment.\" Takeru gives Jyushi a thumbs-up before leaving the room, failing to mention the three other members in the room hiding out of Jyushi's sight."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47457354, "type": "ooc", "edited": "2018-01-07T05:57:27.430520", "format": null, "posted": "2018-01-07T05:57:27.430520", "text": "Oh! Maybe the dildo gag is actually part of the mask of his suit and it forms a dog’s muzzle?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47457414, "type": "ooc", "edited": "2018-01-07T05:59:26.544425", "format": null, "posted": "2018-01-07T05:59:26.544425", "text": "(( that's a really cute and fun idea!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47457489, "type": "ic", "edited": "2018-01-07T06:02:48.719265", "format": null, "posted": "2018-01-07T06:02:48.719265", "text": "Jyushi is bouncing on the balls of his feet as they enter the equipment room, rambling on about how excited he was to be a part of the team - oblivious to the fact that he was most likely getting on Takeru’s nerves. \r\n\r\n“Sure! Oh this is fantastic, I’ll be changed in a second and then we’ll meet the rest of the team and start practice, right?” He asks as he approaches the uniform, turning back around to catch Takeru leaving when he doesn’t get an answer, not that it dampens his spirits.\r\n\r\nJyushi starts stripping down to his boxers, talking to himself excitedly the entire time as he gets ready to put on the uniform."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47457640, "type": "ic", "edited": "2018-01-07T06:12:09.921430", "format": null, "posted": "2018-01-07T06:12:09.921430", "text": "The team members watch as Jyushimatsu strips down to his boxers, full attention on his body as they look over him with lust. Once he's ready to put on his uniform, the three act as quickly as they can, two of them running towards Jyushi and gripping tightly onto his arms while the third approaches him with a latex suit and a mask with a dildo muzzle gag.\r\n\r\n\"Stay still,\" he orders, a sadistic smirk spreading on his face. \"Just stay calm, and open wide...\"\r\n\r\nNone of them expect the new recruit to be cooperative, but their grip on him is tight enough to prevent any escape, so they aren't too worried about defiance."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47457798, "type": "ic", "edited": "2018-01-07T06:19:35.812426", "format": null, "posted": "2018-01-07T06:19:35.812426", "text": "The sudden appearance startles Jyushi enough that he backpedals from the uniform almost instantly, and subsequently his pile of clothes, letting out a yelp of surprise. For a brief moment he’s willing to believe that it’s just a prank - scaring the new guy while he’s changing, very funny, but that quickly shifts to questioning whether or not he’s being hazed when two of his new teammates grab him by the arms.\r\n\r\nAnyone with an ounce of common sense would most likely keep their mouth shut after being told to open wide while struggling to free themselves, but Jyushi is an exception to the rule in this case.\r\n\r\n“H-hey very funny! What’s going on? Please let go. I’m supposed to be putting on my uniform, can’t we do this prank later?”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47475766, "type": "ooc", "edited": "2018-01-08T04:02:04.371373", "format": null, "posted": "2018-01-08T04:02:04.371373", "text": "What if they had the occasional party/fundraiser for the team where other students could come play with Jyushi like they do at pep rallies? I was thinking a fun set up might be Jyushi in the stereotypical begging pose but with an open ring gag and his tongue temporarily pierced so a chain can hold it out and be attached to nipple clamps and a tip jar nestled between his legs as he gives blowjobs"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47476095, "type": "ooc", "edited": "2018-01-08T04:14:28.785315", "format": null, "posted": "2018-01-08T04:14:28.785315", "text": "(( that's a cute idea!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47476398, "type": "ooc", "edited": "2018-01-08T04:24:42.460774", "format": null, "posted": "2018-01-08T04:24:42.460774", "text": "Thanks!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47476602, "type": "ic", "edited": "2018-01-08T04:30:53.681269", "format": null, "posted": "2018-01-08T04:30:53.681269", "text": "The two holding onto Jyushi's limbs chuckle, the third with the ring gag shaking his head with an evil grin.\r\n\r\n\"This isn't a prank, dumbass,\" he says bluntly, shoving the dildo into Jyushi's mouth while he rambles. The dildo is fairly sized, barely tickling the back of his throat as the muzzle is fastened behind his head.\r\n\r\n\"Good, now you're properly silenced,\" one holding onto him says, giving him a mocking kiss to the cheek. Then the latex suit is laid out in front of him.\r\n\r\n\"Get in the suit, pet,\" he urges as he strokes his cheek. \"Be a good pup for us...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47476908, "type": "ic", "edited": "2018-01-08T04:40:21.456934", "format": null, "posted": "2018-01-08T04:40:21.456934", "text": "The end result is a series of gags and muffled moans as Jyushi is forced to take the whole of the dildo all at once. It’s an unpleasant and uncomfortable feeling made all the worse when he makes out the tell-tale click of fastening straps around his head.\r\n\r\nLooking down the length he can just make out that it tapers off to a curved point and forms the familiar shape of a dog’s snout. Which explains why he’s being called a pet even though he’s still bursting with questions that only translate to incoherent nonsense.\r\n\r\nJyushi’s eyes squeeze shut at the kiss to his cheek followed by the gentle caressing. He doesn’t understand what’s going on or why but the grip on his arms is too strong for him to break free and it doesn’t take long that the whole experience will be over sooner than later if he just does what the boys want.\r\n\r\nHesitantly, the young man sinks to his knees and wrinkles his nose as they touch the slick material."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47477494, "type": "ic", "edited": "2018-01-08T04:59:04.045745", "format": null, "posted": "2018-01-08T04:59:04.045745", "text": "The three laugh cruelly as Jyushi sinks into the suit, the two gripping onto him forcing his knees and elbows into the slots and fastening him inside, but not before tearing off his boxers. There's no escape for the poor man as the rubber presses tightly against his form, exposing his ass and nipples but keeping his cock sealed inside the suit.\r\n\r\n\"Good boy!\" One praises, giving him a kiss against his fake snout. \"Now you gotta stick your ass in the air while my buddies take a few pictures.\"\r\n\r\nBefore Jyushi can move, the team member presses the heel of his foot on his head, pushing it down towards the floor."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47477783, "type": "ic", "edited": "2018-01-08T05:08:38.086161", "format": null, "posted": "2018-01-08T05:08:38.086161", "text": "More whimpering, not unlike that of the dog they’re clearly trying to make him out to be, escapes Jyushi’s muzzle as he’s trapped within the suit. It’s not a comfortable fit, practically melding into a second skin that conforms to his small frame and presses his cock into a shapeless bulge. Even worse is the angle of his arms and legs are held at to ensure that he remains on all fours - the best he could probably do to stand would still just be resting on his legs and barely coming up to someone’s waist.\r\n\r\nTears form in the corners of his eyes as his head is mashed into the tiled floor, squirming only resulting in a movement that makes it look like he’s wiggling his ass like an excited puppy."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47478149, "type": "ic", "edited": "2018-01-08T05:21:09.281331", "format": null, "posted": "2018-01-08T05:21:09.281331", "text": "\"Aw, look at how playful he is!\" One snickers as he takes out his phone, snapping a few pictures of his exposed ass.\r\n\r\n\"And those little whimpers are cute, too...\" The next sighs, giving his ass a few snacks.\r\n\r\n\"Aw, our pretty little pup is scared, isn't he?\" The tormentor pushing his foot into his head says, lifting it up and ducking down to see his teary expression.\r\n\r\n\"I'm gonna fuck you first, and there's nothing you can do that will stop me.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "a1a100", "show_edited": false, "id": 47478570, "type": "ic", "edited": "2018-01-08T05:35:17.266054", "format": null, "posted": "2018-01-08T05:35:08.370801", "text": "Jyushi’s eyes widen with fear at the statement, officially releasing the flood of tears as he starts crying alongside the muffled whines. This couldn’t possibly be happening - it was going on much too long to be a part of some kind of initiation ritual. He was supposed to be a part of the team.\r\n\r\nBut the captor is right. In his current position there’s nothing he can do to prevent himself from being fucked. They were college students for crying out loud, it was highly unlikely that even a faculty member would step inside the equipment room to save him.\r\n\r\nAll Jyushi can do is moan and whimper pathetically in an effort to plead for the others to stop."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47479270, "type": "ic", "edited": "2018-01-08T06:01:25.869606", "format": null, "posted": "2018-01-08T06:01:25.869606", "text": "\"Just relax, pet,\" he snickers as he reaches for the lube in his pocket, sliding his pants down and coating it. \"Stop freaking out so much. It'll be more painful for you unless you just accept it.\"\r\n\r\nWithout much warning, he slides inside Jyushi's ass, thrusting hard and fast as the other two record the action on their phones. One pays special attention to Jyushi's tearful face, the other recording their friend's cock as it pounds into him.\r\n\r\n\"You've got the rest of the team to handle after this, pup. Don't run out of energy on us.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47479603, "type": "ic", "edited": "2018-01-08T06:15:53.420050", "format": null, "posted": "2018-01-08T06:15:53.420050", "text": "Jyushi jolts at the initial thrust, flushing with shame and embarrassment once he notices the other two filming the experience. Each one has him rocking back and forth and it doesn’t escape his notice that with the fake cock in his mouth he’s filled in both of his holes - something he doesn’t imagine is going to be a one time situation.\r\n\r\nAnd the tears continue to roll down his cheeks as his ass is pounded, producing keening whines when there’s no possible way for him to escape.\r\n\r\nMeaning there are eight more behind the first that he’ll end up getting fucked by if the entire team is planning on stuffing their cocks in his ass."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47480188, "type": "ic", "edited": "2018-01-08T06:45:54.102267", "format": null, "posted": "2018-01-08T06:45:54.102267", "text": "\"Such pathetic whining...\" The captor groans as he keeps thrusting, getting closer and closer to the edge. \"I'm gonna cum soon, so take all of it like a good pet!\"\r\n\r\nWithin minutes, he floods Jyushi's ass with his seed, burying himself inside him before pulling out. Cum leaks out of Jyushi's ass as his tormentor smacks it, stepping aside to allow the next member to fuck him as he applies the lube."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47480398, "type": "ic", "edited": "2018-01-08T06:57:59.773656", "format": null, "posted": "2018-01-08T06:57:59.773656", "text": "The new pet arches his back as he’s filled with cum, howling around the cock in his mouth while the second teammate takes his position.\r\n\r\nHe sinks back down to the floor, head pressed against the cold tile while his ass remains in the air, squeezing his eyes shut so he can at least pretend that this isn’t happening to him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47500675, "type": "ic", "edited": "2018-01-09T06:21:28.452544", "format": null, "posted": "2018-01-09T06:21:28.452544", "text": "The other two take their turns fucking Jyushi, cum leaking out of his ass by the time they're finished. A while after the second team member is finished, the door to the storage room opens, revealing Takeru. He approaches the members and the new pet, examining the latter as his ass sticks out in the air.\r\n\r\n\"That's a good look for you,\" Takeru purrs as he strokes Jyushi's hair. \"I'll go and call the rest of the team in, then we'll play with you more tomorrow...\"\r\n\r\nTakeru gives him a kiss on the forehead, standing up and looking over his bound form once more.\r\n\r\n\"This was the plan all along, you know. You were never meant to join the team. You're just our little pet and you'll stay that way for as long as we want.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47500988, "type": "ic", "edited": "2018-01-09T06:39:49.569262", "format": null, "posted": "2018-01-09T06:39:49.569262", "text": "As the door opens, Jyushi can’t help the hope that floods through him as he prays for a swift rescue. Embarrassing as it would be to be caught in such a position, it would certainly be better than whatever else was in store for him if no one found him. College meant he was a long way from home and his brothers wouldn’t notice his absence at least until the semester was over.\r\n\r\nA long time to be a pet when classes have just barely started.\r\n\r\nHe makes an attempt to beg for Takeru to help him before the captain reveals their true intentions and that he was never supposed to be a member of the team. Jyushi sobs around the cock in his mouth, tears starting up again as he’s kissed gently on the forehead."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47501918, "type": "ic", "edited": "2018-01-09T07:40:46.018681", "format": null, "posted": "2018-01-09T07:40:46.018681", "text": "Takeru clicks his tongue, smirking at the pup in front of him. Then he leaves the storage room, his intentions to retrieve the team members clear.\r\n\r\n\"We've got some toys in here,\" one member says, rummaging through a box nearby. \"I wonder what you'll be able to take? Maybe we can train you to take really big toys down your throat and up your ass... wouldn't that be fun?\"\r\n\r\nHe pulls out a vibrating dildo, lubing it up before nudging it inside his ass as it still leaks cum. Once it's deep enough, he flicks the switch, the toy springing to life inside Jyushi's hole.\r\n\r\n\"Wiggle around for us, little pup. Show us how playful you are.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47502015, "type": "ic", "edited": "2018-01-09T07:50:06.941831", "format": null, "posted": "2018-01-09T07:50:06.941831", "text": "Jyushi would like nothing more than to just bury his head and shame and not give the group the satisfaction of his obeying orders. He doesn’t want to be a part of this, doesn’t understand how this can be happening to him, and most of all he’s terrified that this isn’t going to end once they’re finished with him in the locker room. He’s completely helpless to act on his own within the suit, unable to even reach or turn a doorknob even if he could get away.\r\n\r\nHis back arches with the insertion of the dildo, hole squeezing tightly around it as he tries and fails to prevent it from entering. The combination of lube and cum oozing from his ass makes the task of putting it inside of him all too easy and once it’s switched on something in Jyushi breaks.\r\n\r\nHe wants to be as far away as he can get from the merciless vibrations, squirming and wiggling on his elbows and knees - just like they want him to."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47506334, "type": "ic", "edited": "2018-01-09T18:45:20.783240", "format": null, "posted": "2018-01-09T18:45:20.783240", "text": "The three whistle and holler as they watch Jyushi wiggle on the floor, recording his reactions once again with their phones.\r\n\r\n\"Good boy! It feels good, right?\" They start to jerk off as they taunt him, aiming at different parts of his body. \"Do you want it up higher?\"\r\n\r\nWithout even waiting for a whine of protest, he adjusts the settings, the vibrations stronger than ever. To add insult to the injury, he smacks Jyushi on the ass, leaving a mark.\r\n\r\nThe door opens again, Takeru and the rest of the team pouring in to watch the humiliation with hungry eyes."}]