[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47507004, "type": "ic", "edited": "2018-01-09T19:32:39.616379", "format": null, "posted": "2018-01-09T19:32:39.616379", "text": "Jyushi practically howls around the cock in his mouth when the dildo is turned up by what feels like several notches. Tears fall openly down his cheeks as he continues to squirm around on the floor, heavily motivated by the slap to his bare cheeks.\r\n\r\nBy the time Takeru arrives with the others, he’s collapsed in an exhausted heap with his shortened limbs spread out flat against the floor as he weakly twitches with the dildo’s vibrations.\r\n\r\nHe can’t help that it’s arousing and hitting a bundle of nerves that make him turn into a whining mess. Worse off that his cock is pressed so tightly against himself by the suit that he can’t even find relief humping the floor in search of any kind of friction."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47507167, "type": "ic", "edited": "2018-01-09T19:44:35.902722", "format": null, "posted": "2018-01-09T19:44:35.902722", "text": "The team laughs as Jyushi humps the floor in desperation, sprawled out on the floor in a twitching, tired mess.\r\n\r\n\"Better get ready to take more cocks, pup,\" Takeru sneers, giving him a swat on the ass once he's approached him. \"That cock down your throat isn't going to be the only one you'll be taking.\"\r\n\r\nTakeru unstraps the muzzle, pulling the saliva-coated dildo out of Jyushi's mouth.\r\n\r\n\"You look exhausted... but you still got a while to go before the day is over.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47507264, "type": "ic", "edited": "2018-01-09T19:51:59.286648", "format": null, "posted": "2018-01-09T19:51:59.286648", "text": "Jyushi sputters once the gag is removed from his mouth, staring hatefully at the muzzle. He’s really not in any position to bargain or plead with the team for mercy, but Jyushi wouldn’t be Jyushi without opening his mouth the second he isn’t being gagged.\r\n\r\n“P-please,” he stammers, craning his neck to look up to Takeru and the others. “Take out the other one...I can’t handle it anymore, please.”\r\n\r\nIt’s pathetic, really. Whimpering and crying for the vibrator to be taken out rather than begging to be let go but it’s the first thing that comes out of his mouth."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47507350, "type": "ic", "edited": "2018-01-09T19:58:04.670032", "format": null, "posted": "2018-01-09T19:58:04.670032", "text": "Takeru chuckles as the rest of the team howls with laughter, giving Jyushi a pat to the cheek.\r\n\r\n\"Okay, we'll take it out, since you asked so nicely.\" Takeru nods to a team member, who approaches Jyushi to take the vibrator out of his hole. But the relief doesn't last long as he lubes himself up, replacing the vibrator with his cock.\r\n\r\nWhile Jyushi gets his ass pounded, Takeru stuffs his own cock down his throat, thrusting in rhythm with the other team member."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47507901, "type": "ic", "edited": "2018-01-09T20:34:18.151060", "format": null, "posted": "2018-01-09T20:34:18.151060", "text": "Jyushi whines at the entrance, though it isn’t nearly as bad as when he’d first been pounded by one of the team. Though the vibrator has left him feeling more sensitive to each thrust - and his protests are muffled by Takeru’s cock.\r\n\r\nStuck between the two players, the NEET is helpless to do anything except impale himself further on either cock. He actually has to count the gag as a blessing in this instance, finding it to be extremely large in comparison even if it didn’t actually move back and forth to fuck his throat like Takeru’s doing."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47511738, "type": "ic", "edited": "2018-01-10T00:15:37.572554", "format": null, "posted": "2018-01-10T00:15:37.572554", "text": "Within minutes, Takeru and the other team member cum inside each of Jyushi's holes. But any kind of relief is lost once two more team members line up for their turns.\r\n\r\nThe assault continues, every member eventually cumming down Jyushi's throat or ass. Many of them leave smacks on Jyushi's ass afterwards, leaving it red and likely sore.\r\n\r\nOnce everyone has had a turn with the new pet, Takeru announces that today's training is over and everyone can go home. The members leave Takeru and Jyushi behind, the captain crouching down to meet Jyushi's eyes.\r\n\r\n\"I'll have to store you away, but we'll play more tomorrow.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47512958, "type": "ic", "edited": "2018-01-10T01:19:15.618314", "format": null, "posted": "2018-01-10T01:19:15.618314", "text": "Jyushi is an exhausted mess by the end of the affair, sprawled back out on the ground with cum leaking out of his throbbing ass and coating his face - most likely left to dry. He can barely even lift his head when Takeru addresses him, looking up at the captain with half shut eyes.\r\n\r\n“No, please just let me go,” he says hurriedly, not quite sure how long he has to speak now that there aren’t any baseball team members around to shove their cocks down his throat. “I won’t tell anyone about this, I swear.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47519228, "type": "ic", "edited": "2018-01-10T05:36:40.504675", "format": null, "posted": "2018-01-10T05:36:40.504675", "text": "Takeru shakes his head at Jyushi's plea, ruffling his hair.\r\n\r\n\"No can do, pup. Our team has been on edge for a while, and a team pet could really help out our stress levels.\"\r\n\r\nHe gives Jyushi a kiss on the top of his head, running his thumb over his cum-coated bottom lip.\r\n\r\n\"Wow, we really did a number on you, huh?\" Takeru chuckles. \"You're not the energetic, loud guy you were when you got here.\"\r\n\r\nHe stands up, rummaging through some tucked away equipment and pulling out a sleep sack and a breathing tube.\r\n\r\n\"This'll hide you really well, not to mention the atmosphere inside is nice and dark,\" he explains as he unzips it, lifting up Jyushi and lying him on his back inside the sack. \"Be thankful you'll be able to breathe in there.\"\r\n\r\nTakeru presents the breathing tube, lowering it down as he waits for Jyushi to open up."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47520553, "type": "ic", "edited": "2018-01-10T06:59:14.367810", "format": null, "posted": "2018-01-10T06:59:14.367810", "text": "Jyushi whines at the denial to be freed. He lowers his head submissively when Takeru kisses him and can’t help but lean into the touch. Only a day in and the rare gentleness lulls him into a false sense of hope that maybe it’ll only be a day or two. The team will get bored of him eventually and they’ll have to let him go. Or someone would find him and rescue him.\r\n\r\nHis limbs flail helplessly as the captain picks him up, not yet used to the suits restriction to be able to flip himself over in the suit and crawl away like he wants to. Thankful to breathe? That’s what the tube must be for. And as much as he doesn’t want to take it, he knows that Takeru doesn’t have to give it to him unless he really wanted to. \r\n\r\nRefusal could be disastrous.\r\n\r\nAlmost hesitantly, Jyushi silently opens up his mouth to allow the tube’s entrance as he starts to tear up again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47534984, "type": "ic", "edited": "2018-01-11T04:44:49.621031", "format": null, "posted": "2018-01-11T04:44:46.035907", "text": "Takeru smirks down at Jyushi as he lodges the tube in his mouth, wiping a tear away with his thumb.\r\n\r\n\"Shh, calm down. You don't want to exhaust yourself further,\" he whispers, giving a kiss on the cheek. \"Don't try crying out for help, either. Nobody comes around here, anyway.\"\r\n\r\nHe zips up the sleep sack to Jyushi's neck, ruffling his hair one last time before zipping it up further. Only a tube sticks out of the sack, allowing him to breathe.\r\n\r\nWith his business finished, Takeru exits the room, leaving Jyushi alone for the remainder of the night."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47535446, "type": "ic", "edited": "2018-01-11T05:09:07.243969", "format": null, "posted": "2018-01-11T05:09:07.243969", "text": "Left alone to his own devices, Jyushi might have been able to devise some plan of escape if he hadn’t been confined within the sack. It’s the perfect size for his newly bound form, almost clinging to the latex suit like a second skin. Instead, he’s left to focus on his breathing through the tube so he doesn’t send himself into a frenzied panic and pass out.\r\n\r\nThe smooth and shallow breaths he takes are rhythmic enough to send him into a fitful sleep. One where Jyushi will occasionally twist and shift within the sack and whine through the tube in his unconscious state.\r\n\r\nHe dreams of the baseball team, nearly convincing himself that the day’s events were a part of the dream. Nothing like that could actually happen to him in real life - he was just nervous about making the team."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47535541, "type": "ic", "edited": "2018-01-11T05:14:38.488777", "format": null, "posted": "2018-01-11T05:14:38.488777", "text": "The next morning, the whole team is ready to practice in high spirits. Takeru is the one to unzip Jyushi's bound form from the sack, removing the tube from his mouth and shaking him awake.\r\n\r\n\"Good morning, pet,\" he greets, lifting him up on his knees and elbows and onto the floor. \"Did you sleep well? We're going to train you more today, too. But first, we need to practice. You'll be retrieving the balls for us, okay?\"\r\n\r\nHe gives him a kiss on the forehead, ruffling his hair in an affectionate manner."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47535719, "type": "ic", "edited": "2018-01-11T05:24:47.194102", "format": null, "posted": "2018-01-11T05:24:47.194102", "text": "Jyushi jolts awake at the first contact, startled at the sudden influx of stimulation. Throughout the night in the sack he’d been effectively blind and deaf. The tube draws a whistling sound from his throat as he starts breathing heavily - looking up to the baseball team members and wilting in their presence.\r\n\r\nIt hadn’t been a dream after all. He really was going to be the baseball team’s pet, completely at their mercy.\r\n\r\nSomething that’s abundantly clear when Takeru once again lifts him up and sets him back down in the proper position for movement. And once again he finds himself leaning into the gentle touches and the kiss to his forehead - a completely different feeling that that of being spanked and fucked by the whole team."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47544248, "type": "ic", "edited": "2018-01-11T21:25:55.878412", "format": null, "posted": "2018-01-11T21:25:55.878412", "text": "Takeru pulls away from Jyushi as one of the team members hands him a collar, the captain fastening it around his neck. The name tag simply says \"Puppy\" on it, which Takeru shows the new pet before putting it on. Afterwards, he attaches a leash to the collar, tugging Jyushi forward in an attempt to get him to walk.\r\n\r\n\"Come on, pup. We need all your energy for today's practice.\" Takeru tugs at the leash towards the baseball field, the rest of the team taking their positions for their practice."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47548219, "type": "ic", "edited": "2018-01-12T01:00:33.623297", "format": null, "posted": "2018-01-12T01:00:33.623297", "text": "Jyushi can’t help but frown at the collar. Just another humiliating addition to his current situation. Though it doesn’t quite hit home that he’s being stripped of his actual name in favor of the term Puppy, not yet anyways.\r\n\r\nIt’s a struggle to keep pace with Takeru, even if he forces himself so he doesn’t end up choked by the leash, but a small mercy that the field is so close by and doesn’t require them to go anywhere else on campus. But once he gets the hang of crawling on his elbows and knees, it’s not so difficult to keep a couple of steps behind the captain."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47555330, "type": "ic", "edited": "2018-01-12T05:42:04.928506", "format": null, "posted": "2018-01-12T05:42:04.928506", "text": "Takeru clips off the leash once Jyushi's near the edge of the field, putting it on a bench nearby. He squats down to meet his face, starting his explanation for how the practice will go down.\r\n\r\n\"When one of the boys hits a ball and it lands out of the field, you'll have to go retrieve it. We'll keep an eye on you to make sure you don't wander off. Don't try anything funny.\"\r\n\r\nHe leaves him alone to start playing, and within a few minutes one of the members hits a home run, landing a few meters away from Jyushi."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "A1A100", "show_edited": false, "id": 47555549, "type": "ic", "edited": "2018-01-12T05:51:19.118193", "format": null, "posted": "2018-01-12T05:51:19.118193", "text": "Jyushi considers his options as he’s left alone, observing the field curiously. Other than the outfielders, he was almost by himself at the edge of the field. He could certainly try to escape if he was more practiced with moving in the suit - no doubt most of the team could catch up to him if he tried to leave the field.\r\n\r\nSighing, he makes himself comfortable in the grass and contents himself with watching the team practice - losing himself in a fantasy where he’s actually a full fledged member. When the ball lands nearby his head perks up before he starts making his way toward it at a slow crawl.\r\n\r\nHe looks towards the field and the other players and begins nudging the ball with one of his elbows. It slows his pace considerably and Jyushi realizes it would just be easier to carry it back in his mouth. Ducking his head, he starts loping towards home plate with the ball firmly between his teeth."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47586719, "type": "ooc", "edited": "2018-01-14T01:55:55.454373", "format": null, "posted": "2018-01-14T01:55:55.454373", "text": "(( just a heads up that I might not reply for a few days or so; I'll be a bit busy"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47887123, "type": "ooc", "edited": "2018-01-29T02:14:49.827581", "format": null, "posted": "2018-01-29T02:14:49.827581", "text": "(( would you still be up for this?"}]