[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47536907, "type": "ic", "edited": "2018-01-11T06:25:45.737752", "format": null, "posted": "2018-01-11T06:25:45.737752", "text": "Shin seals Ichi inside the suit, covering his whole body except for his sensitive parts. But he's not done with him as he shoves a cloth in his face, grabbing onto the back of his head.\r\n\r\n\"Enough inhales of this and you'll be a complete mess... just you wait.\"\r\n\r\nHe fails to mention that the cloth's scent is aphrodisiac in nature, almost like a kind of catnip for the new pet."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47537042, "type": "ic", "edited": "2018-01-11T06:31:52.294186", "format": null, "posted": "2018-01-11T06:31:52.294186", "text": "Ichi struggles uselessly as he’s held in place, hoping to appease the man into letting go of his head if he just smells the cloth like he wants.\r\n\r\nIt’s a sweet scent that seems to cling to him as he inhales deeply through his nose, but the reason as to why he wants him to smell the cloth in the first place is completely beyond Ichi’s reasoning until it begins to take effect and by then it’s already too late.\r\n\r\nThe newly made kitten squirms and moans around the ball gag, face turning a bright red as he starts to blush. Once he’s completely under his buds and cock are fully erect, the latter leaking precum as he starts to desperately mewl."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537177, "type": "ic", "edited": "2018-01-11T06:39:40.213811", "format": null, "posted": "2018-01-11T06:39:40.213811", "text": "Shin laughs as the scent starts to take effect, giving Ichi a few pats on the head.\r\n\r\n\"How cute...\" he sighs, playing with his erect buds. \"But you can't cum yet, kitten. I still have the rest of your brothers to play with.\"\r\n\r\nHe pulls away from his nipples, picking him up and placing him on his back. Then he focuses his attention towards Totty, taking off his blindfold and gag.\r\n\r\n\"I can't wait to put you in your place, bunny boy,\" he taunts."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47537232, "type": "ic", "edited": "2018-01-11T06:43:40.564399", "format": null, "posted": "2018-01-11T06:43:40.564399", "text": "Ichi whines pitifully. In his current state he could hardly care what position he and his brothers are in when cumming seems to take up the main priority in his head. At least in the back of his adled mind he thinks it will clear his head and offer some relief. But no, he’s left a pathetic mess on the floor, squirming on his back and unable to find any friction for his cock.\r\n\r\nTotty spits at the floor when his gag is removed, trying to get the taste of tape out of his mouth as he struggles against the remainder of his bonds. “Bunny boy?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537420, "type": "ic", "edited": "2018-01-11T06:55:49.801477", "format": null, "posted": "2018-01-11T06:55:49.801477", "text": "Shin nods as a guard comes behind him with a nose hook, forcing it on him as it yanks his nose up. His mouth is forced open from the pressure, slurring any speech from him.\r\n\r\n\"You'll be my cute little bunny. It fits your image, if you ask me,\" Shin explains as his guards cut his clothes and restraints off. \"With bunny ears and a cute little tail. What do you think?\"\r\n\r\nShin doesn't expect any kind of coherent answer with Totty's speech slurred, but he figures he'll ask anyway as a guard puts bunny ears over his head."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47537515, "type": "ic", "edited": "2018-01-11T07:03:32.423083", "format": null, "posted": "2018-01-11T07:03:32.423083", "text": "Totty squeals at the application of the nose hook, and aside from Choro he’s the only one so far whose whimpers and protests aren’t completely muffled by gags. Although his older brother seems to be preoccupied in the air, weighted clamps still swinging as he drools through the ring gag.\r\n\r\nTurning his attention back to Shin, Totty whines. “Ahn dwun wunna,” he manages to sputter out, shaking his head even as the ears are applied."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537634, "type": "ic", "edited": "2018-01-11T07:14:42.411764", "format": null, "posted": "2018-01-11T07:14:42.411764", "text": "Shin grins at Totty's slurred speech, the guards tying his legs together with tape as a cotton tail butt plug is lubed up and pushed inside his hole.\r\n\r\nThe way his legs are tied simulates a crouch, as if he's a rabbit ready to bounce. Then his arms are tied in front of him, resting on the floor.\r\n\r\n\"You don't have a choice, bunny boy,\" Shin mocks. \"Do you want a carrot in your mouth, too? I can give you mine, if you know where I'm coming from...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47537737, "type": "ic", "edited": "2018-01-11T07:24:35.815303", "format": null, "posted": "2018-01-11T07:24:35.815303", "text": "Totty yelps as the plug is pushed inside of him, wide enough that he can’t push it out on his own - and the soft tail tickles his ass.\r\n\r\nHis new position is extremely uncomfortable, and he doubts it will become more comfortable the longer he’s in it. The only option he has to simulate movement is small hops that won’t throw off his precarious balance. \r\n\r\n“Nwah, pwea.” He shakes his head vehemently."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47537804, "type": "ic", "edited": "2018-01-11T07:32:28.724729", "format": null, "posted": "2018-01-11T07:32:28.724729", "text": "Shin ignores Totty's garbled begging, unzipping his pants and slowly inching himself towards his open mouth.\r\n\r\n\"No, every good rabbit needs a carrot,\" he urges, shoving his cock in his mouth and thrusting it to the back of his throat.\r\n\r\n\"I've been wanting to cum like this ever since I wrapped up Kara in his little cocoon. Thanks for helping me out, bunny.\"\r\n\r\nHe cums down his throat within minutes, giving him a few pats on the cheek before turning his attention to Jyushi and taking off his blindfold."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47537857, "type": "ic", "edited": "2018-01-11T07:36:40.844731", "format": null, "posted": "2018-01-11T07:36:40.844731", "text": "Totty gags on Shin’s cock, unable to resist the man as he focuses all his attention on keeping his balance. Though he does sputter and cough once the man cums down his throat and he’s left with the taste lingering in his mouth.\r\n\r\nJyushi stares in fear at Shin, trying to make himself look as meek as possible. He’s the last of his brothers and he’s been waiting anxiously the entire time wondering when he was going to be picked by the man holding them captive."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47543997, "type": "ic", "edited": "2018-01-11T21:11:05.832812", "format": null, "posted": "2018-01-11T21:11:05.832812", "text": "Shin gives Jyushi a kiss on his taped mouth as a guard returns with a bit gag. The gag is shaped like a dog bone, fitting his new pet image.\r\n\r\nThe guard holds his nose before Shin jams it in, fastening it behind his head. Then dog ears are applied, and a suit similar to Ichi's is placed in front of him.\r\n\r\n\"You'll be my cute little puppy,\" Shin says as the guards force Jyushi's knees and elbows in the suit. \"How does that sound?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47548363, "type": "ic", "edited": "2018-01-12T01:06:44.344158", "format": null, "posted": "2018-01-12T01:06:44.344158", "text": "Jyushi practically howls around the big gag as it’s forced into place between his teeth. Worse yet is that the canine imagery is more uncanny with his ability to bare his teeth around the bone, trying and failing to shake the ears off while he’s forced into the suit.\r\n\r\nNow each of the Matsus had taken on their respective roles as pets - most with the ability to watch their other brothers’ torment as Shin put them into positions that would be impossible to escape on their own."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556133, "type": "ic", "edited": "2018-01-12T06:18:33.257859", "format": null, "posted": "2018-01-12T06:18:33.257859", "text": "Shin is pleased at the image in front of him. Sextuplets, each with distinct personalities, tied and completely helpless to do anything to stop his advances.\r\n\r\nHis attention shifts to Kara's mummified form, bound with so much tape that there's no way he'd be able to escape.\r\n\r\n\"Let's put you in your tank,\" Shin says, lifting Kara up with help from one of his guards. \"The rest of you will be staying in your own cages or habitats when I get back.\"\r\n\r\nHe moves Kara into another room, where a giant tank awaits them. Several heat lamps hang from the ceiling, dedicated to making Kara miserable in his layers of tape."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47556233, "type": "ic", "edited": "2018-01-12T06:24:23.218759", "format": null, "posted": "2018-01-12T06:24:23.218759", "text": "Unable to see the approaching figures, Kara twists and squirms when he’s touched for the first time since being mummified. With the latex mask he’s even more cut off from the outside world than his brothers, naturally sending him into a panic when he can’t make any guesses as to where he’s being carried off.\r\n\r\nJust barely he can hear the muffled cries of his brothers as he’s taken out of the room before they go completely silent.\r\n\r\nHe doesn’t even truly notice the difference however until the change in temperature. Even without having been in the room very long, he can already tell that he’s going to suffer wrapped in so many layers of tape."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556379, "type": "ic", "edited": "2018-01-12T06:32:45.083184", "format": null, "posted": "2018-01-12T06:32:45.083184", "text": "The two place Kara on his back, leaving him behind in the tank to suffer in the heat. When they come back to the room with the others, Shin focuses his attention on Ichi.\r\n\r\n\"You're still a horny mess...\" he whispers, gently tugging on his nipples. \"But I'm not going to let you cum until you prove to me you're a good kitty.\"\r\n\r\nHe kisses him on the forehead, lifting him up and carrying him to a large cage before locking him inside. He makes sure to put him on his back again, just to make sure he won't get himself off somehow."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47556492, "type": "ic", "edited": "2018-01-12T06:37:57.370875", "format": null, "posted": "2018-01-12T06:37:57.370875", "text": "It doesn’t take any longer than a few minutes before Kara begins to sweat profusely in his new form, panting through the boxer gag and the latex mask and squirming on his back in search of any kind of relief.\r\n\r\nAnd just as Shin says, Ichi is still a horny mess under the effects from the drug. His buds are extremely sensitive to the touch and he moans around the purple ball gag, hips twitching and trying to find friction for his aching cock. \r\n\r\nHe can’t even fight as he’s placed inside the cage, mewling and crying in discomfort."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556617, "type": "ic", "edited": "2018-01-12T06:45:03.292516", "format": null, "posted": "2018-01-12T06:45:03.292516", "text": "Shin focuses on Choro next, his body still suspended in the air with his buds being tugged on by the weighted clamps.\r\n\r\n\"We need to move you to your cage, birdie,\" he teases as he undoes the rope from the ceiling,his guards helping transport him to the giant bird cage in another room. They hang him from the ceiling in the cage, tugging at his clamps but not taking them off as they leave him alone, moving onto the next sextuplet."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47556703, "type": "ic", "edited": "2018-01-12T06:49:57.022548", "format": null, "posted": "2018-01-12T06:49:57.022548", "text": "Choro groans through the ring gag, a significant amount of drool having spilled down the front of his suit and onto the floor. There’s no feasible way for him to resist as he’s positioned properly within the cage, regretting his obstinance every time the clamps are pulled and the weights are left swinging back and forth.\r\n\r\nThe human sized bird cage doesn’t give him any hope either as he watches the men close the door behind them. Even if he could get down, he wouldn’t be able to open the cage door."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47556877, "type": "ic", "edited": "2018-01-12T07:00:30.291321", "format": null, "posted": "2018-01-12T07:00:30.291321", "text": "The men return to focus on Oso, his body completely paralyzed as the pet sloth. Shin's bodyguards put him in a large cage as well, giving him the opportunity to move around for a short time with a press of the button's remote.\r\n\r\nShin brings his attention to Totty, motioning him over towards his desk.\r\n\r\n\"You can be my lucky rabbit while I work, giving me blowjobs all day. How does that sound, bunny boy?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47556964, "type": "ic", "edited": "2018-01-12T07:05:14.133944", "format": null, "posted": "2018-01-12T07:05:14.133944", "text": "Oso practically tumbles over himself as the electricity releases its hold on him. Breathing heavily he slowly begins to explore the cage before he can be frozen again.\r\n\r\nTotty looks at Shin warily as he speaks. “Nwah,” he slurs, shaking his head quickly before managing to hop a little ways away from the desk. It’s difficult to properly keep his balance and the butt plug shifts inside him with the movement."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557129, "type": "ic", "edited": "2018-01-12T07:15:20.582942", "format": null, "posted": "2018-01-12T07:15:20.582942", "text": "Shin's guards stop Totty from moving very far, giving him a smack on the ass as punishment for disobeying.\r\n\r\nShin doesn't say anything as he pulls out a pair of nipple clamps, attaching them to Totty's buds and yanking them upwards.\r\n\r\n\"Wrong answer,\" he says, giving his ass another smack. \"You're going to suck my cock when I tell you to, got it? Now, say 'Yes, master' like a good boy...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47557191, "type": "ic", "edited": "2018-01-12T07:21:38.752281", "format": null, "posted": "2018-01-12T07:21:38.752281", "text": "Totty cries out as his nipples are clamped and tugged, tears beginning to form in the corners of his eyes as he ducks his head submissively. He couldn’t help that he wasn’t any good when it came to pain.\r\n\r\n“Yeh mahter.” Comes his obedient response, shivering from his crouched position."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557248, "type": "ic", "edited": "2018-01-12T07:27:35.468920", "format": null, "posted": "2018-01-12T07:27:35.468920", "text": "Shin pats Totty on the cheek affectionately, scooting him towards his assigned area under the desk.\r\n\r\n\"Don't worry, I'll feed you while I'm working, so you won't go hungry,\" Shin assures his pet before turning to Jyushi, a guard attaching a collar and leash to his neck.\r\n\r\n\"My little puppy has his own cage as well. The guards will lead you to it.\"\r\n\r\nSure enough, the guards tug him along, locking him inside a cage with an empty dog bowl."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47557281, "type": "ic", "edited": "2018-01-12T07:31:41.020880", "format": null, "posted": "2018-01-12T07:31:41.020880", "text": "Totty can think of nothing more to do than to simply make himself comfortable underneath the desk. A task easier said than done when he’s forced into the crouching position with his arms out in front of him.\r\n\r\nThe newly made puppy, having seen his younger brother’s treatment when he refused, is complicit in being led into the cage. He even noses the empty bowl curiously as he chews on the bone bit."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557411, "type": "ic", "edited": "2018-01-12T07:40:04.401720", "format": null, "posted": "2018-01-12T07:40:04.401720", "text": "With every pet locked away for the night, Shin decides to give his snake one last look before going off to bed.\r\n\r\nHe enters the room, able to feel the heat of the lamps even when he's outside the tank. He peeks inside, taking a look at Kara in his tape cocoon and chuckling to himself as he massages the bulge in his pants.\r\n\r\nShin's sure he can handle it. He'll give him some water and food in the morning to make up for it."}]