[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47557510, "type": "ic", "edited": "2018-01-12T07:48:24.532554", "format": null, "posted": "2018-01-12T07:48:24.532554", "text": "Even despite having habitats that were better than others, all the Matsus endure a long night of fitful sleep. In their new predicaments they’re completely miserable and frightened but are unable to fight off sleep once it comes to their exhausted forms.\r\n\r\nKara is the first to fall asleep, slowly losing consciousness under the heat lamps as the hours pass. Choro shifts between waking and sleeping every so often as his suspended form sways and scares him awake throughout the night. Jyushi is quick is curl up in the far corner of his cage, hoping that this is all just a horrible dream - joined by Oso who occasionally wakes up to check that he’s still able to move and isn’t paralyzed. Ichi spends half the night mewling and rattling his cage until the drug wears off and he’s finally able to sleep.\r\n\r\nOnly Totty is the least restrained of the six brothers, simply kept underneath Shin’s desk. Though he doesn’t dare hop out from underneath while he’s still being punished by the clamps."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47557724, "type": "ic", "edited": "2018-01-12T08:10:38.440973", "format": null, "posted": "2018-01-12T08:10:38.440973", "text": "When morning comes, Shin's first thought is what he'll do to his new pets today. He sends his guards out to wake them up, gathering them in front of his desk with the exception of Totty, who stays underneath.\r\n\r\n\"Good morning. Did my pets sleep well?\" He comes by to give them all hair ruffles, sitting back down at his desk afterwards.\r\n\r\n\"I was think of taking my kitty and puppy for a walk. The rest of you can take a break for most of the day.\"\r\n\r\nThe clamps are removed from both Choro and Totty, their nipples red and puffy from being clamped for hours."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47557827, "type": "ic", "edited": "2018-01-12T08:17:40.426244", "format": null, "posted": "2018-01-12T08:17:40.426244", "text": "Choro and Totty both whine in pain as the blood rushes back into their nipples, sniffling and holding back tears.\r\n\r\nThe rest of the brothers seem wary that they’re being let off the hook so easily after being captured, but the kitty and puppy in question share an uneasy glance in one another’s direction as they’re singled out."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47572092, "type": "ic", "edited": "2018-01-13T04:01:29.156982", "format": null, "posted": "2018-01-13T04:01:29.156982", "text": "The guards attach leashes to Ichi and Jyushi, handing both of them to Shin. He takes them, tugging them towards the door.\r\n\r\n\"My guards might have their way with you while I'm out, and I'm not going to do anything to stop them,\" he announces with a smirk. \"Have fun, my precious pets.\"\r\n\r\nHe leads Ichi and Jyushi out the door, a gentle breeze blowing over the three as he walks towards the park."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47572245, "type": "ic", "edited": "2018-01-13T04:09:17.550587", "format": null, "posted": "2018-01-13T04:09:17.550587", "text": "Ichi and Jyushi stumble after Shin, trying to become accustomed to moving in the bitchsuits without having the leashes drag them too much. Jyushi is quick to get the hang of crawling along, picking up his pace to be at Shin’s heel as an actual dog would be.\r\n\r\nThe eldest of the two has a harder time with movement but manages to not get himself choked until he becomes distracted by the park."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47572617, "type": "ic", "edited": "2018-01-13T04:25:20.328604", "format": null, "posted": "2018-01-13T04:25:16.349371", "text": "Several people are present at the park, some of their attention focused on Shin and his two pets. One even approaches him and asks to pet Jyushi, apparently fine with the fact that they were humans on leashes and not actual animals.\r\n\r\nThe bystander gives Jyushi a few ruffles of the hair, following it up with a kiss on the forehead before walking off, unfazed.\r\n\r\n\"I'm a very popular man,\" Shin explains. \"My lifestyle is surprisingly well-respected around here. Don't be surprised if someone asks to play with you a bit.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47572767, "type": "ic", "edited": "2018-01-13T04:31:59.141031", "format": null, "posted": "2018-01-13T04:31:59.141031", "text": "Jyushi wrinkles his nose as his hair is ruffled like an animal’s. At this point he’s mostly figured that it would be easier to get by if he just played along. A loyal dog was often a well treated dog anyway, at least from his perspective. \r\n\r\nSlipping into his new role, the younger Matsu makes himself comfortable in the grass and simply sets to gnawing on the bone gag since it seemed like they were making a stop at the park anyhow.\r\n\r\nIchi can only roll his eyes at his brother’s obedience, maneuvering himself so his legs are splayed on either side of himself in a sitting position with his arms in front as he observes the rest of the park."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47572976, "type": "ic", "edited": "2018-01-13T04:39:44.240270", "format": null, "posted": "2018-01-13T04:39:44.240270", "text": "After a few minutes, a man comes by, talking with Shin about how cute Ichi is. Payments are swapped as the master is handed a large sum of money, the man taking his position behind Ichi as he's forced on his knees and elbows once more.\r\n\r\n\"This man is going to have some fun with you, kitten. Be a good boy for him.\"\r\n\r\nThe man lubes up, inching himself inside Ichi's hole and giving it a nice pounding."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47573113, "type": "ic", "edited": "2018-01-13T04:44:42.191608", "format": null, "posted": "2018-01-13T04:44:42.191608", "text": "Ichi grunts in annoyance as he’s put on his knees and elbows again, drool pulling through the corners of the ball gag as he’s fucked by the stranger.\r\n\r\nThe younger Matsu lifts his head to watch the spectacle before quickly returning to the bit between his teeth. As long as he didn’t catch anyone’s attention he’d be spared the embarrassment of being used in public."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47573216, "type": "ic", "edited": "2018-01-13T04:49:45.539294", "format": null, "posted": "2018-01-13T04:49:45.539294", "text": "The man cums before long, giving Ichi a smack to the ass before leaving on his merry way.\r\n\r\n\"Don't be surprised if someone uses you soon, puppy,\" Shin chuckles, giving him a pat to the cheek.\r\n\r\nSure enough, another man comes up with interest in Jyushi, paying Shin and lubing up before thrusting inside him. He's a bit harsher than Ichi's assailant, giving him smacks while he's fucking him and after he's cum inside him."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 47573300, "type": "ic", "edited": "2018-01-13T04:53:27.619294", "format": null, "posted": "2018-01-13T04:53:27.619294", "text": "With both Matsus fucked and leaking cum so early on their walk, it doesn’t take long before they’re both completely miserable. Jyushi sniffles as he tries to find a comfortable position for his sore ass after being spanked so much during and after the man had chosen to play with him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 47573906, "type": "ic", "edited": "2018-01-13T05:21:16.593840", "format": null, "posted": "2018-01-13T05:21:16.593840", "text": "Shin leads them home after Jyushi's harsh treatment, a few more people passing them and giving them pats and kisses.\r\n\r\nWhen they get home, the boys are locked up again, with the exception of Choro, who's been hung from the ceiling, and Totty, mouth open from the nose hook as several guards line up in front of him with their cocks out. Cum decorates his face.\r\n\r\n\"I see my pets have been busy,\" Shin laughs, attention shifting on Choro."}]