[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53431267, "type": "ic", "edited": "2018-12-11T04:43:18.312104", "format": "raw", "posted": "2018-12-11T04:43:18.312086", "text": "Office testing!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53431270, "type": "ooc", "edited": "2018-12-11T04:43:32.591868", "format": "raw", "posted": "2018-12-11T04:43:32.591868", "text": "Reporting for duty!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53431481, "type": "ooc", "edited": "2018-12-11T04:54:14.455023", "format": "raw", "posted": "2018-12-11T04:54:14.455023", "text": "(( welcome aboard! I think a good place to start it would be Choro being given a tour of his workplace, in which he gets led into the boss's office and stuffed into a sack\r\n\r\nI could also wrote the starter"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53431525, "type": "ooc", "edited": "2018-12-11T04:56:23.381180", "format": "raw", "posted": "2018-12-11T04:56:23.381180", "text": "That sounds amazing! It’s definitely a good place to start and if you wouldn’t mind starting thatd be fantastic"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53431773, "type": "ic", "edited": "2018-12-11T05:10:45.246609", "format": "raw", "posted": "2018-12-11T05:10:45.246609", "text": "At first glance, The Tanaka Corporation seemed like a regular company. Granted, the name didn't give away anything about its purpose, so without prior research, it would be easy for someone to mistake it for a non-threatening corporation.\r\n\r\nDigging deeper, however, one would discover TTC's true nature. Truth be told, the company specialized in bondage equipment, specifically ones designed for heavier BDSM play. Several machines had been in the works, all they needed was testing.\r\n\r\nWhen Tatsuro Tanaka interviewed Choromatsu Matsuno, he seemed blissfully unaware what kind of company TTC truly was. Tanaka didn't say anything to make him think otherwise, giving him a very generic interview before approving him days later. Now, he was leading Choro to his office as a part of a tour.\r\n\r\n\"If you have any questions or concerns, just come up here and I'll help you in any way I can.\" Tanaka gives Choro a smile as he opens the door, saying nothing about the sack laid out on the floor in front of his desk."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53431946, "type": "ic", "edited": "2018-12-11T05:19:37.594095", "format": "raw", "posted": "2018-12-11T05:19:37.594095", "text": "Now that he was employed, Choromatsu had felt a rush of relief that lasted several days - ranging from the day he got the call that he’d been accepted as an official employee of TTC to today. His brothers might not have been worried about finding gainful employment now that they were grown but he’d always been on the verge of real panic the longer he went without a job. From today onward, he wouldn’t have to worry about that. \r\n\r\nHe’d done his best to look presentable for his first day on the job, sporting a new haircut and a suit that he’d been saving for a special occasion. Its fabric clinging to his form attractively. Choromatsu had wanted to look his best for his employer - the CEO himself as he’d been looking for a new secretary to replace the one who’d left days before Choromatsu’s own interview.\r\n\r\nThe nature of the company goes unnoticed by Choromatsu as he’s given a brief tour of the facilities - ending in the office that he’d be working outside of for as long as he kept the job.\r\n\r\n“If you don’t mind my asking,” he starts, hands partially in his pockets as he enters the room. “Why did your old secretary leave?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53432165, "type": "ic", "edited": "2018-12-11T05:34:06.710144", "format": "raw", "posted": "2018-12-11T05:34:06.710144", "text": "Truth be told, the old secretary didn't leave. Instead, Tanaka had grown bored of him after he had been broken in over the course of several months. Instead of keeping him around his office, Tanaka gave him to an employee.\r\n\r\n\"Oh, that's not important,\" he brushes off the question as he places a firm hand on Choro's shoulder. \"What's important is that you're a part of this company now.\"\r\n\r\nTanaka looks over Choro's body, his suit clinging his frame nicely. Not that it would matter, considering he'd be stripped naked and stuffed inside a sack for a few hours.\r\n\r\nTanaka locks the door behind him, gripping onto both of Choro's shoulders even tighter now.\r\n\r\n\"If you want to keep this job, you'll need to know that my orders are absolute,\" he explains, forcibly turning Choro to face him. \"First order of business: I want you to take off all of your clothes.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53432367, "type": "ic", "edited": "2018-12-11T05:45:56.141539", "format": "raw", "posted": "2018-12-11T05:45:56.141539", "text": "No, Choromatsu supposes it isn’t. It likely didn’t even have anything to do with the company itself. If anything, he should be grateful that there was an opening in the company at all. From what research he’d found after seeing the job posting TTC was an extremely private company that didn’t have a lot of new hires from year to year. Most employees seemed to be grandfathered in or managed to somehow get their foot in the door before the employment rate started to drop. \r\n\r\n“You’re right, sorry. I’m happy to be on board, sir, really. It’s an honor to be working with such a prestigious company.”\r\n\r\nAnd with a nice, cushy job too. The actual job advert hadn’t had a salary listed but Choromatsu had asked around and apparently personal secretaries made a pretty penny from year to year. Benefits of being so close to the boss he figured.\r\n\r\n“Wait...what?”\r\n\r\nHe winces at the almost painful grip Tanaka has on his shoulders, brows furrowing in confusion when the man locks the door. Things become clearer when he asks him to strip though. \r\n\r\nChoromatsu’s shoulders slump as he faces the CEO. This...couldn’t be good. Barely five minutes in and he was already being threatened with the possibility of being fired. Something is off about the whole situation but Choro really wants to keep this new job. If he showed up back at the house after being gone for only an hour his brothers would laugh their asses off about him blowing his chance at employment.\r\n\r\nRelunctantly, Choro begins to unbutton his jacket and slip it off from around his shoulders, closely followed by his crisp dress shirt. For a moment he hesitates, hoping that it’s just a joke, but when he isn’t told to stop he undoes his belt and begins to slide off his socks, shoes, pants, and underwear."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53432692, "type": "ic", "edited": "2018-12-11T06:04:49.917342", "format": "raw", "posted": "2018-12-11T06:03:53.957356", "text": "Tanaka's gaze is fixed on Choro as he strips down to nothing, a small smirk lighting up his face. He isn't particularly well-built, but he was attractive in his own right. Definitely a body Tanaka would have fun groping and tormenting.\r\n\r\n\"Good boy,\" he praises, his hand reaching up to stroke Choro's face. \"You look even better naked. Now hold still... I need to make sure your arms and legs are nice and snug before the testing.\"\r\n\r\nTanaka grabs for a roll of tape, shoving Choro's arms behind his back before wrapping them together. His legs are soon to follow, taped together before he bends Choro's waist until his cheek is resting on the desk.\r\n\r\nTanaka retrieves the underwear Choro discarded moments earlier, shoving them in front of his face. He still hasn't explained his true motives, waiting for him to open his mouth so he can force them inside."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53432806, "type": "ic", "edited": "2018-12-11T06:12:04.120158", "format": "raw", "posted": "2018-12-11T06:12:04.120158", "text": "The hungry look on Tanaka’s face doesn’t bode too well for Choromatsu’s fate. He closes an eye when the man pets his cheek, not quite sure what’s about to transpire between them. Was this just part of being a secretary? It might explain why the salaries he’d found online were so high. Though he didn’t really have any other job to compare it to. \r\n\r\nHe can’t even force himself to move when Tanaka orders him to be still, standing nearly ram rod straight throughout the ordeal as his mind wanders. The tape bindings force him into holding a strange posture, shoulders back and chest thrust forward as his new boss starts the same process on his legs. \r\n\r\nNow he’s practically immobile, bent over until his face is pressed against the top and his cock is bumping the side of the desk. He still can’t come up with any real explanation for why this might be happening but he opens his mouth anyway and allows his underwear to be stuffed inside."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53440296, "type": "ic", "edited": "2018-12-11T22:53:25.342163", "format": "raw", "posted": "2018-12-11T22:53:25.342163", "text": "Choro's reluctant obedience pleases Tanaka, who was used to dealing with uncooperative secretaries on the first day. He knows he has Choro in a very vulnerable position, with him threatening to take his job away if he disobeyed him. Unbeknownst to him, the job wouldn't be giving any pay or work experience.\r\n\r\n\"You're being a very good boy, Choro,\" he praises, running his hands down his back and stopping on his ass. \"So obedient, like a good little secretary.\"\r\n\r\nTanaka digs his nails into the globes of Choro's ass, squeezing and kneading it for a moment before giving it a harsh smack.\r\n\r\n\"Do you know why I chose you to be my secretary?\" He asks, although Choro can't respond. \"It's because you were so unaware of what I truly want to use you for. See, I want you to be my bondage toy, completely helpless to anything I choose to do to you.\"\r\n\r\nHe gives his ass another smack before leaning into his ear, whispering.\r\n\r\n\"You'll be stuck in this place until I grow bored of you, then I can just sell or give you away. So be a good little toy and don't disappoint me.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53441515, "type": "ic", "edited": "2018-12-12T00:13:32.807730", "format": "raw", "posted": "2018-12-12T00:13:32.807730", "text": "A shiver runs up Choromatsu’s spine at the same time that his new boss’s hands run down it. Offsetting it is the rush of pride that goes through him with Tanaka’s praise. He might have been confused about the nature of the job but at least he was making his boss happy. That had to count for something. \r\n\r\nThere’s a muffled yelp that emanates from behind the underwear stuffed in his mouth when Tanaka’s nails rake across his ass, shortly smoothed over when the man begins to knead the soft flesh, and stinging again when he’s spanked.\r\n\r\nIt really shouldn’t jump straight to his cock, which begins to grow stiff with an erection that Choromatsu isn’t sure if he appreciates being trapped against the desk. Especially when Tanaka reveals his true intentions and he realizes that in his predicament there’s nothing he can do to stop the man."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53446860, "type": "ic", "edited": "2018-12-12T05:42:52.169194", "format": "raw", "posted": "2018-12-12T05:42:52.169194", "text": "Tanaka gives Choro's earlobe a quick nibble before pulling him away from the desk, standing him straight up to examine his body. When his eyes fall on his boner, he chuckles.\r\n\r\n\"I guess you like being treated like this, huh?\" He teases as he strokes his cheek. \"In that case, we're going to have a lot of fun together these coming months.\"\r\n\r\nHe doesn't do anything to relieve Choro of his arousal, instead focusing on maneuvering his body into the sack laid out on the floor.\r\n\r\n\"This company focuses on producing bondage equipment, so you'll be helping us test out our new products,\" he explains as he fastens him snug inside. \"I'm going to tell you ahead of time that these products aren't for the faint of heart. You'll probably break down a few times. But you'll eventually get used to it. That's what happened to my last secretary before I gave him away.\"\r\n\r\n\"This bondage sack is meant to be durable, so I want you to see how well you maneuver while you're trapped inside. Roll around, squirm and thrash, do whatever you can to try to get out. Not only does it help with testing, it's also very fun to watch.\"\r\n\r\nHe ruffles Choro's hair before zipping up the sack, taking one last look at his face before zipping it up completely."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53447322, "type": "ic", "edited": "2018-12-12T06:13:19.784673", "format": "raw", "posted": "2018-12-12T06:13:19.784673", "text": "In all honesty, Choro is just as surprised by his arousal as Tanaka seems to be. The idea of being the man’s toy and guinea pig shouldn’t make his cock jump to attention like this, leaking precum when Tanaka nibbles on his ear.\r\n\r\nThey were quickly verging out of the relationship between boss and employee to owner and toy, and Choro grunts through the gag when the thought sends another jolt of pleasure straight to his cock. It’s...almost appealing in a way that could only be seen by one of the Matsuno brothers - not being expected to do much of anything. Other than test out bondage it would seem.\r\n\r\nChoro stares into Tanaka’s eyes, tears beginning to build up as he came to the startling realization that this might just be his life from here on out, as he’s lowered to the floor and into the sack. That answered the question that had lingered in the back of his mind since entering the office at the very least.\r\n\r\nOnce the zipper is closed up and Choromatsu is left alone in the form fitting sack to wait in darkness, he can only freeze up - processing the last five minutes and trying to come up with any other reason for why his dick is still hard. Then there’s movement. \r\n\r\nThe sack rocks back and forth on the carpet as Choro aims to put the weight off of his arms. There’s little to no maneuverability in the heavy bondage and it takes several minutes before he even manages to get onto his side."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53447589, "type": "ic", "edited": "2018-12-12T06:34:45.289959", "format": "raw", "posted": "2018-12-12T06:34:45.289959", "text": "Tanaka watches as his plaything attempts to squirm, not able to do much of anything. It was always a fun sight to watch his toys struggle, but there's something fascinating about Choro in particular as he watches him eventually roll onto his side.\r\n\r\nTanaka rolls the sack so Choro is lying on his stomach, running his hands over his heavily bound body. He continues to roll the sack along the floor, taking note of his bulge once he's on his back again. With a smirk, he cups his hand over the bulge and gently rubs it.\r\n\r\n\"Feels good, doesn't it?\" He muses as he increases the friction. \"If you really want to cum that bad, you'll have to do everything I say. I'll let you out in a little bit, but until then, be a good boy and keep squirming.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53447724, "type": "ic", "edited": "2018-12-12T06:46:22.095247", "format": "raw", "posted": "2018-12-12T06:46:22.095247", "text": "Lack of vision does nothing for Choro’s flashes of panic. What was the layout of the office again? How close was he to bumping himself against the desk? Similar questions race through his mind the longer he’s left to sweat it out in the sack with no functioning use of his arms or legs. Having those unbound would have made it a lot easier to move in the sack, he supposed.\r\n\r\nA muffled grunt of surprise comes with Tanaka rolling him onto his stomach. A welcome change from being on his back but he could have gone without being startled by the sudden movement. And then he’s on his back again, squirming and moaning as Tanaka rubs the mound that his cock has created in the sack. \r\n\r\nHe can’t hardly make out the man’s muffled words but he doubts it’s a major change from what he’d been saying right up until he was zipped inside the sack."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53447946, "type": "ic", "edited": "2018-12-12T07:03:49.616038", "format": "raw", "posted": "2018-12-12T07:03:49.616038", "text": "Tanaka spends a few more minutes teasing Choro's bulge before unzipping him and giving a cruel smile. His erect cock is uncovered now, the precum from earlier still visible.\r\n\r\n\"You know,\" he says in a low, smooth tone. \"I think that cute cock deserves a bit of relief now. I wonder how fast I can make you cum?\"\r\n\r\nTanaka begins to stroke Choro's cock, pumping at a slow and steady rhythm. His other hand rubs at the head, smearing precum against the tip.\r\n\r\nHe has no intention of letting him cum quite yet, and once he feels that Choro is on the edge, he pulls back completely.\r\n\r\n\"I'll let you cum once you've proven to me that you're a good little toy,\" he mocks with a pat to the cheek. \"I'll be keeping an eye out for any bad behaviors, understand?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53448042, "type": "ic", "edited": "2018-12-12T07:11:51.990210", "format": "raw", "posted": "2018-12-12T07:11:51.990210", "text": "There’s a glazed look in Choro’s eye when Tanaka unzips him. Despite not having been in the sack for very long, his inexperience with such bondage made the time seem like an eternity - made that much worse by the man rubbing his trapped cock until he thought that he might lose his mind. \r\n\r\nHe can’t help but to nod along with Tanaka. Cumming might help him clear his head and get a better handle on the situation without his libido making things fuzzy. Choro already knows that his stamina is next to nothing and while it might be humiliating to orgasm after a few strokes on his cock, it wouldn’t even compare to the rush of bliss that would wash over him.\r\n\r\nChoro wiggles with pleasure as Tanaka starts to give his cock much needed attention, firm grip not allowing him to cum when he knows he reached his limit. He keens loudly to voice his displeasure when Tanaka lets go.\r\n\r\nHe was already being good, wasn’t he? Choro squirms on his back, cock waving in the open air as he tries and fails to do anything that might give him some release."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53448225, "type": "ic", "edited": "2018-12-12T07:27:44.103218", "format": "raw", "posted": "2018-12-12T07:27:44.103218", "text": "Tanaka shakes his head at Choro's attempt to get off, giving him a rough smack to the hip as punishment.\r\n\r\n\"Don't even think about cumming unless I tell you to,\" he sneers, nails digging into the flesh of his hips. \"If you disobey me, you'll be punished. If you do anything I don't like, you'll be treated like the disgusting little pervert you are. Don't think you can get out of this easy, I'll be keeping a close eye on you to make sure you don't screw up.\"\r\n\r\nHe gives him another smack to the hip before standing up to retrieve a riding crop from his desk drawer, showing it off to Choro.\r\n\r\n\"Trust me, this sort of thing will be the least of your worries.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53448279, "type": "ic", "edited": "2018-12-12T07:36:17.867473", "format": "raw", "posted": "2018-12-12T07:36:17.867473", "text": "The smack carries through its intended purpose. Choromatsu stops moving almost immediately after the sting in his hip subsided. Right, he needed to be good on Tanaka’s terms. He could do that. \r\n\r\nHe whines pathetically when the man’s nails sink into the flesh of his hips, more precum leaking from his cock as he did his best to remain absolutely still. Tanaka probably wasn’t wrong, he probably was a disgusting little pervert for even trying to get off on this. \r\n\r\nApologies are immediately muffled by the underwear still stuffed in his mouth but Choromatsu doesn’t dare try to spit it out. The thought sends him into a brief spiral. How was he supposed to tell Tanaka that he was sorry without being able to speak?\r\n\r\nThe sight of the riding crop terrifies him but presents him with the perfect opportunity to make things up with Tanaka. He wanted to be a good boy that was allowed to cum. Choromatsu grunts as he strains his shoulders and uses the momentum to push himself a couple centimeters off the floor, trying to present himself to his boss for punishment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53448363, "type": "ic", "edited": "2018-12-12T07:48:23.749835", "format": "raw", "posted": "2018-12-12T07:48:23.749835", "text": "Tanaka chuckles at the sight in front of him, finding it amusing that Choro is willing to degrade himself like this just to cum. Once he's finished presenting himself to be punished, Tanaka smacks the crop against his erection.\r\n\r\n\"Hurts, doesn't it?\" He taunts, giving him another smack. \"How much can you take, Choro? How about four whole minutes of it?\"\r\n\r\nHe lands yet another smack to his cock, the crop coming down faster and faster each time, with more swats in quick succession.\r\n\r\n\"Maybe next time you'll think twice before trying to cum without permission,\" Tanaka sneers as he lands a final swat on his poor cock."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53448435, "type": "ic", "edited": "2018-12-12T07:57:42.877033", "format": "raw", "posted": "2018-12-12T07:57:42.877033", "text": "Choro wants to take the man’s amusement as a good sign. It had to mean that he’d done the right thing by submitting himself for punishment, right? His head is practically spinning as he finds himself going over his actions in search of another way that he could try and please the man. At this point he couldn’t even say if it was solely about the need to cum at this point, the lengths he was willing to go to.\r\n\r\nHis resistance had been minimal and other than this offense he’d been obeying Tanaka to the letter. He couldn’t be sure because he’d never been exposed to this side of himself before but Choro was starting to think that he was just pleased to receive some direction in his life after so many years. And if he had to debase himself and become little more than an object to continue being praised as a good boy, then...he’d keep doing it, no questions asked.\r\n\r\nStill, he can’t help but to howl in pain each time the riding crop makes a connection with his cock. There’s no pleasure in the feeling at all, only sharp pain that lingers until the next swat with the crop. He doesn’t think that he could handle an entire minute of this torture, much less four, but he finds himself nodding eagerly anyway - tears falling freely down his cheeks as his cock throbs in pain."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53453078, "type": "ic", "edited": "2018-12-12T19:29:03.917980", "format": "raw", "posted": "2018-12-12T19:29:03.917980", "text": "The tears falling down Choro's cheeks further arouse Tanaka, who traces the crop along his body up to his chest and smacks down on one of his nipples.\r\n\r\n\"You look so cute shedding tears like this,\" he coos, giving his nipple another smack with the crop. \"It suits you. I almost want to punish you more frequently just to see that tearful face.\"\r\n\r\nHe's back to tracing the crop against his cock, landing a few quick smacks along the head. The assault to his nipples and cock continue for the remainder of the punishment, Tanaka figuring that he's made his point.\r\n\r\nPutting the crop away, Tanaka wipes away some of Choro's tears, leaning down to kiss the remainder away.\r\n\r\n\"I'm sure you've learned your lesson by now, Choro-chan,\" he whispers. \"I hope I'm right.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53453384, "type": "ic", "edited": "2018-12-12T19:57:09.559301", "format": "raw", "posted": "2018-12-12T19:57:09.559301", "text": "It hurts less than the previous assault on his cock, but there’s still a painful sting that accompanies the first swat to his nipples. They hadn’t escaped his arousal either, hardened into little nubs that refuse to go down when smacked. Though it does serve to make the hits hurt more.\r\n\r\nThen it’s back to his cock and Choro does his best to not shy away from his punishment. He deserved this for not doing what his boss...owner wanted. He’d try better next time but he wouldn’t learn anything if he tried to avoid punishment.\r\n\r\nChoro takes several breaths when Tanaka finally sets the crop down. It felt like an eternity but he managed to get through his punishment like he thought a good boy would. And he’s reward with his tears being kissed away to build on that thought.\r\n\r\nAt the final statement, Choro nods again - ignoring that his cock is still painfully hard and leaking precum."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53453566, "type": "ic", "edited": "2018-12-12T20:09:55.894871", "format": "raw", "posted": "2018-12-12T20:09:55.894871", "text": "Tanaka gives Choro's nipples a gentle pinch before pulling away, pleased with his obedience so far. He wasn't used to past secretaries acting like this - more used to them screaming and thrashing at any chance they could. However, he decides he likes this obedience too, especially when the toy was as cute as Choro.\r\n\r\nTanaka ignores his erect cock as he rummages around the desk drawer, pulling out a ring gag and showing it off to Choro before taking the boxers out of his mouth.\r\n\r\n\"Good toys are always ready to please their owners in any way they can. Understand? Now, is there anything you'd like to say before I gag you again?\""}]