[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53453714, "type": "ic", "edited": "2018-12-12T20:24:26.677531", "format": "raw", "posted": "2018-12-12T20:24:26.677531", "text": "Choromatsu whines softly when Tanaka pinches his bruised nipples but offers no resistance to what is being done to him. Definitely a disgusting pervert then.\r\n\r\nTrying to ignore his cock in the same way Tanaka is, Choro follows the man around the room as he starts to rifle through a desk drawer. A good boy would probably show his owner rapt attention no matter what.\r\n\r\nHe works the tension from his jaw when he’s ungagged, mouth dry from how his underwear soaked up his saliva. He takes the time to figure out how best to reply. If he were thinking rationally he would probably plead to be let go, but Choro is more than aware that doing so would likely lead to another punishment and even more humiliation.\r\n\r\nTanaka already had him at his mercy when he’d taped up his arms and legs, he didn’t have any reason to let him go.\r\n\r\n“I...I understand,” Choro mumbles, eyes downcast before something else comes to his attention. “Could you help me, please? I want to be good, I promise, but I don’t know how long I can hold it in!”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53462042, "type": "ic", "edited": "2018-12-13T06:24:53.183363", "format": "raw", "posted": "2018-12-13T06:24:53.183363", "text": "Tanaka thinks for a moment at Choro's plea. There's something about Choro's desperate voice and overall obedience that makes Tanaka want to hear him out, if only for a moment.\r\n\r\n\"What is it?\" He asks, finger tracing along his stomach and creeping closer to his cock. \"Something on your mind? Maybe something I can help you with? Just tell me, and I'll see what I can do.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53462164, "type": "ic", "edited": "2018-12-13T06:40:01.477242", "format": "raw", "posted": "2018-12-13T06:40:01.477242", "text": "“I...” Choromatsu trails off listlessly for a moment as he racks his brain for the semblance of an idea. He doesn’t quite know what he’s looking for out of Tanaka but he feels as if trying his best to get the idea across is enough.\r\n\r\n“I don’t want to come without your permission...sir. Is there anything that would help with that?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53491151, "type": "ic", "edited": "2018-12-15T06:16:05.782341", "format": "raw", "posted": "2018-12-15T06:16:05.782341", "text": "\"Ah, I see,\" Tanaka says with a smile. \"You want to be a good boy for me so bad. I admire that about you.\"\r\n\r\nHis finger creeps up to Choro's mouth, tracing it along his soft bottom lip before nudging it inside and pressing down on his tongue.\r\n\r\n\"I think a cock ring would help with that problem. Then you wouldn't be able to cum at all unless I take it off. How does that sound, Choro?\"\r\n\r\nTanaka's finger exits his mouth and wipes the excess on his chest while he waits for a response. Regardless of his response, he still plans to use a cock ring on him, fond of the idea of Choro wearing it."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53494654, "type": "ic", "edited": "2018-12-15T15:57:21.055706", "format": "raw", "posted": "2018-12-15T15:57:21.055706", "text": "Choromatsu whines at the praises, the excitement rushing straight to his cock and leaving him a whimpering mess as he continues to hold it in. Being a Matsuno meant several things, most of all that they didn’t usually do anything - at least nothing that would have someone complimenting them the way Tanaka is now.\r\n\r\nIt’s half blackmail and half desperation that’s behind Choro falling into obedience so quickly. He wanted to keep his job but the more that Tanaka praised him, the more desperate he became to hear more.\r\n\r\nThere’s hardly no resistance at all when Tanaka pushes his finger inside other than a small gag of surprise when the man presses down on his tongue. It’s nearly as effective as an actual gag the way it steals his voice and sets him to salivating around Tanaka’s finger.\r\n\r\nHe lowers his chin as best he can to try and nod, drool spilling around Tanaka’s finger before he brings his head back up. “Uh-hauhn! Pweah?”\r\n\r\nThen Tanaka’s finger is gone and he realizes that he didn’t need to be so quick to respond. “Please, sir. I want the cock ring so I can be good for you.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53494761, "type": "ic", "edited": "2018-12-15T16:09:50.591642", "format": "raw", "posted": "2018-12-15T16:09:50.591642", "text": "Tanaka chuckles at Choro's eager-to-please attitude as he gently ruffles his hair.\r\n\r\n\"That's a good boy,\" he praises again before leaning down to kiss him on the lips, his tongue brushing against Choro's for a brief moment before pulling away.\r\n\r\nTanaka stands up, leaving Choro momentarily to look through his desk drawers. It takes him a while, but he eventually finds the ring tucked away behind a few other toys. He walks back over to Choro, presenting the ring to him before sliding it down his cock and allowing it to rest at the base.\r\n\r\n\"There we go,\" Tanaka says as he reaches for the ring gag he grabbed earlier. \"Now open wide. I have a use for that mouth of yours.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53494842, "type": "ic", "edited": "2018-12-15T16:19:57.414261", "format": "raw", "posted": "2018-12-15T16:19:57.414261", "text": "By the pained grunt he releases, it’s rather clear that Choromatsu had no idea what he was getting himself into when he begged for the addition of the cock ring. Now every throb of his cock that accompanies Tanaka’s praise is just on the verge of being painful.\r\n\r\nBut he wouldn’t be able to disappoint his new owner either by not following his instructions. The dull ache is his cock is the lesser evil in comparison to being punished again.\r\n\r\nObediently Choro opens his mouth to receive the ring gag. There was little point in choosing now to take a stand against Tanaka when he’d already debased himself several times since being locked in the office. So he allows the ring gag to be strapped tightly into place, locked behind his teeth, and leaving his mouth wide open for Tanaka."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53494985, "type": "ic", "edited": "2018-12-15T16:43:04.536482", "format": "raw", "posted": "2018-12-15T16:43:04.536482", "text": "With the ring gag in place, Tanaka takes a moment to appreciate Choro's helpless form. With a light pinch to his nipples and a kiss on the cheek, Tanaka begins to unbuckle his pants, discarding them on the floor before slipping off his underwear. Just from watching and toying with Choro, his cock is already fully erect as he positions his toy on his knees in front of him.\r\n\r\n\"Don't want you to choke too much,\" he explains, grabbing him by the back of his head. \"Now go ahead and give the head and shaft a few licks. Then I'll see if you can take it in your mouth.\"\r\n\r\nTanaka's cock leaks precum as he looks over Choro, hanging mere centimeters from his mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53495049, "type": "ic", "edited": "2018-12-15T16:52:12.283161", "format": "raw", "posted": "2018-12-15T16:52:12.283161", "text": "The tape binding Choro’s legs together crackles in protest as he’s maneuvered into a more advantageous position on his knees, but still holds to maintain its purpose of keeping the secretary turned sex toy unable to move himself more than a few centimeters. It’s harder to swallow through the ring gag now that he’s upright, saliva just beginning to leak from the corners of his mouth and slide onto his pale chest.\r\n\r\nHe feels as though the hand gripping his hair is unnecessary but doesn’t voice his complaint to Tanaka for fear of being insubordinate. \r\n\r\nSticking his tongue through the ring gag, Choromatsu starts with the head of Tanaka’s cock, the experimental swipes of his tongue cleaning away the precum and leaving a salty-sweet taste lingering in his mouth. Then the real work begins as he starts licking the shaft, straining against the hand in his hair to get continuously lower."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53527098, "type": "ic", "edited": "2018-12-17T17:20:39.898726", "format": "raw", "posted": "2018-12-17T17:20:39.898726", "text": "Realizing that the hand in his hair might be hidering him, Tanaka releases his grip on Choro and settles for gently stroking his hair. Pleasure runs through him at Choro's licks, even if he was clearly inexperienced. It was something that could be worked on and improved during their time together.\r\n\r\nGrunts and hushed swears spill out of Tanaka's mouth as he maneuvers Choro's head, his cock slowly sliding into his mouth as he ruffles his hair.\r\n\r\n\"You'll be practicing taking cock like this quite a bit these next few months,\" he explains as he inches himself further. \"Now bob your head back and forth. I want to see how far you can take it into your mouth.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53528191, "type": "ic", "edited": "2018-12-17T19:24:44.705125", "format": "raw", "posted": "2018-12-17T19:24:44.705125", "text": "Choro can only imagine the sort of nightmare this scenario could turn out to be if he’d put up more resistence. The ring gag keeps his mouth open and waiting and Choro didn’t have to be a genius to figure out that in his bound state his disadvantages outweighed any plans for rebelling that he might have had - this is extremely gentle in comparison to how it could have turned out. Gagging and drooling around Tanaka’s cock as he fucked his mouth and throat in an effort to break him.\r\n\r\nHe knows that it would too. The Matsunos weren’t well known for their iron wills. At least this way things were being taken relatively slow. He was under threat of punishment, having no doubts that there was more that he could do to earn Tanaka’s discipline than cumming without permission, but he’d already expressed a strong willingness to be good for his new owner. If he was going to be stuck here with no chance of escape then he might as well make it as easy as possible and not kick up a fuss.\r\n\r\nBesides, there’s something about Tanaka’s gentle ruffles of his hair that goes straight to his cock - straining through the ring almost painfully. So Choro lays his tongue flat to allow room for Tanaka’s cock in his mouth as he starts to bob his head back and forth. \r\n\r\nIt’s slowgoing at first and Choro is grateful that he’s being allowed to go at his own speed to accustom himself to the experience. Almost as an apology he swipes his tongue around his cock when he pulls away. Every time he moves forward he takes in a little more of Tanaka’s cock than the last time until there’s an uncomfortable tickle in the back of his throat and he pulls back to start the process again."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53539929, "type": "ic", "edited": "2018-12-18T06:43:45.479135", "format": "raw", "posted": "2018-12-18T06:43:45.479135", "text": "Tanaka makes hushed grunts as Choro takes his cock deeper down his throat. In his lustful and hazy state of mind, he grabs onto Choro's hair, tightening it impulsively when he gets closer to cumming. All control goes to Tanaka as he takes the lead, going at his own pace from the desire to cum.\r\n\r\n\"Take it, take all of it,\" he groans under his breath, primal instincts taking over when he finally releases down Choro's throat. When he's finished riding the aftershocks, Tanaka pulls out, panting as he squats down in front of Choro.\r\n\r\n\"I think I lost control there,\" he chuckles as he strokes his face. \"If it makes you feel any better, I'll let you cum. Just beg for it like a good boy...\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540062, "type": "ic", "edited": "2018-12-18T06:53:22.820264", "format": "raw", "posted": "2018-12-18T06:53:22.820264", "text": "Choro keens once Tanaka picks up the pace - to the point where he can’t keep up with his tongue and he’s left to just be moved how Tanaka sees fit. \r\n\r\nNot wanting to choke more than he already is, he swallows dutifully, panting heavily when the man finally pulls his cock from his mouth. His eyes are a little dazed as he drools onto his chest as Tanaka lowers himself to his level.\r\n\r\n“Pweah, pweah?” He whines, pressing into Tanaka’s touch."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540171, "type": "ic", "edited": "2018-12-18T07:03:17.980438", "format": "raw", "posted": "2018-12-18T07:03:17.980438", "text": "Tanaka smiles at Choro's gargling whines, hand lowering down from his face to his chest. He gives one nipple a quick pinch before lowering further towards his stomach, then finally his cock.\r\n\r\n\"You've been such a good and obedient boy for me,\" he praises as he slowly slides the ring off. \"A good little sex toy, and a perfect slut. Here's your reward, so enjoy it.\"\r\n\r\nWith a kiss to the cheek, Tanaka takes the ring off, giving Choro's cock a few pumps to bring him even more pleasure."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540245, "type": "ic", "edited": "2018-12-18T07:12:23.755270", "format": "raw", "posted": "2018-12-18T07:12:23.755270", "text": "The Matsu squeaks at the pinch, unable to cover his chest in any capacity. But the feeling only lingers for a moment before Tanaka’s hand traces down his stomach and towards his cock. And in that moment, all Choro can find himself caring about is pleasing Tanaka so that he can get his reward.\r\n\r\nThe feeling in his own cock is nearly driving him mad and the ring sliding off is pure bliss. Or close enough until the ring is actually off and he feels the same jolt of pleasure go straight to his length when Tanaka starts to stroke - then he’s in real bliss.\r\n\r\nChoro gargles in helpless pleasure, precum coating Tanaka’s hand as he whines. Still, he doesn’t immediately find his release - looking to Tanaka and waiting. He said to enjoy his reward but a part of Choro wanted to have explicit permission from the man."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540305, "type": "ic", "edited": "2018-12-18T07:19:48.973217", "format": "raw", "posted": "2018-12-18T07:19:48.973217", "text": "\"What's the matter?\" Tanaka asks, speeding up his ministrations. Choro's loud gargled whines and helpless face are pure sadistic pleasure, and Tanaka wants to hear what he sounds like once he's finally cum.\r\n\r\n\"Come on, Choro. Cum for me, like the little slut you are. It's what you want, right? So go ahead and cum.\" His stroking speed increases, his other hand giving his erect nipple a pinch."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540383, "type": "ic", "edited": "2018-12-18T07:28:12.645422", "format": "raw", "posted": "2018-12-18T07:28:12.645422", "text": "Tears start to form in Choro’s eyes, streaking down his face as Tanaka speeds up his stroking and he tries his best to hold in his release. He wants it so badly, more than he’s wanted anything in a long time - even a job, but he doesn’t want to disobey Tanaka even on a technicality.\r\n\r\nBut, there! When he’s panting, chest heaving and beginning to work up a sheen of sweat, Tanaka says three words that let him release. \r\n\r\nA hoarse and strangled scream tears from his throat, unmuffled by his open gag, when he cums, coating his stomach and Tanaka’s hand. After waiting so long, Choro is sobbing with relief as his eyes roll back momentarily and flutter white before he leans heavily against Tanaka’s shoulder."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540483, "type": "ic", "edited": "2018-12-18T07:39:47.372040", "format": "raw", "posted": "2018-12-18T07:39:47.372040", "text": "Tanaka gives Choro a pat to the back as he leans against him, sighing as his body trembles from the aftershocks. With his determination to hold it in until he was given explicit permission, Tanaka feels that he's hit the jackpot when it came to the perfect plaything.\r\n\r\n\"That's my good boy,\" he praises again while he ruffles his hair. \"Now that you know your place, I'll show you how you're going to move around my office to run any errands for me.\"\r\n\r\nTanaka stands up, maneuvering Choro so his face is on the floor, ass sticking up in the air.\r\n\r\n\"I'll be right back, so stay put,\" Tanaka says when he walks to the door. \"I promise I won't be gone long.\"\r\n\r\nHe unlocks the door, then shuts it behind him before locking it again, leaving Choro all alone."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540612, "type": "ic", "edited": "2018-12-18T07:55:38.663524", "format": "raw", "posted": "2018-12-18T07:55:38.663524", "text": "Once his breathing settles into a normal pattern, Choromatsu feels as though a fog has been lifted from his mind that finally allows him to think clearly. He’s more than aware that he shouldn’t be taking comfort from being in contact with his...\r\n\r\nHe can’t bring himself to think owner now. He shouldn’t have in the first place. It made Tanaka treat him more gently but it wasn’t doing any favors for his mindset.\r\n\r\nStill riding the high of his most recent orgasm, Choro still allows himself to be put into position like a doll - remaining in place until he hears the man return."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540772, "type": "ic", "edited": "2018-12-18T08:16:35.697221", "format": "raw", "posted": "2018-12-18T08:16:35.697221", "text": "Tanaka returns with a rolling platform with four bars on the corners, a lubricated dildo standing straight up in the center. Along with this, he has a few pairs of cuffs he plans to use on Choro's ankles and wrists.\r\n\r\n\"I promised you I'd be back soon,\" he says after he locks the door behind him. \"Now that I'm back, I'm going to cut off your tape and fasten you onto the platform.\"\r\n\r\nHe moves Choro onto his lap as he sits on his desk, facing towards the platform as he uses a pair of scissors to cut off his tape restraints.\r\n\r\n\"That ring gag is staying on, by the way,\" he says with a smirk. \"Good toys should always be ready to please their owners\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540836, "type": "ic", "edited": "2018-12-18T08:25:30.126930", "format": "raw", "posted": "2018-12-18T08:25:30.126930", "text": "The strange contraption catches Choromatsu’s eye almost immediately - it’s purpose completely lost to him. Although it had been explained to him that this was a bondage company that he would be testing out new products for. It was possible that this was one such product.\r\n\r\nHis pupils are little more than pinpricks as he’s maneuvered into Tanaka’s lap. This is it. He’s played along so far and even been rewarded for it but he shouldn’t have given in so easily. This job had been a trap from the get go...losing it wasn’t that much of a threat anymore.\r\n\r\nThat and he at least had to try.\r\n\r\nSo Choro waits patiently, drool spilling down his chin, up until the point that his legs and arms have both been freed. Mindful of the scissors, Choro launches himself forward and staggers towards the open door."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540884, "type": "ic", "edited": "2018-12-18T08:36:40.156033", "format": "raw", "posted": "2018-12-18T08:36:40.156033", "text": "Tanaka's reflexes are quick, dashing towards Choro before grabbing onto his arm. When he turns him towards him, he gives him a harsh slap to the cheek.\r\n\r\n\"This is such a disappointment.\" Shaking his head, he squeezes Choro's throat with one hand as he jerks him towards the rolling platform. \"I was starting to like your obedience, even if I like my playthings struggling and screaming. Lucky for me, it looks like I'm going to be seeing more if that.\"\r\n\r\nHe shoves Choro onto the dildo as it fills him up nicely, using the cuffs to fasten his wrists and ankles to the bars. He's allowed to use his feet to scoot around, but he's not as fast as he would be on two legs.\r\n\r\n\"Maybe I should plug that ungrateful mouth up with my cock again?\" Tanaka snarls as he yanks on his hair. \"You're already wide open and drooling like a fucking slut.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53540941, "type": "ic", "edited": "2018-12-18T08:48:14.172557", "format": "raw", "posted": "2018-12-18T08:48:14.172557", "text": "Choromatsu yelps in surprise when Tanaka slings him back around to face him by his arm, turning into a pained gargle when the man slaps him. Somehow it’s even more humiliating than everything else he’s been through in the last several hours, worse still that it leaves a red print behind that lingers on his pale skin. \r\n\r\nWhen Tanaka grabs him by the throat, Choro scrabbles to claw at the man’s wrist when he starts to choke - emitting a loud, hoarse noise through the ring gag. The escape attempt had been instinctual, done so that he could at least say that he tried to escape instead of rolling over on the man’s whims like a dog.\r\n\r\nHe considers that the process would be more gentle if he hadn’t tried to escape, groaning when the dildo is thrust into him all at once to fill his ass until Tanaka decided to pull him off. The permanence settles even more when he’s cuffed to the metal bars, unable to stretch out his legs or fully extend his arms.\r\n\r\nChoro bawls miserably when Tanaka yanks on his hair and starts to snarl at him - completely at odds with the gentle tone he’d previously used...when Choro was being good.\r\n\r\n“Pweaah...’orry! Be gwoo, be gwoo,” he sobs, working himself into a worse panic."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53540992, "type": "ic", "edited": "2018-12-18T08:59:55.845353", "format": "raw", "posted": "2018-12-18T08:59:55.845353", "text": "\"You can't fool me, you damn pig,\" Tanaka sneers, yanking his hair back further. \"Maybe I should make you wear a nose hook at some point, since you're such a goddamn disgusting little pig.\"\r\n\r\nHe gives him another slap to the face, not even bothering to wipe his tears away.\r\n\r\n\"I'll be sure to make an example out of you when we test tomorrow's product,\" he threatens. \"If you thought that bondage sack was bad, this will be way worse, and it'll be for much longer too.\"\r\n\r\n\"I think I'll stuff that throat of yours with a huge dildo. I don't even want that disgusting mouth near my cock.\" As he says this, he shuffles through his desk and pulls out a large, thick dildo, slowly sliding it into Choro's mouth.\r\n\r\n\"Too big? Too bad. It's what you deserve for defying me.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53541036, "type": "ic", "edited": "2018-12-18T09:09:57.317201", "format": "raw", "posted": "2018-12-18T09:09:57.317201", "text": "Choro is doing a terrible job of fighting off his own panic when combined with Tanaka’s fury. With the gag slurring his every word it’s almost impossible to get across that he isn’t trying to trick Tanaka. Even harder when the second slap brings even more tears and sobs that distort his begging.\r\n\r\nHe flinches at the mention of the sack again, not knowing what could possibly be worse than that matter of bondage other than what’s currently happening. But he’s going to find out and be made an example of. Because he wasn’t good and now he just wanted to be good again to get back in Tanaka’s favor.\r\n\r\nAt least he can be thankful that the man doesn’t just shove the dildo down his throat - though it doesn’t lesson the gagging by much as he’s forced to keep his head tilted up.\r\n\r\nHe doesn’t even move once it’s in, waiting on Tanaka to give him orders again so he would know what to do. He needed to prove that he could be trusted again and this time he wouldn’t betray him for a flimsy escape attempt."}]