[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53541070, "type": "ic", "edited": "2018-12-18T09:18:49.614983", "format": "raw", "posted": "2018-12-18T09:18:49.614983", "text": "Tanaka pulls Choro's hair back again once the large dildo is stuffed down his throat. It's so large, it makes a small bulge in his throat - which Tanaka runs his finger along after he's let go of his hair.\r\n\r\n\"This is a much more fitting role for you,\" he says, shuffling behind his desk. \"I have no further use for you right now, so you'll spend the next few hours choking on that dildo. You can try to scoot around on the platform if you want, to get used to it. But I'll be doing paperwork and making phonecalls in the meantime.\"\r\n\r\nTanaka sits down at his chair, rummaging through his files and leaving Choro to suffer with his ass and mouth stuffed."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53541103, "type": "ic", "edited": "2018-12-18T09:27:13.543187", "format": "raw", "posted": "2018-12-18T09:27:13.543187", "text": "After Tanaka leaves him to his own devices, Choro remains in the same spot. Not so much out of fear but out of the need to take several moments to compose and recollect himself to be the tiniest bit more presentable to Tanaka.\r\n\r\nThere’s no helping the tear tracks on his face and swallowing down his sobs takes a good deal of time as each one is an obvious reminder of the large dildo crammed through the ring gag, and he doesn’t have the reach to fix his hair sticking out in several directions. But it’s better than nothing that he’s stopped crying and he isn’t working himself up into even more of a fuss.\r\n\r\nThat’s when he starts to move, making sure to steer clear of the door. It’s not very fast, stretching his toes to push himself along, but it’s doable with a little bit of work and it takes little time for Choro to accustom himself with the system. So he rolls himself behind Tanaka’s desk, making so sound as he stops himself right at the man’s heel. \r\n\r\nHe doesn’t whine or whimper, just lowers his head against his chest submissively and waits for Tanaka to finish his work while he licks on the gag."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53586590, "type": "ic", "edited": "2018-12-20T06:26:52.776562", "format": "raw", "posted": "2018-12-20T06:26:52.776562", "text": "Tanaka completely ignores Choro as he waits by his heel, still fuming at his earlier attempt to flee. He wants to drive the point home that Choro's insubordinate behavior was unacceptable, perfectly fine with leaving him alone on the platform all night as punishment.\r\n\r\nWhen he's done with his work, the only kind thing Tanaka does is take the dildo out of Choro's mouth, putting it back in his drawers after drying it with a paper towel.\r\n\r\n\"I'll be back tomorrow,\" he says bitterly as he takes his leave. \"If you had been a good boy, I would have slept with you on a mattress. But you deserve this instead.\"\r\n\r\nFlicking the light switch off, Tanaka shuts and locks the door, leaving Choro alone in the darkness."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53586939, "type": "ic", "edited": "2018-12-20T06:37:09.379273", "format": "raw", "posted": "2018-12-20T06:37:09.379273", "text": "Tanaka’s lesson doesn’t go unlearned by Choro the longer that he’s ignored. Initially he hadn’t thought that not being the man’s center of attention would be that bad but as it turned out being praised and rewarded made up for the long stretches of time where he wasn’t doing much of anything.\r\n\r\nChoro at least hopes that his better behavior now is showing how sorry he is for trying to escape - though he doesn’t try to beg again when the dildo is removed from the center of the gag. \r\n\r\nThe idea of a mattress spurs Choro to want to be a good boy even more as he can only guess how uncomfortable he’ll be sleeping on the rolling platform. \r\n\r\nNow alone in the darkness, Choro sniffles and drools through the now open ring gag. Feeling vulnerable, he rolls himself under Tanaka’s desk to sleep with the plan to wake up before opening so he could wait for Tanaka by the door."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53587342, "type": "ic", "edited": "2018-12-20T06:48:55.650315", "format": "raw", "posted": "2018-12-20T06:48:55.650315", "text": "Tanaka has calmed down considerably once morning rolls around, having had time to relax and sleep. He's well-aware that Choro likely had a rough time sleeping, with his wrists and ankles cuffed and a dildo stuffing his ass. But he doesn't feel any guilt as he walks into the company building, greeting his employees with his morning coffee in one hand. \r\n\r\nHe unlocks the door to his office, thinking back to yesterday. Tanaka still doesn't know if Choro was being honest when he gargled his promise to be good, but he decides that maybe, just maybe, he'll be more gentle with him today if he showed good behavior."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53587540, "type": "ic", "edited": "2018-12-20T06:54:44.199334", "format": "raw", "posted": "2018-12-20T06:54:44.199334", "text": "Matsunos weren’t particularly known for their ability to wake up early - though Choro was better off for being the more responsible of the group. Still, after being put through the wringer yesterday it wouldn’t have been that surprising to find him still fitfully sleeping under the desk. But the uncomfortable position seems to have aided his plans from the night before to wait for Tanaka as he’s groggily waiting a few feet from the door when it opens.\r\n\r\nHe blinks a little when Tanaka enters the room and coos through the gag as he wiggles to show his excitement at the man’s return. The distance from the door is a clear sign that he isn’t using the entrance to try and escape again - especially as he waits for Tanaka to come further into the room before rolling after him.\r\n\r\nHis hair is a ruffled mess and there’s a dried coat of saliva all down his chest, but there’s a twinkle in Choro’s eyes as he follows Tanaka through the office like a dog waiting for its master to come home."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53587972, "type": "ic", "edited": "2018-12-20T07:09:33.931030", "format": "raw", "posted": "2018-12-20T07:09:33.931030", "text": "Tanaka expected Choro to act terrified when he arrived, but to his surprise he's more or less acting like an obedient pup. It's endearing in a way, and he can't help but grin as his plaything follows him around on the rolling platform.\r\n\r\n\"I see you're ready to start the day,\" he says, running a hand through his messy hair. \"Are you really that excited to test out more extreme bondage equipment?\"\r\n\r\nHe takes the gag out of his mouth to allow him to speak, then places the gag and coffee on his desk. When he turns back, he strokes Choro's cheek, gently running his thumb along his bottom lip.\r\n\r\n\"Anything you want to say to me before we start today's work?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53588186, "type": "ic", "edited": "2018-12-20T07:18:05.176658", "format": "raw", "posted": "2018-12-20T07:18:05.176658", "text": "He’s tentative about the day set in store for him and it likely shows on his face that he’s nervous, but Choro nods anyway when the question is asked. He’d honestly been expecting Tanaka to still be angry about his failed escape attempt and had been apprehensive about how the morning would go...but everything seems to be okay.\r\n\r\nAs okay as this situation could be anyway.\r\n\r\nChoro pushes his head into Tanaka’s hand when he pets his hair like he had the day before things went wrong. Working his jaw to release the tension once the gag is out, he cocks his head to the side as he contemplates the question.\r\n\r\n“I...I promise to do better...be better.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53588540, "type": "ic", "edited": "2018-12-20T07:32:43.732287", "format": "raw", "posted": "2018-12-20T07:32:43.732287", "text": "Tanaka smiles down at Choro, ruffling his hair again before pulling away.\r\n\r\n\"That's it, good boy...\" he praises, leaning down to peck him on the lips. \"Being my personal pleasure doll isn't so bad after all, is it? It'll only get easier from here on out.\"\r\n\r\nTanaka stands up and walks to his storage closet, rummaging through it before pulling out another sack. This sack was different, however - four belts hanging off on the side of the sack, along with a connected pump.\r\n\r\n\"This is what we'll be testing today,\" he explains, laying it out on the floor. \"It's an inflatable rubber bondage bag. It'll be really tight, and you'll be stuck inside it the whole day. But it's /supposed/ to deflate around nighttime, so you won't be stuck inside it all night.\"\r\n\r\nHe doesn't mention the possibility of it failing to release him, the idea of him stuck in it all night entirely plausible.\r\n\r\n\"I won't be interacting with you much today. You'll be inside the sack for all of today's testing. But I promise you that it is very important that you make sure it works properly, okay?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53588789, "type": "ic", "edited": "2018-12-20T07:44:32.402789", "format": "raw", "posted": "2018-12-20T07:44:32.402789", "text": "Choro’s heartbeat spikes, elated that yesterday’s mistake seems to have been forgiven after a night’s rest and his promise to be better. He’s back to receiving pets and gentle kisses that curl his toes and make the experiences almost worth it. The process could have worked for nearly any Matsu - not used to getting praise for what little they did. \r\n\r\nSo he listens with rapt attention as the latest bondage sack is brought out for him to look at and have explained. His input wouldn’t likely be necessary as long as his testing it proved that the item did what it was supposed to, but he wanted to know about the product anyway just in case he could add anything helpful after he was released once nighttime came.\r\n\r\nSwallowing nervously, Choro is quiet for a moment before he speaks. “Okay, I understand,” he says with a small smile. “I...may I request something sir?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53588886, "type": "ic", "edited": "2018-12-20T07:49:01.215206", "format": "raw", "posted": "2018-12-20T07:49:01.215206", "text": "Tanaka nods, approaching Choro and unfastening the cuffs around his ankles and wrists.\r\n\r\n\"Sure, what is your request?\" He asks as he slowly slides him off of the dildo. To make sure he doesn't run off, he pulls him tight in an embrace, although the action comes off more gentle and loving than anything.\r\n\r\n\"Just let me know. I'll see what I can do.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53589046, "type": "ic", "edited": "2018-12-20T07:59:21.127642", "format": "raw", "posted": "2018-12-20T07:59:21.127642", "text": "After a night cuffed to the platform, Choro can hardly get his feet back under himself and he’s grateful that Tanaka embraces him if only because it keeps him from tripping over himself. He feels empty too, surprised that the absence of the dildo is actually something he would miss after an entire night of it filling his ass.\r\n\r\nAt first Choro can’t bring himself to look up at Tanaka and meet his eye but after another moment of silence he manages to, figuring that asking this required him to be more direct.\r\n\r\n“I want to be punished while I’m in the sack, for yesterday. I want to be good for you and make up for it.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53589157, "type": "ic", "edited": "2018-12-20T08:09:45.072765", "format": "raw", "posted": "2018-12-20T08:09:45.072765", "text": "Choro's request surprises Tanaka, to say the least. But he's not against it at all, given his sadistic personality. That, and it proved that Choro really was willing to degrade himself if it meant he could be praised for it.\r\n\r\n\"So be it,\" he says, giving his forehead a gentle kiss. \"I'll go ahead and stuff your holes while you're inside the sack, and put some clamps on your cute little nipples. You can take them off and out once the sack releases you, okay?\"\r\n\r\nWith a ruffle to his hair, he guides him towards the sack, leaving him alone while he rummages through his desk. Pulling out clamps and two dildos, he shows them off before lubing up one. Then he gently slides it inside Choro's ass, along with the dildo gag that he straps behind his head. Finally, he clamps his nipples, but not before giving them a quick pinch.\r\n\r\n\"There we go.\" He gives Choro a pat to the cheek as he guides him inside the sack. \"Now I'm going to pump this up, so get comfortable.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53589444, "type": "ic", "edited": "2018-12-20T08:25:45.439874", "format": "raw", "posted": "2018-12-20T08:25:45.439874", "text": "Choro breaths a sigh of relief at Tanaka’s approval. It wasn’t that he had expected the man to refuse him but Choro hadn’t known whether he was allowed to decide on his own discipline or not. At least in this case he was, and the knowledge is almost soothing. If he did something wrong he wanted to be punished for it, at least then his mistake could be forgiven and they could start fresh.\r\n\r\nHe was only experiencing his second day on the job, mistakes were to be expected whether he wanted to or not but he could at least take responsibility for his actions if it would make Tanaka happy.\r\n\r\nChoro sits obediently while he waits for Tanaka to find what he’s looking for in his desk drawers. He whines with pleasure as the dildo enters his ass, filling the void he’d felt since being taken off the platform - stopping to open his mouth for the gag and even thrusting out his chest to receive the clamps even though he grunts in pain when they’re pinched and applied. \r\n\r\nAfterwards he helps Tanaka settle himself into the sack and wiggles himself inside to wait for inflation."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53589608, "type": "ic", "edited": "2018-12-20T08:36:25.567023", "format": "raw", "posted": "2018-12-20T08:36:25.567023", "text": "Tanaka smiles at Choro's willingness, giving his cheek light strokes. His face is the only part of him that's visible, the rest of his body covered by the sack. He shows Choro the inflation device before turning it on, waiting for the sack to fill with air and squeeze Choro.\r\n\r\nThe inflation process starts, the latex sack growing in size as it clings tightly to his body, squeezing him along with the belts wrapped around the sack. The latex makes a light squeak as it expands and grows tighter, eventually stopping as it reaches maximum inflation.\r\n\r\nTanaka is pleased as he looks down at his rubbery plaything, giving him a final kiss to the forehead before standing up to retrieve a blindfold.\r\n\r\n\"One last piece to your punishment.\" He wraps it around Choro's eyes before standing up. \"You'll be isolated for a few hours, but I feel like that's fair for yesterday's transgression.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53589746, "type": "ic", "edited": "2018-12-20T08:45:15.136883", "format": "raw", "posted": "2018-12-20T08:45:15.136883", "text": "Choro’s face scrunches with discomfort as thesack starts to inflate and he’s left to its tight embrace. It’s ten times worse than the sack from yesterday which he could at least move around in a couple of centimeters. This sack makes any kind of movement impossible, even just trying to wiggle his fingers seems pointless when he can’t tell if the endeavor was successful.\r\n\r\nBut with a couple of minutes below his belt...several of his belts actually if he’s counting the ones wrapped around the latex and sectioning it off into separate portions, he’s able to settle more comfortably into the sack and just lay on the floor and watch Tanaka.\r\n\r\nEven that’s taken from him with the addition of the blindfold, but Choro doesn’t so much as protest as he’s left in the darkness to drift and focus on his punishment."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53589952, "type": "ic", "edited": "2018-12-20T08:56:26.303594", "format": "raw", "posted": "2018-12-20T08:56:26.303594", "text": "With today's setup and punishment taken care of, Tanaka turns off the light and takes his leave, failing to mention that he's leaving for the rest of the night as Choro sits tight in the rubber cocoon. He also fails to mention the automatically vibrating dildo and thrusting gag, which activate an hour into the work day with occasional breaks in between.\r\n\r\nThe gag thrusts to the back of Choro's throat while the vibrations in his ass increase in intensity. With the tightness of the sack, there's no choice than for him to take it.\r\n\r\nWhen night rolls around, the sack malfunctions, keeping Choro locked inside the sack for the whole night while the vibrations and thrusting continue."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53590210, "type": "ic", "edited": "2018-12-20T09:11:42.417820", "format": "raw", "posted": "2018-12-20T09:11:42.417820", "text": "There’s no way to tell how much time has passed now that he’s been blindfolded, but Choro has never found himself to be impatient until now. As much as he wants to be good, he can’t help but squirm and wiggle when his thoughts start drifting - causing the clamps to brush against the latex and illicit a groan of pain that brings him back to remembering his punishment.\r\n\r\nThe first time that the vibrating starts, Choro is startled by the sudden movement in both his ass and throat - almost gagging when the gag brushes the back of his throat. It at least breaks up the otherwise monotonous day he would be having, a new erection straining against the tight latex but forcing him to follow the command not to cum without Tanaka’s permission.\r\n\r\nIt takes an eternity for night to fall and even then Choro has no idea that it has, all bound up in his own little world. He panics a little when it seems as though night has come that he still hasn’t been released but Choro tries to remind himself that Tanaka wouldn’t just leave him like this after how good he was this morning."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53590364, "type": "ic", "edited": "2018-12-20T09:22:41.667432", "format": "raw", "posted": "2018-12-20T09:22:41.667432", "text": "Unbeknownst to Choro, that's exactly what Tanaka is doing. Choro's punishment is the last thing on his mind as he drifts asleep, more focused on tomorrow's training and bondage equipment.\r\n\r\nThe latex continues to squeeze Choro tightly as he's left inside the hot sack to suffer, just as tight as it was when he was first placed inside. The faint buzzing of the toy in his ass can barely be heard over the squeaky rubber whenever Choro moves, the sound attracting a few night shift workers as Tanaka has accidentally left the door unlocked.\r\n\r\nThey approach Choro quietly, curiously watching him in the black latex cocoon."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53590425, "type": "ic", "edited": "2018-12-20T09:27:54.483279", "format": "raw", "posted": "2018-12-20T09:27:54.483279", "text": "Quiet moans leave the cocoon as Choro rides out another wave of vibrations from the dildo in his ass. He’s completely unaware of the night shift employees watching him, and likely would be even if he wasn’t blindfolded.\r\n\r\nHe still doesn’t know for sure that the sack should have released him by now but his own exhaustion has set in and left him limp and pliant inside the tight latex."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53652031, "type": "ic", "edited": "2018-12-22T07:09:10.492064", "format": "raw", "posted": "2018-12-22T07:09:10.492064", "text": "Erections form in the employees' pants at Choro's muffled moans, each of them trying not to make a sound as they walk closer to his bound form. One of them presses down on the latex near Choro's chest, sectioned out by the belts. The second employee takes a few pictures on his phone, while the last focuses his attention on his face as he gently strokes his cheeks before taking out the dildo gag.\r\n\r\nSeconds later, he takes off the blindfold, allowing Choro to see for the first time in hours.\r\n\r\n\"Well, would you look at that,\" one of them chuckles. \"Looks like boss got himself a new pet.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53652322, "type": "ic", "edited": "2018-12-22T07:19:55.660379", "format": "raw", "posted": "2018-12-22T07:19:55.660379", "text": "Choro just barely makes out that he’s being touched, the inflated latex only allowing the smallest amount of pressure to reach him. With no sense of time he’s half expecting the touch to belong to Tanaka, having returned before the suit could deflate. But then there’s another set of hands on his face and Choro whines in confusion.\r\n\r\nWere there more employees in the office to see the product now? It wasn’t as if he hadn’t figured he’d be on display on some point when Tanaka had already told him as much. The employees would need to see the bondage that was being produced.\r\n\r\n“W-what?” He stammers groggily, exhausted and nearly half sleep when the thrusting gag is finally removed.\r\n\r\nHis eyes are bleary as he makes out the group surrounding him, not quite sure of what was acceptable behavior. “...Hello?”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53652623, "type": "ic", "edited": "2018-12-22T07:30:56.528603", "format": "raw", "posted": "2018-12-22T07:30:56.528603", "text": "The employees surrounding him don't respond at first. Instead, they take the time to squat down and observe Choro, hands running over the tight latex.\r\n\r\n\"Damn, how long have you been in that thing?\" One of them asks. \"It's past midnight, you'd think that Tanaka would give you some rest.\"\r\n\r\n\"Doubt it,\" another replies. \"He's never cared about his toys' wellbeings that much. It's always been about how much they can go on until they break.\"\r\n\r\n\"Well, in any case,\" the third chimes in with a smirk. \"He's left him all alone. Who says we shouldn't have some fun with him?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53652934, "type": "ic", "edited": "2018-12-22T07:44:10.568140", "format": "raw", "posted": "2018-12-22T07:44:10.568140", "text": "Past midnight? Choro couldn’t believe it. The suit was supposed to have released him hours ago and had malfunctioned. He can’t even bring himself to be irritated - filing the knowledge away to tell Tanaka whenever he returned to the office.\r\n\r\nHe doesn’t even take part in the conversation for a good couple of minutes, laying in stunned silence before the dildo in his ass causes him to whimper and brings him back to reality.\r\n\r\nHis punishment! He didn’t want Tanaka to return and find him without the blindfold and gag. It wasn’t something that he could help but he didn’t want to displease the man after promising to be good. \r\n\r\n“Since...since this morning,” he answers quietly, not meeting the men’s eyes as he tries to keep up with the rest of the conversation. “I’m being punished...please return the blindfold and gag, I want to do a good job.”"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53653171, "type": "ic", "edited": "2018-12-22T07:55:01.414756", "format": "raw", "posted": "2018-12-22T07:55:01.414756", "text": "The men snicker at Choro's quiet moan and plea as they place the blindfold and gag off to the side.\r\n\r\n\"You know, with you bound up like this, you don't really have any power over us,\" one of them says as he begins to strip down to his underwear. \"But your determination to kiss the boss's ass is somewhat admirable, in a weird way.\"\r\n\r\nHe slips off his underwear and scrunches it up in his fist as he bends down towards Choro, nodding towards the others as they bein to strip down as well.\r\n\r\n\"Tanaka doesn't give a shit about you,\" he says firmly. \"He's probably going to sell you off or give you away once he grows bored of you. It's only a matter of time before you're shipped off somewhere else, and you'll never see him again.\""}]