[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53653352, "type": "ic", "edited": "2018-12-22T08:03:35.271120", "format": "raw", "posted": "2018-12-22T08:03:35.271120", "text": "Choro’s eyes flit between the three men, wishing for all the world that Tanaka would come into the office to free him or at least make the night shift employees return to their work. He truly didn’t have any power in this situation, evident when he starts to panic and struggle with no outwardly visible signals other than a flash of pain across his face when the clamps on his nipples are disturbed for the first time in hours.\r\n\r\n“No...no, that’s not true,” argues Choro, taking on a defiant expression that doesn’t match the rest of his appearance. He feels an odd sort of attachment to Tanaka, wanting to defend the man despite him being the reason he was in this situation to begin with. “I’m being a good boy, I promised. And I’ll do whatever Mr. Tanaka wants to keep him happy.”\r\n\r\nIn all honesty he didn’t want to be sold off to some stranger where he’d have to learn the rules all over again - what he was and wasn’t allowed to do. He was just barely into three days of his own captivity and he had a fairly good handle on how to behave around Tanaka."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53653546, "type": "ic", "edited": "2018-12-22T08:14:48.405024", "format": "raw", "posted": "2018-12-22T08:14:48.405024", "text": "\"You're delusional,\" he states blankly. \"Your devotion is cute, but there's really no point in lying to yourself. You're just scared, aren't you? And you don't like the idea of your precious master getting bored of you.\"\r\n\r\nThe other employees have all stripped down as well, bunching their boxers up into balls as they close in on Choro.\r\n\r\n\"Tanaka isn't going to come back until morning, so we have the whole night to make sure you know your place. Pathetic, throwing your life away for some stranger that doesn't give a shit about you.\"\r\n\r\nHe shoves his boxers in Choro's face, plugging his nose as the others try to contribute with their own pairs.\r\n\r\n\"Open wide... you wanted to be gagged again, didn't you?\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53707585, "type": "ooc", "edited": "2018-12-25T01:21:09.001025", "format": "raw", "posted": "2018-12-25T01:21:09.001025", "text": "(( Merry Christmas Eve! I'll get on responses soon"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53711908, "type": "ooc", "edited": "2018-12-25T05:12:51.266377", "format": "raw", "posted": "2018-12-25T05:12:51.266377", "text": "Merry Christmas Eve!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53713040, "type": "ooc", "edited": "2018-12-25T06:12:23.005394", "format": "raw", "posted": "2018-12-25T06:12:23.005394", "text": "(( thank you!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53713495, "type": "ooc", "edited": "2018-12-25T06:41:10.497699", "format": "raw", "posted": "2018-12-25T06:41:10.497699", "text": "No problem! I probably won’t be on until after Christmas"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 53713655, "type": "ooc", "edited": "2018-12-25T06:52:48.904746", "format": "raw", "posted": "2018-12-25T06:52:48.904746", "text": "(( that's totally fine, and I understand!"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 53924757, "type": "ic", "edited": "2019-01-05T03:27:11.690397", "format": "raw", "posted": "2019-01-05T03:27:11.690397", "text": "Tanaka wasn’t his precious master. That wasn’t true at all, he wasn’t that broken yet, was he? Choro frowns as he thinks the statement over, hardly listening to the man as he continued to speak. He’d already admitted that Tanaka was his master, aloud as well as in his own head, but he had at least hoped that he’d only done so because being good was so much better than being punished.\r\n\r\nAnother whine as the dildo thrusts inside of him again, turning into a full fledged moan now that he’s no longer gagged - providing the perfect opportunity for the wadded up underwear to be shoved inside. \r\n\r\nMuch of the fabric hangs from his mouth, cheeks bulging around the majority of what’s been shoved inside. The upside at least is that he’s been gagged again, returning as least one part of his punishment in a different form. Would Tanaka find that acceptable since it wasn’t his fault? All he had to think about now was the blindfold and what the night shift employees were going to do to him."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54040312, "type": "ic", "edited": "2019-01-10T22:59:43.120660", "format": "raw", "posted": "2019-01-10T22:59:43.120660", "text": "The employees snicker as the fabric hangs out of Choro's mouth, pushing it in as deep as it can go. With him bound tight in the latex, there's not much the employees can do to him right now other than touch his face, two men leaning down to rub their cocks against his bulging cheeks.\r\n\r\n\"Tanaka has good taste,\" the man masturbating above him grunts. \"A cute little thing like you would make a good plaything. I wonder if I could sneak you out for tonight to take you home with me?\"\r\n\r\nAll three eventually cum, getting their mess on Choro's face and mockingly kissing his cheeks.\r\n\r\n\"I'm sure Tanaka wouldn't mind... he's lent out his playthings to employees before.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54042639, "type": "ic", "edited": "2019-01-11T01:08:32.098766", "format": "raw", "posted": "2019-01-11T01:08:32.098766", "text": "Choro shuts his eyes tightly, grunting when they start rubbing their cocks on his face. Using him in the office was one thing, but sneaking out? What would Tanaka do if he came back and he wasn’t there? He was already being punished for trying to escape once.\r\n\r\nThe sack wiggles a little in his efforts to shake his head, muffled pleading turning into garbled nonsenses the longer he tries to speak."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54049774, "type": "ic", "edited": "2019-01-11T06:39:18.779256", "format": "raw", "posted": "2019-01-11T06:39:18.779256", "text": "The night shift employees chuckle as Choro tries to plead, one reaching down to stroke his face.\r\n\r\n\"Is that a scary thought for you? Being away from your master? Don't worry, we'll put you back here when we're finished playing with you. Just sit tight, okay?\"\r\n\r\nNodding to his coworkers, he begins by lifting up the sack on one end, while the other two take the middle and other end. They take slow, careful steps out of the door to make sure they won't drop the sack, not wanting to injure Choro too significantly.\r\n\r\nThey run into a few coworkers on their way out of the building, but the endeavor is met with jeers and merciless taunting towards Choro. By the time they exit, nobody has tried to stop the kidnapping.\r\n\r\nThey throw Choro in the trunk of one of the three's car, snickering before shutting it and leaving him in darkness. Minutes later, the engine starts, the vehicle driving into the night."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54049873, "type": "ic", "edited": "2019-01-11T06:46:27.032153", "format": "raw", "posted": "2019-01-11T06:46:27.032153", "text": "By this point, Choro has worked himself into a significant amount of panic, but there’s nothing to be done about it. The inflated latex has done its job almost too well in keeping him bound, unable to do anything to prevent the kidnapping. Should he expect more instances like this one the longer he was considered Tanaka’s toy or would this act be punished in the morning if the employees were caught?\r\n\r\nIt’s really all Choro has to do to keep himself occupied as he’s carried out of the building and placed inside the trunk of a car. The only real definite that he had was that he would be returned eventually. He swallows anxiously, gagging on the taste of all the men’s boxers shoved inside. No matter the end result, the experience wouldn’t be pleasant for him.\r\n\r\nThings are too quite in the trunk for the Matsu to focus on anything but his own thoughts, occasionally interrupted by the dildo still thrusting inside of him and causing him to squirm in the sack as much as he was able to."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54050048, "type": "ic", "edited": "2019-01-11T07:00:39.493580", "format": "raw", "posted": "2019-01-11T07:00:39.493580", "text": "The employees reach the worker's house within fifteen minutes, each one helping to move the sack through the front door. They're still careful as they walk inside, laying the sack down gently on the floor.\r\n\r\n\"Aw, he looks scared,\" one of the men taunts as he squats down to get a closer look. \"I'll bet you want out of that sack after spending a whole day in there, huh? Wanna put your cock on display for us?\"\r\n\r\nHe gives him a kiss to his bulging cheek as the men look for a way to deflate the sack, eventually finding a plug to pull out. When they do, two of them surround Choro, making sure to hold him down when the sack is completely deflated."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54050106, "type": "ic", "edited": "2019-01-11T07:06:06.120031", "format": "raw", "posted": "2019-01-11T07:06:06.120031", "text": "If he weren’t being held down, Choro’s first action would be to thrash. And not even in an escape attempt, he’s just finally able to cum from the dildo thrusting in his ass now that the latex isn’t holding him nearly as tightly as it had before. He goes still afterwards, flushing with shame and a brief surge of panic.\r\n\r\nHe wasn’t supposed to cum unless Tanaka ordered him too. He’d have to be punished for this too if it got out.\r\n\r\nChoro pants around the boxers in his mouth, nostrils flaring as he looks up to the three men and shakes his head. Of course he doesn’t want to have his cock on display from them. He wasn’t even supposed to get out of the sack until it deflated on its own."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54050236, "type": "ic", "edited": "2019-01-11T07:15:36.187613", "format": "raw", "posted": "2019-01-11T07:15:36.187613", "text": "The two men laugh as the remaining employee leaves the room momentarily. Both of them give his cheeks a poke, chuckling as Choro panics and shakes his head.\r\n\r\n\"Aw, don't be like that,\" one of them chuckles. \"We just want to see that cute cock of yours. No need to be so scared.\"\r\n\r\nThe third man returns with a huge roll of tape and a coil of rope, his partners removing Choro from the sack and holding him still as he's mummified. His nipple clamps stay put as he's wrapped up, bound completely except for his nipples, cock, face, and feet.\r\n\r\nHe's then strung up by rope from a hook on the ceiling, keeping him suspended upright in the air. The three kidnappers take time to admire him, pulling him by his nipple clamps to make him swing back and forth.\r\n\r\n\"How about we make you feel good? Do you want us to suck you off?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54050353, "type": "ic", "edited": "2019-01-11T07:22:42.428260", "format": "raw", "posted": "2019-01-11T07:22:42.428260", "text": "Choro can only grunt in response to the man, eyes narrowing with disdain. He was scared, sure, but he thought he was doing an alright job of covering it up.\r\n\r\nHe twists in the men’s grip as they hold him until the tape wrapping around him makes it impossible to move. Out of the frying pan and into the fire it would seem. He’s just trading one type of encasement for another and that doesn’t seem fair.\r\n\r\nThere’s more jerking movements when the ropes wrap around his upper body and he ends up getting hoisted into the air for all of them to see - the perfect position to be toyed with like some plaything. Choro’s completely at their mercy.\r\n\r\nChoro tosses his head back, whimpering loudly when the half forgotten clamps start getting pulled on and send a flare of pain through his chest and straight to his twitching cock that’s starting to regain some life."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54318203, "type": "ic", "edited": "2019-01-25T07:37:19.635123", "format": "raw", "posted": "2019-01-25T07:37:19.635123", "text": "The employees don't have a care in the world as they torture Choro. Each whimper that leaves his stuffed mouth is music to their ears, urging them to yank harder on the clamps to break him down further. His growing erection doesn't escape their notice, all attention soon shifting to Choro's cock.\r\n\r\n\"I think you're enjoying this more than you think,\" one chuckles, bending down to stroke Choro off. \"Were you always a disgusting pervert, or did Tanaka really break you down this much already?\"\r\n\r\nHe gives the tip a quick kiss, licking his lips as an employee embraces Choro's suspended form from behind to tug on his clamps.\r\n\r\n\"Either way, we're going to have quite a bit of fun making you cum over and over again... whether you like it or not.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54318298, "type": "ic", "edited": "2019-01-25T07:46:20.545519", "format": "raw", "posted": "2019-01-25T07:46:20.545519", "text": "A thin sheen of sweat glistens on what few parts of Choromatsu remain uncovered in his bondage. All the attention, whether it be on his clamped nipples or erect cock, does absolutely nothing to hide his humiliation and his skin is flushed pink from exertion and shame. He can’t pinpoint what’s happening to his body at all. He can’t say whether or not he’s always been like this because he has no similar experiences to draw conclusions from.\r\n\r\nWas it normal for him to react this way so soon after being given his new purpose in life? Probably not.\r\n\r\nChoro’s toes curl in pleasure when the employee kisses the tip of his cock, mixed with the pain from the clamps not even a second later and confusing the poor Matsu even more. Just what part of this treatment was he getting off on anyway?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54850845, "type": "ic", "edited": "2019-02-24T05:28:48.224274", "format": "raw", "posted": "2019-02-24T05:28:48.224274", "text": "The third employee takes out his phone to record the spectacle before whipping out his cock to stroke it off. Meanwhile, his coworkers continue to toy with Choro's cock and nipples without mercy. Kissing the tip soon turns to sucking him off, his hot wet tongue swiping along the shaft as he hangs in the air uselessly.\r\n\r\n\"Maybe I should put this video on a porn site? Show the world how much of a pain slut this guy is. What do you think about that?\"\r\n\r\nHe zooms in on Choro's face as the employee behind him tugs on his nipple clamps, the man sucking him off taking him even deeper into his mouth."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54853033, "type": "ic", "edited": "2019-02-24T07:44:50.626119", "format": "raw", "posted": "2019-02-24T07:44:50.626119", "text": "The only plus side that Choro can see is that the room has finally stopped spinning. Though the thought is put immediately out of his mind when he feels a warm mouth around his cock. His labored and muffled breathing quickens as his cock twitches and he tries to thrust his hips and fuck the man’s throat.\r\n\r\nHe hardly even notices the camera on him, eyes rolling back with pain when the clamps are pulled. But it does prove the employee’s point to the letter. \r\n\r\nAt nearly the exact same time that the clamps send a sharp pain through his nipples, he cums in the other employee’s mouth."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54938108, "type": "ic", "edited": "2019-03-01T05:09:09.739179", "format": "raw", "posted": "2019-03-01T05:09:09.739179", "text": "The employee swallows Choro's cum when he releases, the other gently stroking his cheeks. It's a stark contrast to the rough tugs from the nipple clamps, although his words aren't any less harsh.\r\n\r\n\"Damn, you really are a slut, aren't you?\" He whispers in his ear, sadism coating every word. \"We said we'd bring you back to your precious Tanaka, but until then, we have all night to spend using you as we please.\"\r\n\r\nWith a sharp bite to his earlobe, he gives Choro another tug to the nipples.\r\n\r\n\"I wonder how many times you can cum before you become a mess?\" He muses."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54938238, "type": "ic", "edited": "2019-03-01T05:17:28.009049", "format": "raw", "posted": "2019-03-01T05:17:28.009049", "text": "Choro whines, breathing heavily through his nose at the rough treatment. His clamped nipples are sore and aching from being pinched and tugged on. \r\n\r\nHe hangs his head in shame at the employee’s words. He didn’t want them to be true but he’d cum several times during his new full time job with the company. It was likely that he was a slut and just didn’t know it until now.\r\n\r\nChoro winces when he bites his earlobe, cock twitching back to life."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54938539, "type": "ic", "edited": "2019-03-01T05:36:25.001153", "format": "raw", "posted": "2019-03-01T05:36:25.001153", "text": "\"That's what I thought,\" the employee purrs as he notices his cock twitching to another erection. \"Tell you what, how about we leave you like this all night with a toy on that dick of yours? Then when morning comes, we'll take you back to Tanaka, all wrapped up like a present.\"\r\n\r\nThe other men agree, leaving Choro alone for a few minutes while they search for a vibrating wand toy. Taping it securely against his already wrapped form, they don't give him a moment to rest before clicking it onto a high setting.\r\n\r\n\"One last thing before we leave you alone for the night,\" one says before tying a thick blindfold around Choro's eyes. \"There, now you're completely helpless. Well, have fun tonight, okay? There's six hours to go until we bring you back to Tanaka's office.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54938599, "type": "ic", "edited": "2019-03-01T05:41:30.140870", "format": "raw", "posted": "2019-03-01T05:41:30.140870", "text": "Choro wants to say no and prove that he isn’t the slut the employees are making him out to be. He could protest through his gag made of their boxers but it would only come out as muffled and could be taken to mean anything. Especially when his protests now were already mixed in with moans of pleasure that he can’t help but make the longer he’s forced into these predicaments.\r\n\r\nHe squeals when the vibrator wand now taped to his cock buzzes to life and immediately fills him with pleasure and causes to cum again, wiggling uselessly in his suspended mummification.\r\n\r\nOnce he’s blinded, Choro feels like the vibrations intensify and through the rest of the night he soaks through the boxers with drool and cums onto the floor below him and creates a decently sized puddle over the next few hours before he’s run out of cum and falls into a fitful sleep."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54939228, "type": "ic", "edited": "2019-03-01T06:20:03.886399", "format": "raw", "posted": "2019-03-01T06:20:03.886399", "text": "When morning comes, the vibrator faintly buzzes from the lack of battery power. The employees have just returned from their night shift and are prepared to return Choro to where they found him as they turn off the toy. The pile of cum on the floor doesn't escape their notice, one employee removing the boxers and wiping up the mess before shoving them back inside Choro's mouth.\r\n\r\nThey carefully take him down from the ceiling and place him into a long box, sealing it up with a small amount of tape to prevent escape. When they're satisfied, they move the box into the back of their car, driving off without a care in the world.\r\n\r\nThey manage to arrive before Tanaka gets there, placing the box in front of his door and scampering off before anybody notices."}]