[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54939368, "type": "ic", "edited": "2019-03-01T06:29:02.801546", "format": "raw", "posted": "2019-03-01T06:29:02.801546", "text": "In his unconscious state, Choro doesn’t notice that he sucks on the cum soaked boxers once they’re placed in his mouth, he hardly even registers that the gag left to begin with or that he’s moved into a different box for transportation and delivery.\r\n\r\nWhen he does wake up, still blindfolded, the only thing he manages to piece together is that the vibrator is no longer taped to his cock.\r\n\r\nFrom there he’s completely clueless that he’s just outside Tanaka’s office door waiting for his master to return."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 54976135, "type": "ic", "edited": "2019-03-03T07:06:27.195449", "format": "raw", "posted": "2019-03-03T07:06:27.195449", "text": "When Tanaka arrives in front of his office door, he doesn't expect to find a big box waiting for him. At first he thinks it's just a gift from a random employee, unaware that Choro was kidnapped the night before. He doesn't hear a single noise from inside his office, figuring that his pet is sleeping soundly somewhere inside.\r\n\r\nWhen he goes to unlock the door, he realizes that the door is already unlocked. Had he forgotten lock it yesterday when he left Choro ol alone? Was there a possibility he escaped? If that was the case, he would have to send out employees to find and recapture him.\r\n\r\nIt doesn't take him long to put two and two together when he opens the door and finds not only Choro missing, but the latex bondage bag.\r\n\r\nGrumbling to himself, Tanaka retrieves scissors from his desk to cut open the tape sealing the box shut, opening it to find none other than Choro blindfolded and gagged with several pairs of boxers.\r\n\r\nHe touches his toy's face, his hands soft and gentle as he takes off his blindfold. The boxers are the next to be removed, Tanaka grimacing at the wetness from the cum and saliva.\r\n\r\n\"My sweet little toy,\" he whispers gently, hand resting against his forehead. \"What happened to you?\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 54998298, "type": "ic", "edited": "2019-03-04T08:40:33.343242", "format": "raw", "posted": "2019-03-04T08:40:33.343242", "text": "There’s a minuscule flinch from Choro when he hears the box being opened, his muffled protests to be freed becoming silent. Had the employees come back? Had he actually been returned in the first place? Several other questions run through Choro’s mind as he works himself into a panic. \r\n\r\nHe’d already learned his lesson about trying to escape, and he couldn’t even finish getting through the punishment. What would Tanaka think? It wasn’t even his fault, but would he need to be punished again? Choro’s breath is quick to pick up and he’s already crying and sniffling by the time that the CEO removes the blindfold. A rush of relief floods through Choro when he sees Tanaka but in the end it only makes him cry harder.\r\n\r\n“...-‘M -‘m -‘m sorry!” He hiccups, voice wavering as he shakes in his new bindings. He doesn’t know where the latex bag ended up during all the commotion. “There...t-there were p-p-p-people and an...and they t-took me!” \r\n\r\nChoro’s chest almost hurts as he tries and explains through the tears, causing him to struggle harder against the rope in his panic. So far he’d worked extremely well with being so tightly confined but right now it feels too constricting."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 55003789, "type": "ic", "edited": "2019-03-04T18:32:50.141635", "format": "raw", "posted": "2019-03-04T18:32:50.141635", "text": "Tanaka's face softens as Choro cries, giving him his utmost attention while he apologizes and tells him what happened. His brows furrow when he says he was kidnapped, but he keeps his anger at bay by softening his expression in an effort to not send Choro into an even bigger panic.\r\n\r\n\"I should have seen this coming,\" he sighs, his hands beginning to untie the rope. \"My pets in the past have been taken by lustful employees, sometimes they've even been gone for several days. Be thankful that the people who took you didn't sell you off, that's happened once before, then I fired them.\"\r\n\r\nTanaka grabs for a pair of scissors on his desk to cut away Choro's tape mummification, leaving just his naked body behind. He then removes the nipple clamps and dildo in his ass before lifting him up and embracing him, grip firm yet gentle enough to not be too constricting.\r\n\r\n\"I'll track down whoever did this to you, then punish them accordingly.\" Tanaka rests Choro's head against his chest, his heartbeat pounding in rage. \"I promise I'll lock the door in the future, so don't worry about that.\""}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55023506, "type": "ic", "edited": "2019-03-05T18:00:47.479794", "format": "raw", "posted": "2019-03-05T18:00:47.479794", "text": "Tanaka had likely made the right decision in schooling his expression, if he looked angry while staring directly at him, Choro was more likely to think that his “disobedience” was the cause. He’s already having a hard enough time trying to stop his tears because he’s afraid he’ll be punished for that too. It didn’t seem like an option before but the night shift employees had only laughed or mistreated him more when he cried in their care. But eventually his breathing calms when no consequences seem to come from Tanaka.\r\n\r\nChoro is still a little sniffly as he settles down, blinking away his tears as he realizes that this is the first time that he’s been unbound since he walked into the office the day prior. He wraps his arms around Tanaka, taking comfort in the protective embrace. He didn’t want anything like what happened to the others to happen to him.\r\n\r\n“Okay,” he mumbles, pressing his head into the man’s shoulder. “‘M sorry, I didn’t want you to think that I ran away. I tried to explain I was being punished.”"}]