[{"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55752606, "type": "ooc", "edited": "2019-04-17T05:42:07.680336", "format": "raw", "posted": "2019-04-17T05:42:07.680336", "text": "(( done!"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55752662, "type": "ic", "edited": "2019-04-17T05:46:12.723017", "format": "raw", "posted": "2019-04-17T05:46:12.723017", "text": "Totoko’s so happy to see that the manager seems like the sort of have a cheerful disposition. She’d been looking forward to starting this job as soon as she knew it was definitely hers.\r\n\r\n“Of course, I understand completely,” she responds, bowing her head. “I don’t think I would want to see Ms. Nakano without my uniform anyway. I want to make a great first impression!”\r\n\r\nShe follows after him dutifully, fiddling absently with her new tongue piercing as she was still not used to it being there. “I’ll take all the help I can get. I’m really excited to be working here.”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55752745, "type": "ic", "edited": "2019-04-17T05:52:14.045099", "format": "raw", "posted": "2019-04-17T05:52:14.045099", "text": "\"I'm very glad to hear that, Ms. Yowai,\" the manager says as he leads her to the photo shoot room. She seemed to be completely oblivious to what was really happening. Naomi was very much a sadist, who treated her previous assistants like sex toys. The uniform for the job was also very humiliating, leaving the assistant no choice but to squirm on their knees.\r\n\r\nWhen they arrive, the manager pulls out the rubbery uniform, showing it off to Totoko.\r\n\r\n\"This might be a bit embarrassing, but it's Naomi's orders.\" He lightly chuckles. \"Would you mind stripping for me, dear? I'll fasten you inside after.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55752789, "type": "ic", "edited": "2019-04-17T05:56:04.140158", "format": "raw", "posted": "2019-04-17T05:56:04.140158", "text": "Totoko’s expression when she sees the uniform is priceless. Her eyebrows lift and her mouth forms a small ‘o’ of surprise as she takes it in. She was very much oblivious to the Hell she was about to go through. Currently however, she just takes it as a very very strange choice of uniform for a personal assistant.\r\n\r\n“Uh, yes, certainly,” stammers Totoko before she quickly starts to strip out of her clothes. \r\n\r\nFor a brief moment she considers leaving her bra and panties on before she sees that the uniform looks tighter than anything she’s worn before and decides against it. Now it’s plain to see that she went through on the other requirement with two rings hanging from her nipples."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55752848, "type": "ic", "edited": "2019-04-17T06:01:29.034256", "format": "raw", "posted": "2019-04-17T06:01:29.034256", "text": "The manager's gaze falls on Totoko's body as she strips down, unable to stop his growing erection. Her nipples were nicely pierced, and he has to focus back on the present moment when he imagines them being tugged to Hell and back.\r\n\r\n\"Thank you for your cooperation,\" he says as he begins to fasten her inside. The outfit fits tightly around her body, forcing her to her knees and causing her breasts to stick out. The the armbinder is fastened on, forcing them out further.\r\n\r\n\"You look lovely,\" he whispers, feeling up her breasts as they're exposed through the outfit. \"How do you feel? I'll bet very uncomfortable, just the way Naomi likes it.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55752900, "type": "ic", "edited": "2019-04-17T06:05:57.009595", "format": "raw", "posted": "2019-04-17T06:05:57.009595", "text": "She doesn’t really notice that something’s wrong until her legs start to get tucked underneath her and held in place with no chance of moving more freely unless she was let out. Then when her breasts are squeezed through the two holes on the chest that constrict them - pushed even more out when her shoulders are forced back by the arm binder.\r\n\r\nTotoko gasps in shock when she sees herself in the mirror on the wall, squirming uselessly when she feels the manager’s hands on her chest.\r\n\r\n“E-Excuse me! This...this has to be a mistake!”"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55752947, "type": "ic", "edited": "2019-04-17T06:10:29.385418", "format": "raw", "posted": "2019-04-17T06:10:29.385418", "text": "The manager chuckles darkly when Totoko finally realizes that something is wrong, her useless struggles making him harder.\r\n\r\n\"A mistake? Oh no, dear. The only mistake is you signing your life away to the lovely Naomi.\" He tugs at her nipples before continuing. \"An idol has many desires, especially when she's so stressed all the time. So she's going to use you as a sex doll, and there's nothing you can do about it.\"\r\n\r\nHe lets go of Totoko to shuffle through his bag, pulling out a ring connected to two more.\r\n\r\n\"Be a good girl and open wide...\" he says as he plugs her nose."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55752994, "type": "ic", "edited": "2019-04-17T06:13:48.412046", "format": "raw", "posted": "2019-04-17T06:13:48.412046", "text": "Oh she doesn’t like that laugh at all. She does what she can to make herself seem smaller, tears starting to well up in the corners of her eyes.\r\n\r\n“I didn’t do that! I ah!” She cries out in pain when her nipple rings are tugged on, unable to cover herself up for protection. \r\n\r\nShe shivers in fear at the idea of being used as a stress reliever for an idol, looking at the rings in confusion. “What is tha-“"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55753068, "type": "ic", "edited": "2019-04-17T06:19:19.739883", "format": "raw", "posted": "2019-04-17T06:19:19.739883", "text": "The manager uses the opportunity to attach one of the rings to her tongue piercing, stretching the other two down to her nipple piercings.\r\n\r\n\"Bet that hurts like a bitch,\" he laughs, sticking two fingers in her mouth. \"Unfortunately for you, we aren't quite done yet.\"\r\n\r\nHe gives her a kiss to the cheek and pulls his fingers away, rummaging through the bag to pull out a hook with a rope at the end. The manager fills Totoko's ass with the hook, tying the rope to her ponytail to force her head back.\r\n\r\n\"How do you feel now?\" He asks, squeezing her breasts. \"Tell me through those adorable tears.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55753130, "type": "ic", "edited": "2019-04-17T06:25:08.693659", "format": "raw", "posted": "2019-04-17T06:25:08.693659", "text": "Totoko squeals in pain as soon as the rings are connected to the nipple piercings she was made to get. It hurts almost immediately, especially when the manager has his fingers in her mouth and she can’t lower her head to lesson the pain in her stretched nipples. \r\n\r\nShe’s practically forced to keep her tongue sticking out, drooling onto the manager’s hand. \r\n\r\nIt’s worse when the hook slips into her ass, pulled by the rope and unable to be pulled out of her when it’s secured even more tightly to her ponytail. It pulls more on her piercings and nipples and she squirms and moves to try and find a position where she isn’t either pulling her nipples or impaling her own ass. But the task proves impossible.\r\n\r\n“Pwaaaheeeheee!!!” She yelps unintelligibly, crying uncontrollably."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55753185, "type": "ic", "edited": "2019-04-17T06:31:09.519992", "format": "raw", "posted": "2019-04-17T06:31:09.519992", "text": "The manager grows fully erect at Totoko's cries and screams, smirking as she tries to communicate through slurred speech.\r\n\r\n\"There's nothing Naomi loves more than a drooling, helpless, unintelligible sex doll,\" he says as he pulls out two more objects. Two pairs of nose hooks, which he straps to Totoko to complete her humiliation. Her nostrils are stretched out, giving her face a deformed look.\r\n\r\n\"Now we just need to take your picture for your ID,\" he says, giving her a smack on the ass. \"Go on, crawl over in front of the cameras. It'll be over before you know it.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55753237, "type": "ic", "edited": "2019-04-17T06:35:28.167403", "format": "raw", "posted": "2019-04-17T06:35:28.167403", "text": "Totoko continues to cry, unable to squirm any further away from the manager to prevent the application of the nose hooks. They hurt in their own way, but the pain is minor compared to her nipples and ass. \r\n\r\nGiven her command, she swallows nervously and yelps when he slaps her ass. The cameras look so far away!\r\n\r\nWithout any other options, she starts to scoot forward on her knees, crying uncontrollably as the movement moves the hook inside her and she tries to keep her head down to alleviate the pain in her nipples. Eventually she makes it, knelt in front of the camera set up with her makeup smudged, nostrils stretched out, and pierced tongue sticking out as drool pools down onto her bare chest."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 55941171, "type": "ic", "edited": "2019-04-27T22:42:52.124167", "format": "raw", "posted": "2019-04-27T22:42:52.124167", "text": "Totoko's pathetic face makes the manager laugh as he steps behind the camera. Snapping a few shots, he snickers as the camera captures several humiliating images of Totoko. When he's done, he leaves his spot to approach Totoko.\r\n\r\n\"You look so repulsive like this,\" he says, giving her clamps a yank. \"Naomi will adore seeing such a cute thing like you reduced to a pig-faced, latex sex doll.\"\r\n\r\nHe gives her a kiss to the cheek, just in time for the door to open and for Naomi to walk in.\r\n\r\n\"So this is her?\" She scoffs as she examines Totoko. \"Kind of cute I guess... not as cute as me, but she'll do.\"\r\n\r\nLeaning down, Naomi gives Totoko a sadistic grin.\r\n\r\n\"Kiss your old life goodbye, you only exist to be my sex doll from now on.\"\r\n\r\nWith a slap to the face, she stands up, waving Totoko over.\r\n\r\n\"Come on, slut. My dressing room is this way.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 55942201, "type": "ic", "edited": "2019-04-28T00:04:20.351616", "format": "raw", "posted": "2019-04-28T00:04:20.351616", "text": "She was accustomed to being called cute not repulsive! The insult brings fresh tears to Totoko’s deformed face, sobbing and drooling uncontrollably even as her pictures are taken. At least one of the shots would become her official ID for the agency.\r\n\r\nTotoko looks up when she hears the female voice, yelping when she ends up yanking her own clamps. She’s seen Naomi on TV before so it isn’t hard to recognize the idol. \r\n\r\nThe poor girl flinches when the idol slaps her across the face, a faint handprint appearing on her pale skin. Morosely, she waddles after the idol on her knees, working around the hook in her ass to try and move comfortably."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 56655971, "type": "ic", "edited": "2019-06-08T21:41:09.383273", "format": "raw", "posted": "2019-06-08T21:41:09.383273", "text": "Naomi smirks as Totoko waddles behind her, pleased to see her in such a humiliating position. She would be sure to provide her entertainment for a long time, serving as a doll that only existed for sexual pleasure.\r\n\r\nBy the time both of them reach the door to Naomi's dressing room, the idol has worked herself up with fantasies of what she wanted to do with Totoko. The feeling only increases when she opens the door, revealing a kit of BDSM gear she laid out on her desk. Along with this, a cage big enough for Totoko to fit in on the floor.\r\n\r\nYanking her by the clamps, Naomi drags her inside to begin her training. She starts by pulling out small nostril breathing tubes, shoving them inside Totoko's lifted nose. Then she uses plastic wrap to seal her mouth, giggling as her pierced tongue presses against the wrap. The wrap goes around her whole head, blurring her vision and hearing with only the tubes sticking out.\r\n\r\nNaomi, satisfied with how pitiful Totoko looks, grabs the back of her head and plugs the tubes shut with her fingers."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "FF6FF2", "show_edited": false, "id": 56660760, "type": "ic", "edited": "2019-06-09T02:45:16.136828", "format": "raw", "posted": "2019-06-09T02:45:16.136828", "text": "It’s a miserable trip for Totoko, crawling along with the anal hook yanking on her hair and causing her to tug on her own clamps. The worst part about this set up is a lot of her torment is now self inflicted - leaving her to drool and whine the entire trip to Naomi’s dressing room.\r\n\r\nShe takes in her surroundings curiously, frightened of the empty cage that she catches sight of. There was no doubt in her mind that the cage was meant to hold her whenever the idol was done playing with her. Which she doesn’t think will be for quite some time.\r\n\r\nTotoko gags at the sudden intrusion to her nose, breathing shallowly through the tubes and trying to soothe her nerves seconds before Naomi starts wrapping her face. She can still see but only barely as the wrapping continues - sitting as still as she can when the pressure on her tongue creates a constant pull on the nipple clamps and stretches her poor buds up a few inches. \r\n\r\nWhen Naomi cuts off her only air supply, it takes just a couple seconds before she starts twisting and squirming - letting out muffled cries as she only pulls on the clamps and hook more."}]