[{"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48698182, "type": "ic", "edited": "2018-03-12T05:58:31.098240", "format": null, "posted": "2018-03-12T05:58:31.098215", "text": "For the Casino RP!\r\n\r\nhttps://www.cherubplay.co.uk/chats/42005aca-ac6d-4ecd-9862-89a02af0fbb1/"}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48698225, "type": "ic", "edited": "2018-03-12T06:01:42.260153", "format": null, "posted": "2018-03-12T06:01:42.260153", "text": "Oso’s eyes narrow as the cotton boxers fill his mouth and prevent him from saying his piece. Sure he’d been reprimanded by other casinos before but this was out of line. It had to be illegal to treat someone this way. He grunts through the fabric questioningly at Boss as if he were expecting the man to say that he was joking."}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48776692, "type": "ic", "edited": "2018-03-16T23:17:06.503435", "format": null, "posted": "2018-03-16T23:17:06.503435", "text": "Boss chuckles at Oso's bound and gagged form, reaching for clamps and tape nearby and approaching the NEET with them.\r\n\r\n\"You won't be needing that hoodie for the remainder of your time here,\" he says as he snips away at it, revealing his smooth skin underneath. Boss pokes and prods at his nipples and stomach before applying clamps to the former, tugging and flicking at them.\r\n\r\n\"I have a lot more where that came from, Osomatsu-kun,\" he chuckles, wrapping the tape around his form that presses him tighter to the chair. \"Not to mention lots of gags and toys to go into your whore mouth.\""}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48782823, "type": "ooc", "edited": "2018-03-17T05:53:27.297771", "format": null, "posted": "2018-03-17T05:53:27.297771", "text": "(( I just brainstormed a ton of ideas for potential RPs. would you like to hear them?"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48796277, "type": "ooc", "edited": "2018-03-18T03:09:36.636024", "format": null, "posted": "2018-03-18T03:09:36.636024", "text": "(( Also idk if you knew this, but if you're ever worried about forgetting login information, you can go to settings and put in your email address to have it mailed there."}, {"symbol": 1, "symbol_character": "🌀", "handle": "🌀", "colour": "000000", "show_edited": false, "id": 48797191, "type": "ooc", "edited": "2018-03-18T03:58:41.938911", "format": null, "posted": "2018-03-18T03:58:41.938911", "text": "Yes send them to me! \r\n\r\nAnd thanks for the info, I’ll set that up! I’ve been really busy at the scene shop so I haven’t had time"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48799687, "type": "ooc", "edited": "2018-03-18T06:30:40.477059", "format": null, "posted": "2018-03-18T06:30:40.477059", "text": "(( no problem! And it's alright, no rush!\r\n\r\nas for those ideas, here they are!\r\n\r\n• A Matsu goes to a carnival, but is kidnapped and forced to be part of an attraction.\r\n• A Matsu gets arrested for a crime he didn't commit, and is kept as the police pet.\r\n• An angel Matsu's wings get injured and he lands in the yard of a collector, who keeps him locked in a cage and frequently tortured.\r\n• While at an idol concert, Choro gets tied up by fanboys and used publicly. The idol finds out and decides to keep him as a permanent toy.\r\n• A Matsu is left home alone, only for the house to get broken into by robbers who decide to keep the Matsu as a little prize.\r\n• A Matsu gets kidnapped by a BDSM cult and is forced to undergo extreme bondage training sessions\r\n• A Matsu gets assigned under the NEET Correctional Facility, only to discover that it's an institution meant to break people sexually.\r\n• The Matsus go on vacation to an island, soon learning that it's inhabited by horny monster girls"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48833310, "type": "ooc", "edited": "2018-03-20T03:18:00.176546", "format": null, "posted": "2018-03-20T03:18:00.176546", "text": "(( got a few others!\r\n\r\n• A Matsu gets a free gym membership, only to discover that he's stuck there as a toy permanently, forced to use the machines with some sexual modifications.\r\n• A Vampire Matsu is kidnapped by a vampire hunter. Instead of being killed, he's kept as a pet.\r\n• Akuma Rider Matsus get into a lot of trouble with other biker gangs, and get caught off-guard as they're kidnapped and forced to serve them as pets.\r\n• A Matsu gets put on a game show, but as a permanent feature for people to toy with and fuck as a reward.\r\n• A Matsu signs up to test a VR system after being promised money, but it turns out to be sexual simulations where he's heavily bound and toyed with, kept as a test subject permanently"}, {"symbol": 0, "symbol_character": "●", "handle": "●", "colour": "000000", "show_edited": false, "id": 48863979, "type": "ooc", "edited": "2018-03-21T21:49:05.425771", "format": null, "posted": "2018-03-21T21:49:05.425771", "text": "(( hope you're doing well!"}]